// 净利润情况变动图	

let profitChartData = {
    columns: ['日期', '净利润', '扣除非经常损益净利润'],
    rows: [{
            '日期': '2015年',
            '净利润': 8848.52,
            '扣除非经常损益净利润': 6048.53
        },
        {
            '日期': '2016年',
            '净利润': 10674.11,
            '扣除非经常损益净利润': 10074.11
        },
        {
            '日期': '2017年',
            '净利润': 10080.85,
            '扣除非经常损益净利润': 8080.85
        },
        {
            '日期': '2018年',
            '净利润': 11599.70,
            '扣除非经常损益净利润': 11099.70
        },
        {
            '日期': '2019年',
            '净利润': 11708.17,
            '扣除非经常损益净利润': 11008.17
        }
    ]
}
let profitChartTotalData = {
    columns: ['日期', '净利润', '扣除非经常损益净利润'],
    rows: [{
            '日期': '2015年',
            '净利润': 8848.56,
            '扣除非经常损益净利润': 8048.56
        },
        {
            '日期': '2016年',
            '净利润': 10674.11,
            '扣除非经常损益净利润': 10074.11
        },
        {
            '日期': '2017年',
            '净利润': 11080.85,
            '扣除非经常损益净利润': 10080.85
        },
        {
            '日期': '2018年',
            '净利润': 11599.70,
            '扣除非经常损益净利润': 11099.70
        },
        {
            '日期': '2019年',
            '净利润': 11708.17,
            '扣除非经常损益净利润': 11008.17
        }
    ]
}

let profitChartSettings = {
    metrics: ['净利润', '扣除非经常损益净利润'],
    dimension: ['日期']
}

//

let mainChartData = {
    columns: ['日期', '营业收入', '营业成本', '营业毛利率'],
    rows: [{
            '日期': '2015年',
            '营业收入': 133454.93,
            '营业成本': 119299.98,
            '营业毛利率': 4.61
        },
        {
            '日期': '2016年',
            '营业收入': 153130.42,
            '营业成本': 135608.59,
            '营业毛利率':5.44
        },
        {
            '日期': '2017年',
            '营业收入': 156494.52,
            '营业成本': 139177.78,
            '营业毛利率': 9.07
        },
        {
            '日期': '2018年',
            '营业收入': 162108.25,
            '营业成本': 143880.40,
            '营业毛利率': 10.24
        },
        {
            '日期': '2019年',
            '营业收入': 162670.20,
            '营业成本': 144330.80,
            '营业毛利率': 12.27
        }
    ]
}
let mainChartData1 = {
    columns: ['日期', '销售费用', '管理费用', '财务费用', '研发费用', '期间费用占营业收入占比'],
    rows: [{
            '日期': '1月',
            '销售费用': 562108.93,
            '管理费用': 519299.98,
            '财务费用': 189299.98,
            '研发费用': 775608.59,
            '期间费用占营业收入占比': 10.61
        },
        {
            '日期': '2月',
            '销售费用': 562108.93,
            '管理费用': 519599.98,
            '财务费用': 185608.59,
            '研发费用': 735608.59,
            '期间费用占营业收入占比': 11.44
        },
        {
            '日期': '3月',
            '销售费用': 562108.93,
            '管理费用': 545299.98,
            '财务费用': 135608.59,
            '研发费用': 735608.59,
            '期间费用占营业收入占比': 5.07
        },
        {
            '日期': '4月',
            '销售费用': 562108.93,
            '管理费用': 519459.98,
            '财务费用': 135608.59,
            '研发费用': 735608.59,
            '期间费用占营业收入占比': 11.24
        },
        {
            '日期': '5月',
            '销售费用': 1062108.93,
            '管理费用': 519299.98,
            '财务费用': 1852308.59,
            '研发费用': 735608.59,
            '期间费用占营业收入占比': 6.27
        },
        {
            '日期': '6月',
            '销售费用': 162108.25,
            '管理费用': 183880.40,
            '财务费用': 519299.98,
            '研发费用': 1034108.93,
            '期间费用占营业收入占比': 11.24
        },
        {
            '日期': '7月',
            '销售费用': 162108.25,
            '管理费用': 183880.40,
            '财务费用': 515492.98,
            '研发费用': 106232.93,
            '期间费用占营业收入占比': 3.24
        },
        {
            '日期': '8月',
            '销售费用': 162108.25,
            '管理费用': 183340.40,
            '财务费用': 519299.98,
            '研发费用': 106208.93,
            '期间费用占营业收入占比': 11.24
        },
        {
            '日期': '9月',
            '销售费用': 562108.93,
            '管理费用': 519299.98,
            '财务费用': 135608.59,
            '研发费用': 735308.59,
            '期间费用占营业收入占比': 6.24
        },
        {
            '日期': '10月',
            '销售费用': 562108.93,
            '管理费用': 519299.98,
            '财务费用': 135608.59,
            '研发费用': 735348.59,
            '期间费用占营业收入占比': 11.24
        },
        {
            '日期': '11月',
            '销售费用': 106218.93,
            '管理费用': 519299.98,
            '财务费用': 135348.59,
            '研发费用': 735608.59,
            '期间费用占营业收入占比': 8.24
        },
        {
            '日期': '12月',
            '销售费用': 162108.25,
            '管理费用': 513499.98,
            '财务费用': 135608.59,
            '研发费用': 106108.93,
            '期间费用占营业收入占比': 11.24
        },


    ]
}
let mainChartTotalData = {
    columns: ['日期', '营业收入', '营业成本', '营业毛利率'],
    rows: [{
            '日期': '2015年',
            '营业收入': 133454.93,
            '营业成本': 119299.98,
            '营业毛利率': 10.61
        },
        {
            '日期': '2016年',
            '营业收入': 153130.42,
            '营业成本': 135608.59,
            '营业毛利率': 11.44
        },
        {
            '日期': '2017年',
            '营业收入': 156494.52,
            '营业成本': 139177.78,
            '营业毛利率': 11.07
        },
        {
            '日期': '2018年',
            '营业收入': 162108.25,
            '营业成本': 143880.40,
            '营业毛利率': 11.24
        },
        {
            '日期': '2019年',
            '营业收入': 162670.20,
            '营业成本': 144330.80,
            '营业毛利率': 11.27
        }
    ]
}

let mainChartSettings = {
    showLine: ['营业毛利率'],
    axisSite: {
        right: ['营业毛利率']
    }
}
let mainChartSettings1 = {
    area: true,

    showLine: ['期间费用占营业收入占比'],
    axisSite: {
        right: ['期间费用占营业收入占比']
    },


}
let chartSettings7 = {
    area: true,
    showLine: ['主营业务收入基数'],
    axisSite: {
        right: ['主营业务收入基数']
    },
}
let chartSettings8 = {
    area: true,
    showLine: ['净利润含金量','净利润含金量指数','净利润含金量标准值'],
    axisSite: {
        right: ['净利润含金量','净利润含金量指数','净利润含金量标准值']
    },
}
let chartSettings9 = {
    area: true,
    showLine: ['营业收入含金量指数','营业收入含金量标准值'],
    axisSite: {
        right: ['营业收入含金量指数','营业收入含金量标准值']
    },
}
let businessChartSettings = {
    area: true,
    showLine: ['营业利润率'],
    axisSite: {
        right: ['营业利润率']
    }
}

//营业利润变动情况图	
let businessChartData = {
    columns: ['日期', '营业利润', '营业利润率'],
    rows: [{
            '日期': '2015年',
            '营业利润': 133454.93,
            '营业利润率': 7.92,
        },
        {
            '日期': '2016年',
            '营业利润': 153130.42,
            '营业利润率': 9.44,
        },
        {
            '日期': '2017年',
            '营业利润': 156494.52,
            '营业利润率': 10.07,
        },
        {
            '日期': '2018年',
            '营业利润': 162108.25,
            '营业利润率': 11.36,
        },
        {
            '日期': '2019年',
            '营业利润': 162670.20,
            '营业利润率':13.11,
        }
    ]
}
let businessChartTotalData = {
    columns: ['日期', '本期', '同期', '营业毛利率'],
    rows: [{
            '日期': '1',
            '本期': 8848.56,
            '同期': 12367.60,
            '营业毛利率': 10.61
        },
        {
            '日期': '2',
            '本期': 10674.11,
            '同期': 8848.56,
            '营业毛利率': 11.44
        },
        {
            '日期': '3',
            '本期': 11080.85,
            '同期': 10674.11,
            '营业毛利率': 11.07
        },
        {
            '日期': '4',
            '本期': 11599.70,
            '同期': 11080.85,
            '营业毛利率': 11.24
        },
        {
            '日期': '5',
            '本期': 11708.17,
            '同期': 11599.70,
            '营业毛利率': 11.27
        }
    ]
}



let chartData1 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '主营业务收入',
            '访问用户': 3530
        },
        {
            '日期': '其他业务利润',
            '访问用户': 1393
        },

    ]
}


let chartData101 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '主营业务收入',
            '访问用户': 3333
        },
        {
            '日期': '其他业务利润',
            '访问用户': 4444
        },

    ]
}
let chartData102 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '主营业务收入',
            '访问用户': 2222
        },
        {
            '日期': '其他业务利润',
            '访问用户': 3332
        },

    ]
}
let chartData103 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '主营业务收入',
            '访问用户': 1000
        },
        {
            '日期': '其他业务利润',
            '访问用户': 3332
        },

    ]
}
let chartData104 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '主营业务收入',
            '访问用户': 1000
        },
        {
            '日期': '其他业务利润',
            '访问用户': 3332
        },

    ]
}

let chartData2 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '主营业务收入',
            '访问用户': 3530
        },
        {
            '日期': '其他业务利润',
            '访问用户': 1393
        },

    ]
}
let chartData3 = {
    columns: ['日期', '收入', '支出'],
    rows: [{
            '日期': '营业总收入',
            '收入': 13345.927571,
            '支出': 23476.90
        },
        {
            '日期': '营业利润',
            '收入':8848.56326,
            '支出': 5342.01
        },
        {
            '日期': '减-销售费用',
            '收入': 414.013878,
            '支出':235.78
        },
        {
            '日期': '减-管理费用',
            '收入':500.172963,
            '支出':632.8
        },
        {
            '日期': '减-财务费用',
            '收入':4368.168201,
            '支出':234.08,
        },
        {
            '日期': '减-研发费用',
            '本期': 4931.01,
            '支出': 3428.9,
        },
        {
            '日期': '减-资产减值损失',
            '收入': 231.09,
            '支出': 243.8,
        },
        {
            '日期': '减-其他成本',
            '收入': 4121.01,
            '支出': 2360.08,
        },
        {
            '日期': '加+公允价值变动收益',
            '收入': 231.01,
            '支出': 3646.08,
        },
        {
            '日期': '加+投资收益科目',
            '收入': 4231.01,
            '支出': 1238.02,
        }
    ]
}
let chartData301 = {
    columns: ['日期', '收入', '支出'],
    rows: [{
            '日期': '营业总收入',
            '收入': 15313.415839,
            '支出': 13345.927571
        },
        {
            '日期': '营业利润',
            '收入': 10674.114602,
            '支出': 8848.56326
        },
        {
            '日期': '减-销售费用',
            '收入': 363.672461,
            '支出':414.013878
        },
        {
            '日期': '减-管理费用',
            '收入': 414.245748,
            '支出': 300.172963
        },
        {
            '日期': '减-财务费用',
            '收入': 6041.643109,
            '支出': 4368.168201,
        },
        {
            '日期': '减-研发费用',
            '收入': 234.08,
            '支出':200,
        },
        {
            '日期': '减-资产减值损失',
            '收入': 237.07,
            '支出': 531,
        },
        {
            '日期': '减-其他成本',
            '收入': 6079.08,
            '支出': 4121,
        },
        {
            '日期': '加+公允价值变动收益',
            '收入':2367.09,
            '支出': 231,
        },
        {
            '日期': '加+投资收益科目',
            '收入': 2789.01,
            '支出': 4231.09,
        }
    ]
}
let chartData302 = {
    columns: ['日期', '收入', '支出'],
    rows: [{
            '日期': '营业总收入',
            '收入': 15644.52
            ,
            '支出': 15310.42

        },
        {
            '日期': '营业利润',
            '收入': 11080.85
            ,
            '支出': 363.67

        },
        {
            '日期': '减-销售费用',
            '收入':386.32
            ,
            '支出': 431.55
        },
        {
            '日期': '减-管理费用',
            '收入': 5423.72,
           

            '支出':  395.25

        },
        {
            '日期': '减-财务费用',
            '收入': 7680.02
            ,
            '支出': 6041.64
            ,
        },
        {
            '日期': '减-研发费用',
            '收入': 4537.07
            ,
            '支出': 234.08
            ,
        },
        {
            '日期': '减-资产减值损失',
            '收入': 3876.04
            ,
            '支出': 2844.84
            ,
        },
        {
            '日期': '减-其他成本',
            '收入': 3425.09,
            '支出': 6079.08
            ,
        },
        {
            '日期': '加+公允价值变动收益',
            '收入':345.08
            ,
            '支出': 2358.7
            ,
        },
        {
            '日期': '加+投资收益科目',
            '收入': 2367.08
            ,
            '支出': 2367.09
            ,
        }
    ]
}
let chartData303 = {
    columns: ['日期', '收入', '支出'],
    rows: [{
            '日期': '营业总收入',
            '收入': 5462.01
            ,
            '支出': 2367.08

        },
        {
            '日期': '营业利润',
            '收入': 457.08
            ,
            '支出': 345.08

        },
        {
            '日期': '减-销售费用',
            '收入': 6580.1
            ,
            '支出': 3876.04

        },
        {
            '日期': '减-管理费用',
            '收入': 238.09
            ,
            '支出': 4537.07

        },
        {
            '日期': '减-财务费用',
            '收入': 876.02
            ,
            '支出': 7680.02
            ,
        },
        {
            '日期': '减-研发费用',
            '收入': 5737.76
            ,
            '支出': 5423.72
            ,
        },
        {
            '日期': '减-资产减值损失',
            '收入': 427.54
            ,
            '支出': 395.25
            ,
        },
        {
            '日期': '减-其他成本',
            '收入': 431.55
            ,
            '支出': 386.32
            ,
        },
        {
            '日期': '加+公允价值变动收益',
            '收入': 11599.70,

            '支出': 11080.85
            ,
        },
        {
            '日期': '加+投资收益科目',
            '收入': 16218.25
            ,
            '支出': 15644.52
            ,
        }
    ]
}
let chartData304 = {
    columns: ['日期', '收入', '支出'],
    rows: [{
            '日期': '营业总收入',
            '收入': 2789.01
            ,
            '支出':5462.01

        },
        {
            '日期': '营业利润',
            '收入': 276.05
            ,
            '支出': 457.08

        },
        {
            '日期': '减-销售费用',
            '收入': 3425.09
            ,
            '支出':6580.1

        },
        {
            '日期': '减-管理费用',
            '收入':231.09
            ,
            '支出': 238.09

        },
        {
            '日期': '减-财务费用',
            '收入':678.09
            ,
            '支出':876.02
            ,
        },
        {
            '日期': '减-研发费用',
            '收入': 5622.12
            ,
            '支出':5737.76
            ,
        },
        {
            '日期': '减-资产减值损失',
            '收入':501.37
            ,
            '支出':427.54
            ,
        },
        {
            '日期': '减-其他成本',
            '收入': 473.94
            ,
            '支出': 431.55
            ,
        },
        {
            '日期': '加+公允价值变动收益',
            '收入': 11708.17
            ,
            '支出': 11599.70
            ,
        },
        {
            '日期': '加+投资收益科目',
            '收入': 16270.20
            ,
            '支出':16208.25
            ,
        }
    ]
}
let chartData4 = {
    columns: ['type', 'value'],
    rows: [{
        type: '分数',
        value: 67.9
    }]
}
let chartData5 = {
    columns: ['type', 'value'],
    rows: [{
        type: '分数',
        value: -0.14
    }]
}
let chartData6 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData7 = {
    columns: ['日期', '主营业务收入', '主营业务收入基数'],
    rows: [{
            '日期': '2015年',
            '主营业务收入': 133454.92,
            '主营业务收入基数': 300.00
            ,
            '下单率': 0.32
        },
        {
            '日期': '2016年',
            '主营业务收入': 15330.42 
            ,
            '主营业务收入基数': 234.74
            ,
            '下单率': 0.26
        },
        {
            '日期': '2017年',
            '主营业务收入': 126494.52 
            ,
            '主营业务收入基数': 117.26
            ,
            '下单率': 0.76
        },
        {
            '日期': '2018年',
            '主营业务收入': 102108.25 
            ,
            '主营业务收入基数': 91.47
            ,
            '下单率': 0.49
        },
        {
            '日期': '2019年',
            '主营业务收入': 82670.20 
            ,
            '主营业务收入基数': 121.89
            ,
            '下单率': 0.323
        },
    ]
}
let chartData8 = {
    columns: ['日期', '本期', '同期'],
    rows: [{
            '日期': '2015年',
            '本期': 6.63,
            '同期': 8.54
        },
        {
            '日期': '2016年',
            '本期': 6.96,
            '同期': 6.63
        },
        {
            '日期': '2017年',
            '本期': 8.08,
            '同期': 6.97
        },
        {
            '日期': '2018年',
            '本期': 9.15,
            '同期': 7.08
        },
        {
            '日期': '2019年',
            '本期': 7.19,
            '同期': 6.15
        },
    ]
}
let chartData9 = {  columns: ['日期', '经营活动现金流量净额', '净利润','净利润含金量','净利润含金量指数','净利润含金量标准值'],
rows: [{
        '日期': '2015年',
        '经营活动现金流量净额': 105.66,
        '净利润': 4.82,
        '净利润含金量': 1,
        '净利润含金量指数': 2.82,
        '净利润含金量标准值':1
    },
    {
        '日期': '2016年',
        '经营活动现金流量净额': 95.62,
        '净利润': 105.66,
        '净利润含金量': 3,
        '净利润含金量指数': 1.82,
        '净利润含金量标准值':1
    },
    {
        '日期': '2017年',
        '经营活动现金流量净额': 57.44,
        '净利润': 95.62,
        '净利润含金量': 2.82,
        '净利润含金量指数': 3.82,
        '净利润含金量标准值':1
    },
    {
        '日期': '2018年',
        '本经营活动现金流量净额': 141.95,
        '净利润': 95.62,
        '净利润含金量': 1.82,
        '净利润含金量指数': 2.2,
        '净利润含金量标准值':1
    },
    {
        '日期': '2019年',
        '经营活动现金流量净额': 67.86,
        '净利润': 141.95,
        '净利润含金量': 4.13,
        '净利润含金量指数': 4.82,
        '净利润含金量标准值':1
    },
]}
let chartData10 = {
    columns: ['日期', '盈利现金比率','销售收现比率','营业收入含金量指数','营业收入含金量标准值'],
    rows: [{
            '日期': '2015年',
            '盈利现金比率': 5.66,
            '销售收现比率': 4.82,
            '营业收入含金量指数': 1.82,
            '营业收入含金量标准值': 1.17,
        
        },
        {
            '日期': '2016年',
            '盈利现金比率': 5.62,
            '销售收现比率': 5.66,
            '营业收入含金量指数': 2.82,
            '营业收入含金量标准值': 1.17,
        },
        {
            '日期': '2017年',
            '盈利现金比率': 7.44,
            '销售收现比率': 5.62,
            '营业收入含金量指数': 0.82,
            '营业收入含金量标准值': 1.17,
        },
        {
            '日期': '2018年',
            '盈利现金比率': 1.95,
            '销售收现比率': 5.62,
            '营业收入含金量指数': 2.82,
            '营业收入含金量标准值': 1.17,
        },
        {
            '日期': '2019年',
            '盈利现金比率': 7.86,
            '销售收现比率': 1.95,
            '营业收入含金量指数': 1.82,
            '营业收入含金量标准值': 1.17,
        },
    ]
}
let chartData11 = {
    columns: ['日期', '本期', '同期'],
    rows: [{
            '日期': '2015年',
            '本期': 14154.95,
            '同期': 15353.07 
            ,
            '下单率': 0.32
        },
        {
            '日期': '2016年',
            '本期':17521.82 
            ,
            '同期': 14154.95 
            ,
            '下单率': 0.26
        },
        {
            '日期': '2017年',
            '本期': 17316.73 
            ,
            '同期': 17521.82 
            ,
            '下单率': 0.76
        },
        {
            '日期': '2018年',
            '本期': 18227.85 
            ,
            '同期':17316.73 
            ,
            '下单率': 0.49
        },
        {
            '日期': '2019年',
            '本期': 18339.40 
            ,
            '同期': 18227.85 
            ,
            '下单率': 0.323
        }
    ]
}
let chartData12 = {
    columns: ['日期', '本期', '同期'],
    rows: [{
            '日期': '2015年',
            '本期': 14130.92 
            ,
            '同期': 15331.89 
            ,
            '下单率': 0.32
        },
        {
            '日期': '2016年',
            '本期': 17493.68 
            ,
            '同期': 14130.92 
            ,
            '下单率': 0.26
        },
        {
            '日期': '2017年',
            '本期': 17286.14 
            ,
            '同期': 13293.68 
            ,
            '下单率': 0.76
        },
        {
            '日期': '2018年',
            '本期':18196.55 
            ,
            '同期':17286.14 
            ,
            '下单率': 0.49
        },
        {
            '日期': '2019年',
            '本期': 18305.61 
            ,
            '同期': 18196.55 
            ,
            '下单率': 0.323
        }
    ]
}
let chartData13 = {
    columns: ['type', 'value'],
    rows: [{
        type: '分数',
        value: 786
    }]
}
let chartData14 = {
    columns: ['日期', '本期', '同期'],
    rows: [{
            '日期': '2015年',
            '本期': 1.71,
            '同期': 2.56
        },
        {
            '日期': '2016年',
            '本期': 14.32,
            '同期': 1.71
        },
        {
            '日期': '2017年',
            '本期': 2.07,
            '同期': 14.32
        },
        {
            '日期': '2018年',
            '本期': 3.50,
            '同期': 2.07
        },
        {
            '日期': '2019年',
            '本期': 0.30,
            '同期': 3.50
        },
    ]
}
let chartData15 = {
    columns: ['日期', '本期', '同期'],
    rows: [{
            '日期': '2015年',
            '本期': 105.66,
            '同期': 4.82
        },
        {
            '日期': '2016年',
            '本期': 95.62,
            '同期': 105.66
        },
        {
            '日期': '2017年',
            '本期': 57.44,
            '同期': 95.62
        },
        {
            '日期': '2018年',
            '本期': 141.95,
            '同期': 95.62
        },
        {
            '日期': '2019年',
            '本期': 67.86,
            '同期': 141.98
        },
    ]
}
let chartData16 = {
    columns: ['日期', '本期', '同期', ],
    rows: [{
            '日期': '1月',
            '本期': 77.1,
            '同期': 66.1
        },
        {
            '日期': '2月',
            '本期': 73,
            '同期': 63.1
        },
        {
            '日期': '3月',
            '本期': 56.1,
            '同期': 55.1
        },
        {
            '日期': '4月',
            '本期': 65.1,
            '同期': 78.1
        },
        {
            '日期': '5月',
            '本期': 33.1,
            '同期': 12.1
        },
        {
            '日期': '6月',
            '本期': 67.1,
            '同期': 45.1
        },
        {
            '日期': '7月',
            '本期': 12.1,
            '同期': 67.1
        },
        {
            '日期': '8月',
            '本期': 98.1,
            '同期': 88.1
        },
        {
            '日期': '9月',
            '本期': 37.1,
            '同期': 98.1
        },
        {
            '日期': '10月',
            '本期': 88.1,
            '同期': 63.1
        },
        {
            '日期': '11月',
            '本期': 91.1,
            '同期': 12.1
        },
        {
            '日期': '12月',
            '本期': 45.1,
            '同期': 64.1
        },
    ]
}

let chartData17 = {
    columns: ['日期', '访问用户', '下单用户', ],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData18 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData19 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData20 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData21 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData22 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
export {
    profitChartData,
    profitChartSettings,
    profitChartTotalData,
    mainChartData,
    mainChartSettings,
    mainChartData1,
    mainChartSettings1,
    mainChartTotalData,
    businessChartData,
    businessChartSettings,
    businessChartTotalData,
    chartSettings7,
    chartSettings8,
    chartSettings9,
    chartData1,
    chartData101,
    chartData102,
    chartData103,
    chartData104,
    chartData2,
    chartData3,
    chartData301,
    chartData302,
    chartData303,
    chartData304,
    chartData4,
    chartData5,
    chartData6,
    chartData7,
    chartData8,
    chartData9,
    chartData10,
    chartData11,
    chartData12,
    chartData13,
    chartData14,
    chartData15,
    chartData16,
    chartData17,
    chartData18,
    chartData19,
    chartData20,
    chartData21,
    chartData22,
}