let chartData1 = {
    columns: ['日期', '本期','同期'],
    rows: [
        { '日期': '期初余额', '本期': 86322.8,'同期':27890.03, },
        { '日期': '经营活动(流入)', '本期': 189736.1,'同期':165736.1,},
        { '日期': '投资活动(流出)', '本期': 18848.06 ,'同期':16448.06,},
        { '日期': '筹集活动(流入)', '本期': 110100,'同期':108100, },
        { '日期': '汇率变动(影响)', '本期': 86322.8,'同期':27890.03, },
        { '日期': '期末余额', '本期': 86322.8,'同期':27890.03, },
   
    ]
}
let chartData2 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': 1393, '同期': 1093 },
        { '日期': '2月', '本期': 3530, '同期': 3230},
        { '日期': '3月', '本期': 2923, '同期': 2623 },
        { '日期': '4月', '本期': 1723, '同期': 1423 },
        { '日期': '5月', '本期': 3792, '同期': 3492 },
        { '日期': '6月', '本期': 4593, '同期': 4293 },
        { '日期': '7月', '本期': 4593, '同期': 4293 },
        { '日期': '8月', '本期': 4593, '同期': 4293 },
        { '日期': '9月', '本期': 4593, '同期': 4293 },
        { '日期': '10月', '本期': 4593, '同期': 4293 },
        { '日期': '11月', '本期': 4593, '同期': 4293 },
        { '日期': '12月', '本期': 4593, '同期': 4293 },

    ]
}
let chartData3 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': 67.03, '同期': 42.11, '下单率': 0.32 },
        { '日期': '2月', '本期': 29.08, '同期': 60.01, '下单率': 0.26 },
        { '日期': '3月', '本期': 45.03, '同期': 80.01, '下单率': 0.76 },
        { '日期': '4月', '本期': 62.03, '同期': 126.23, '下单率': 0.49 },
        { '日期': '5月', '本期': 15.01, '同期': 35.01, '下单率': 0.323 },
        { '日期': '6月', '本期': 16.02, '同期': 42.93, '下单率': 0.78 }
    ]
}
let chartData4 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': 46.82, '同期': 7.23, '下单率': 0.32 },
        { '日期': '2月', '本期': 105.66, '同期':6.66, '下单率': 0.26 },
        { '日期': '3月', '本期': 95.62, '同期': 4.06, '下单率': 0.76 },
        { '日期': '4月', '本期': 57.44, '同期': 10.15, '下单率': 0.49 },
        { '日期': '5月', '本期': 141.95, '同期': 4.88, '下单率': 0.323 },
        { '日期': '6月', '本期': 75.93, '同期': 42.93, '下单率': 0.78 }
    ]
}
let chartData5 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': 84.99, '同期': 5.04, '下单率': 0.32 },
        { '日期': '2月', '本期': 92.79, '同期': 84.99, '下单率': 0.26 },
        { '日期': '3月', '本期': 57.86, '同期': 92.79, '下单率': 0.76 },
        { '日期': '4月', '本期': 149.69, '同期': 57.86, '下单率': 0.49 },
        { '日期': '5月', '本期': 26.48, '同期': 129.39, '下单率': 0.323 },
        { '日期': '6月', '本期': 85.93, '同期': 42.93, '下单率': 0.78 }
    ]
}
let chartData6 = {
    columns: ['日期', '访问用户'],
    rows: [
        { '日期': '1/1', '访问用户': -100, '下单用户': 1093, '下单率': 0.32 },
        
    ]
}
let chartData7 = {
    columns: ['日期', '访问用户'],
    rows: [
        { '日期': '1/1', '访问用户': 3 },
       
    ]
}
let chartData8 = {
    columns: ['日期', '访问用户'],
    rows: [
        { '日期': '1/1', '访问用户': 63 },
     
    ]
}
let chartData9 = {}
let chartData10 = {
    columns: ['日期', '访问用户'],
    rows: [
        { '日期': '1/1', '访问用户': -42.15 },
      
    ]
}
let chartData11 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [
        { '日期': '1/1', '访问用户': 41.88, '下单用户': 1093, '下单率': 0.32 },
      
    ]
}
let chartData12 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [
        { '日期': '1/1', '访问用户': 6.38, '下单用户': 1093, '下单率': 0.32 },
       
    ]
}
let chartData13 = {
    columns: ['日期', '访问用户', '下单用户', '下单率'],
    rows: [
        { '日期': '1/1', '访问用户': 15.10, '下单用户': 1093, '下单率': 0.32 },
   
    ]
}
let chartData14 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '销售收现率', '本期': 168.63, '同期': 116.19, '下单率': 0.32 },
        { '日期': '盈利现金保障倍数', '本期': 67.86, '同期': 141.95, '下单率': 0.26 },
        { '日期': '现金周转次数', '本期':311.97, '同期':267.78, '下单率': 0.76 },
        { '日期': '流动资产现金周转次数', '本期': 18.38, '同期': 4.21, '下单率': 0.49 },
        { '日期': '销售净现率', '本期': 67.86, '同期':141.95, '下单率': 0.323 },
        { '日期': '资产现金报酬率', '本期': 0.06, '同期':13.71, '下单率': 0.78 },
        { '日期': '资本现金收益率', '本期': 45.28, '同期': 12.71, '下单率': 0.78 }
    ]
}
let chartData15 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': 56.3, '同期': 14.82 },
        { '日期': '2月', '本期':48.7, '同期': 32.30},
        { '日期': '3月', '本期': 95.6, '同期': 26.23 },
        { '日期': '4月', '本期': 17.23, '同期': 14.23 },
        { '日期': '5月', '本期': 37.92, '同期': 34.92 },
        { '日期': '6月', '本期':85.93, '同期': 42.93 },
        { '日期': '7月', '本期': 45.78, '同期': 67.25 },
        { '日期': '8月', '本期': 41.97, '同期': 142.3 },
        { '日期': '9月', '本期': 45.93, '同期': 63.6 },
        { '日期': '10月', '本期': 67.86, '同期': 86.2 },
        { '日期': '11月', '本期': 56.35, '同期': 54.6},
        { '日期': '12月', '本期': 65.93, '同期': 96.35 },

    ]
}
let chartData16 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': 1.34, '同期': 2.03 },
        { '日期': '2月', '本期': 3.53, '同期': 4.30 },
        { '日期': '3月', '本期': 2.92, '同期': 5.63 },
        { '日期': '4月', '本期': 1.72, '同期': 7.43 },
        { '日期': '5月', '本期': 3.79, '同期': 1.42 },
        { '日期': '6月', '本期': 5.59, '同期': 3.93 },
        { '日期': '7月', '本期': 3.93, '同期': 4.93 },
        { '日期': '8月', '本期': 4.93, '同期': 3.23 },
        { '日期': '9月', '本期': 6.53, '同期': 4.23 },
        { '日期': '10月', '本期': 2.93, '同期': 7.93},
        { '日期': '11月', '本期': 1.59, '同期': 1.23},
        { '日期': '12月', '本期': 3.46, '同期': 5.46},
    ]
}

let chartData17 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '1月', '本期': -25960.34, '同期': -10923 },
        { '日期': '2月', '本期': -2596.43, '同期': -32330},
        { '日期': '3月', '本期': -8404.47, '同期': -2596.43 },
        { '日期': '4月', '本期': -3623.96, '同期': -1423 },
        { '日期': '5月', '本期': -18848.06, '同期': -3492 },
        { '日期': '6月', '本期': -45493, '同期': -25260.34 },
        { '日期': '7月', '本期': -45393, '同期': -2596.43 },
        { '日期': '8月', '本期': -25960.34, '同期': -4293 },
        { '日期': '9月', '本期': -45093, '同期': -18848.06 },
        { '日期': '10月', '本期': -45913, '同期': -4293 },
        { '日期': '11月', '本期': -18848.06, '同期': -4293 },
        { '日期': '12月', '本期': -34456, '同期': -18848.06},
    ]
}
let chartData18 = {
    columns: ['日期', '经营活动净流量', '投资活动净流量','筹资活动净流量','本期','同期'],
    rows: [
        { '日期': '1月', '经营活动净流量': 5960, '投资活动净流量': 1093,'筹资活动净流量': 5960, '本期':2393,'同期':3230},
        { '日期': '2月', '经营活动净流量': 5676, '投资活动净流量': 3230,'筹资活动净流量': 3960,'本期':1293,'同期':3230},
        { '日期': '3月', '经营活动净流量': 2923, '投资活动净流量': 2623,'筹资活动净流量': 2960,'本期':1093,'同期':1230 },
        { '日期': '4月', '经营活动净流量': 1723, '投资活动净流量': 1423,'筹资活动净流量': 5960,'本期':1233,'同期':3230 },
        { '日期': '5月', '经营活动净流量': 3792, '投资活动净流量': 3492,'筹资活动净流量': 5960,'本期':2093,'同期':2230},
        { '日期': '6月', '经营活动净流量': 4593, '投资活动净流量': 4293,'筹资活动净流量': 5670,'本期':2093,'同期':3230 },
        { '日期': '7月', '经营活动净流量': 4593, '投资活动净流量': 4293,'筹资活动净流量': 1960,'本期':3093,'同期':1230 },
        { '日期': '8月', '经营活动净流量': 4593, '投资活动净流量': 4293,'筹资活动净流量': 2960,'本期':3493,'同期':1130},
        { '日期': '9月', '经营活动净流量': 4593, '投资活动净流量': 4293,'筹资活动净流量': 5960,'本期':2393,'同期':1230 },
        { '日期': '10月', '经营活动净流量': 4593, '投资活动净流量': 4293,'筹资活动净流量': 3960,'本期':1293,'同期':2230 },
        { '日期': '11月', '经营活动净流量': 4593, '投资活动净流量': 4293 ,'筹资活动净流量': 6960,'本期':2093,'同期':3130},
        { '日期': '12月', '经营活动净流量': 3456, '投资活动净流量': 5466,'筹资活动净流量': 5960,'本期':1093,'同期':3230},
    ]
}
let chartData19 = {
    columns: ['日期', '销售现金比率','盈利现金比率','现金获利指数'],
    rows: [
        { '日期': '1月', '销售现金比率': 239, '总资产净现率': 1093 ,'盈利现金比率':4456,'现金获利指数':345},
        { '日期': '2月', '销售现金比率': 330, '总资产净现率': 3230,'盈利现金比率':5644,'现金获利指数':453},
        { '日期': '3月', '销售现金比率': 1793, '总资产净现率': 1623 ,'盈利现金比率':2544,'现金获利指数':456},
        { '日期': '4月', '销售现金比率': 723, '总资产净现率': 523 ,'盈利现金比率':243,'现金获利指数':456},
        { '日期': '5月', '销售现金比率': 392, '总资产净现率': 3492 ,'盈利现金比率':443,'现金获利指数':175},
        { '日期': '6月', '销售现金比率': 993, '总资产净现率': 4293 ,'盈利现金比率':546,'现金获利指数':567},
 
    ]
}
let chartData20 = {
    columns: ['日期', '现金流动负债比', '现金比率','现金债务总额比','现金到期债务比'],
    rows: [
        { '日期': '1月', '现金流动负债比': 1393, '现金比率': 103,'现金债务总额比':2342,'现金到期债务比':2133 },
        { '日期': '2月', '现金流动负债比': 3530, '现金比率': 330,'现金债务总额比':435,'现金到期债务比':123},
        { '日期': '3月', '现金流动负债比': 2923, '现金比率': 2623,'现金债务总额比':234,'现金到期债务比':34},
        { '日期': '4月', '现金流动负债比': 112, '现金比率': 123,'现金债务总额比':34,'现金到期债务比':345},
        { '日期': '5月', '现金流动负债比': 32, '现金比率': 342,'现金债务总额比':76,'现金到期债务比':67},
        { '日期': '6月', '现金流动负债比': 93, '现金比率': 4293,'现金债务总额比':67,'现金到期债务比':345},
        { '日期': '7月', '现金流动负债比': 493, '现金比率': 493,'现金债务总额比':12,'现金到期债务比':34},
        { '日期': '8月', '现金流动负债比': 4593, '现金比率': 493,'现金债务总额比':123,'现金到期债务比':234},
        { '日期': '9月', '现金流动负债比': 43, '现金比率': 423,'现金债务总额比':234,'现金到期债务比':654 },
        { '日期': '10月', '现金流动负债比': 123, '现金比率': 493,'现金债务总额比':12,'现金到期债务比':345},
        { '日期': '11月', '现金流动负债比': 463, '现金比率': 423,'现金债务总额比':57,'现金到期债务比':78},
        { '日期': '12月', '现金流动负债比': 356, '现金比率': 566,'现金债务总额比':87,'现金到期债务比':96},
    ]
}
let chartData21 = {
    columns: ['日期','营运资金需求', '运营投资需求','经营还债期', '未来业绩增长可期'],
    rows: [
        { '日期': '1月', '未来业绩增长可期': 139,'营运资金需求': 139, '运营投资需求': 193,'经营还债期': 193 },
        { '日期': '2月', '未来业绩增长可期': 353,'营运资金需求': 139, '运营投资需求': 420,'经营还债期': 293},
        { '日期': '3月', '未来业绩增长可期': 292,'营运资金需求': 139, '运营投资需求': 163,'经营还债期': 193 },
        { '日期': '4月', '未来业绩增长可期': 172,'营运资金需求': 139, '运营投资需求': 113,'经营还债期': 183 },
        { '日期': '5月', '未来业绩增长可期': 279,'营运资金需求': 139, '运营投资需求': 392,'经营还债期': 293 },
        { '日期': '6月', '未来业绩增长可期': 459,'营运资金需求': 139, '运营投资需求': 393,'经营还债期': 193 },
    
    ]
}
let chartData211 = {
    columns: ['日期', '现金循环周期', '运营循环周期'],
    rows: [
        { '日期': '1月', '现金循环周期': 39, '运营循环周期': 19 },
        { '日期': '2月', '现金循环周期': 33, '运营循环周期': 42},
        { '日期': '3月', '现金循环周期': 22, '运营循环周期': 16 },
        { '日期': '4月', '现金循环周期': 12, '运营循环周期': 13 },
        { '日期': '5月', '现金循环周期': 29, '运营循环周期': 39 },
        { '日期': '6月', '现金循环周期': 49, '运营循环周期': 33 },
    
    ]
}


let tableData = [
    { 'no': '客户A',   "level": 4, 'field1': -9603398000.00, 'field2': -3268373900, 'field3': -3268373900,'field4':'发展阶段','field5':'低风险','field6':'AAA','field7':'1'},
]

export {
    chartData1,
    chartData2,
    chartData3,
    chartData4,
    chartData5,
    chartData6,
    chartData7,
    chartData8,
    chartData9,
    chartData10,
    chartData11,
    chartData12,
    chartData13,
    chartData14,
    chartData15,
    chartData16,
    chartData17,
    chartData18,
    chartData19,
    chartData20,
    chartData21,
    chartData211,
    tableData
}