let chartData1 = {
    columns: ['时间', '数量',],
    rows: [
        { '时间': '本年', '数量': 390 },
        { '时间': '上年', '数量': 180 },
        { '时间': '增长', '数量': 210 }
    ]
}
let chartData2 = {
    columns: ['时间', '数量'],
    rows: [
        { '时间': '本年', '数量': 400 },
        { '时间': '上年', '数量': 170 },
        { '时间': '增长', '数量': 210 }
    ]
}
let chartData3 = {
    columns: ['时间', '数量'],
    rows: [
        { '时间': '本年', '数量': 500 },
        { '时间': '上年', '数量': 300 },
        { '时间': '增长', '数量': 210 }
    ]
}
let chartData4 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '资产重组调节利润', '本期': 180, '同期': 390, '下单率': 0.78 },
        { '日期': '股权投资调节利润', '本期': 360, '同期': 500, '下单率': 0.78 },
        { '日期': '应收账款造假', '本期': 190, '同期': 420, '下单率': 0.78 },
        { '日期': '存货造假', '本期': 250, '同期': 440, '下单率': 0.78 },
        { '日期': '营业收入造假', '本期': 780, '同期': 190, '下单率': 0.78 },
        { '日期': '关联交易', '本期': 451, '同期': 250, '下单率': 0.323 },
        { '日期': '费用资本化', '本期': 390, '同期': 780, '下单率': 0.49 },
        { '日期': '经营活动现金流', '本期': 500, '同期': 451, '下单率': 0.76 },
        { '日期': '高估资产', '本期': 420, '同期':  180, '下单率': 0.26 },
        { '日期': '低估负债', '本期': 440, '同期': 360, '下单率': 0.32 },
    ]
}
export {
    chartData1,
    chartData2,
    chartData3,
    chartData4,
}