let chart1Data = {
    columns: ['日期', '本期', '同期', '下单率'],
    rows: [
        { '日期': '2016年3月', '本期': 17.16, '同期': 20.73, '下单率': 0.32 },
        { '日期': '2016年6月', '本期': 3530, '同期': 3230, '下单率': 0.26 },
        { '日期': '2016年9月', '本期': 2923, '同期': 2623, '下单率': 0.76 },
        { '日期': '2016年12月', '本期': 1723, '同期': 1423, '下单率': 0.49 },
        { '日期': '2017年3月', '本期': 1393, '同期': 1093, '下单率': 0.32 },
        { '日期': '2017年6月', '本期': 3530, '同期': 3230, '下单率': 0.26 },
        { '日期': '2017年9月', '本期': 2923, '同期': 2623, '下单率': 0.76 },
        { '日期': '2017年12月', '本期': 1723, '同期': 1423, '下单率': 0.49 },
        { '日期': '2018年3月', '本期': 1393, '同期': 1093, '下单率': 0.32 },
        { '日期': '2018年6月', '本期': 3530, '同期': 3230, '下单率': 0.26 },
        { '日期': '2018年9月', '本期': 2923, '同期': 2623, '下单率': 0.76 },
        { '日期': '2018年12月', '本期': 1723, '同期': 1423, '下单率': 0.49 },
    ]
}
let chart2Data = {}
let chart3Data = {}

let tableData = [
    { "no": 1, "field1": "  经营现金流量与销售收入比（%）", "field2": " 净资产收益率近三年小幅持续下降，2018年较上年减少0.67各百分点，近三年平均每年减少0.44个百分点。   ", "field3": "净资产收益率下降，表明公司盈利能力和运营资本的能力下降，可能收入下降或者成本费用上升。  " },
    { "no": 2, "field1": "  总资产收益（%）   				", "field2": "总资产收益率近三年 小幅持续 下降，2018年较上年减少0.19个百分点,近三年平均每年减少 0.15个百分点。", "field3": "   总资产收益率下降，表明公司投入产出比下降，盈利能力变差，可能收入下降，成本费用上升，新增资产能力很差。   " },
    { "no": 3, "field1": "  净资产收益率（%）   			", "field2": "净资产收益率近三年小幅持续下降，2018年较上年减少0.67各百分点，近三年平均每年减少0.44个百分点。  ", "field3": " 净资产收益率下降，表明公司盈利能力和运营资本的能力下降，可能收入下降或者成本费用上升。" }
]

export {
    chart1Data,
    chart2Data,
    chart3Data,
    tableData
}