let chartData1 = {
    columns: ['type', 'value', 'a', 'b'],
    rows: [{
        type: '速度',
        value: 1.3,
    }]
}
let chartData3 = {
    columns: ['type', 'value', 'a', 'b'],
    rows: [{
        type: '速度',
        value: 2.3,
    }]
}
let chartData4 = {
    columns: ['type', 'value', 'a', 'b'],
    rows: [{
        type: '速度',
        value: -3.1,
    }]
}
let chartData5 = {
    columns: ['type', 'value', 'a', 'b'],
    rows: [{
        type: '速度',
        value: 3.7,
    }]
}
let chartData2 = {
    columns: ['type', 'value'],
    rows: [{
        type: '分数',
        value: 75
    }]
}
let tableData = [{
        "no": 1,
        "level": 4,
        "field1": "经营业绩",
        "field2": "利润最大化",
        "field3": "税项分析法",
        "field4": "股权融资",
        "field5": "检验正常",
        "field6": "1",
        "field7": "1",
        "field8": "1",
    },
    {
        "no": 2,
        "level": 4,
        "field1": "财务状况",
        "field2": "低估负债",
        "field3": "毛利分析法",
        "field4": "债权融资",
        "field5": "1",
        "field6": "1",
        "field7": "1",
        "field8": "1"
    },
    {
        "no": 3,
        "level": 4,
        "field1": "现金流情况",
        "field2": "高估资产",
        "field3": "子公司分析法",
        "field4": "避免ST风险",
        "field5": "2",
        "field6": "1",
        "field7": "1",
        "field8": "1"
    }
]
let tableData1 = [{
        "field1": "存货",
        "field2": "6分",
        "field3": "税项分析法"
    },
    {
        "field1": "应收账款",
        "field2": "6分",
        "field3": "毛利分析法"
    },
    {
        "field1": "营业利润",
        "field2": "7分",
        "field3": "子公司分析法"
    },
    {
        "field1": "利润质量",
        "field2": "8分",
        "field3": "税项分析法"
    },
    {
        "field1": "营业成本",
        "field2": "1分",
        "field3": "毛利分析法"
    },
    {
        "field1": "资产质量",
        "field2": "5分",
        "field3": "子公司分析法"
    },

]

let goujiData = [{
    "no": 1,
    "field1": "A0001",
    "field2": "汉邦高科",
    "field3": "建筑业",
    "field4": "表内勾稽",
    "field5": "非流动资产合计(5,266,144,846.25) = 可供出售金融资产 (20,000,000.00) + 持有至到期投资 (0) + 长期应收账款 (0) + 长期股权投资 (0) + 投资性房地产 (0) + 固定资产净额 (343,015,085.10) + 在建工程 (0) + 工程物资 (0) + 固定资产清理 (0) + 生产性生物资产 (0) + 油气资产 (0) + 无形资产 (3,338,541,906.06) + 开发支出 (388,056,048.72) + 商誉 (747,585,265.47) + 长期待摊费用 (0) + 递延所得税资产 (19,6218,582.19) + 其他非流动资产 (230,797,275.71)"
}]
let chartData9 = {
    columns: ['日期', '应收账款', '存货', '营业收入', '营业利润'],
    rows: [{
            '日期': '2015',
            '应收账款': 1393,
            '存货': 1093,
            '营业收入': 1093,
            '营业利润': 2365
        },
        {
            '日期': '2016',
            '应收账款': 1245,
            '存货': 1593,
            '营业收入': 2331,
            '营业利润': 2343
        },
        {
            '日期': '2017',
            '应收账款': 3530,
            '存货': 3230,
            '营业收入': 3230,
            '营业利润': 1235
        },
        {
            '日期': '2018',
            '应收账款': 2923,
            '存货': 2623,
            '营业收入': 2623,
            '营业利润': 2663
        },
        {
            '日期': '2019',
            '应收账款': 1723,
            '存货': 1423,
            '营业收入': 1423,
            '营业利润': 1233
        },
    ]
}
let kemuData = [{
        "no": "应收账款",
        "field1": "1393",
        "field2": "1245",
        "field3": "3530",
        "field4": "2923",
        "field5": "2923"
    },
    {
        "no": "存货",
        "field1": "1093",
        "field2": "1593",
        "field3": "3230",
        "field4": "2623",
        "field5": "2923"
    },
    {
        "no": "营业收入",
        "field1": "1093",
        "field2": "2331",
        "field3": "3230",
        "field4": "2623",
        "field5": "2923"
    },
    {
        "no": "营业利润",
        "field1": "2365",
        "field2": "2343",
        "field3": "1235",
        "field4": "2663 ",
        "field5": "2923"
    },
]
let kemuData1 = [{
        "no": "应收账款",
        "field1": "应收账款余额减少",
        "field2": "应收账款大幅度增长没有得到经营业绩的支持，应收账款质量值得关注。应收账款2017年增长25.21%而营业利润2017年下降697.38%，并引起成本大幅度上升和毛利率大幅下降，应收账款增长不合理。",
        "field3": "建筑业",
        "field4": "表内勾稽"
    },
    {
        "no": "存货",
        "field1": "	存货变动与收入不同步",
        "field2": "存货大幅增长且与收入的变化不同步，存货占主营业务收入比重下降34.27%，存货增长严重不合理。",
        "field3": "建筑业",
        "field4": "表内勾稽"
    },
    {
        "no": "营业收入",
        "field1": "新增应收账款占当期营业收入比重过大",
        "field2": "从报表数据看，有88,771.34万元的营业收入来自于新增应收账款，约占当期营业收入的28.75%，应予以关注。",
        "field3": "建筑业",
        "field4": "表内勾稽"
    },
    {
        "no": "营业利润",
        "field1": "	应收账款占当期营业利润比重过大",
        "field2": "从报表数据来看，客户2017年的销售收入中，有88,771.34万元来自于应收账款的增加，占销售收入的28.75%。表明在客户当期的销售收入中，有较大一部分来自于应收账款，收入质量需要关注。从现金角度来看，客户当期的经营业务是亏损的，营业利润的数据是不真实的。",
        "field3": "建筑业",
        "field4": "表内勾稽"
    },
]
let kemuData2 = [{
        "no": "一、经营活动产生的现金流量",
        "field1": "",
        "field2": "",
        "field3": ""
    },
    {
        "no": "销售商品、提供劳务收到的现金",
        "field1": "3,255,661,705.72",
        "field2": "4,336,541,392.02",
    },
    {
        "no": "收到的税费返还",
        "field1": "13,846,186.71	",
        "field2": "13,846,186.71",
    },
    {
        "no": "收到的其他与经营活动有关的现金",
        "field1": "30,226,715.59",
        "field2": "30,226,715.59",
        "field3": ""
    },
    {
        "no": "经营活动现金流入小计",
        "field1": "	3,299,734,608.02",
        "field2": "4,380,614,294.32",
        "field3": ""
    },
    {
        "no": "购买商品、接受劳务支付的现金",
        "field1": "2,564,829,824.55",
        "field2": "3,347,102,921.04",
        "field3": ""
    },
    {
        "no": "支付给职工以及为职工支付的现金",
        "field1": "388,641,180.35		",
        "field2": "394,320,730.35",
        "field3": ""
    },
    {
        "no": "支付的各项税费",
        "field1": "27,696,141.80		",
        "field2": "27,673,141.80",
        "field3": ""
    },
    {
        "no": "支付的其他与经营活动有关的现金",
        "field1": "182,089,582.37		",
        "field2": "27,673,141.80",
        "field3": ""
    },
    {
        "no": "经营活动现金流出小计",
        "field1": "3,163,256,729.07		",
        "field2": "27,673,141.80",
        "field3": ""
    },
    {
        "no": "经营活动产生的现金流量净额",
        "field1": "136,477,878.95",
        "field2": "477,667,358.76",
        "field3": ""
    },
    {
        "no": "二、投资活动产生的现金流量",
        "field1": "	",
        "field2": "",
        "field3": ""
    },
    {
        "no": "收回投资所收到的现金",
        "field1": "	0.00",
        "field2": "0.00",
        "field3": ""
    },
    {
        "no": "取得投资收益所收到的现金",
        "field1": "7,351,589.77	",
        "field2": "7,351,589.77",
        "field3": ""
    },
    {
        "no": "处置固定资产、无形资产和其他长期资产所收回的现金净额",
        "field1": "2,941,014.71	",
        "field2": "2,941,014.71",
        "field3": ""
    },
    {
        "no": "处置子公司及其他营业单位收到的现金净额",
        "field1": "	0.00	",
        "field2": "	0.00",
        "field3": ""
    },
    {
        "no": "收到的其他与投资活动有关的现金",
        "field1": "23,351,203.63	",
        "field2": "23,351,203.63",
        "field3": ""
    },
    {
        "no": "投资活动现金流入小计",
        "field1": "33,643,808.11	",
        "field2": "22,877,789.51",
        "field3": ""
    },
    {
        "no": "购建固定资产、无形资产和其他长期资产所支付的现金",
        "field1": "93,392,266.69	",
        "field2": "121,409,946.70",
        "field3": ""
    },
    {
        "no": "投资所支付的现金",
        "field1": "3,783,487.47	",
        "field2": "3,783,487.47",
        "field3": ""
    },
    {
        "no": "取得子公司及其他营业单位支付的现金净额",
        "field1": "0.00	",
        "field2": "0.00",
        "field3": ""
    },
    {
        "no": "支付的其他与投资活动有关的现金",
        "field1": "32,000,000.00	",
        "field2": "32,000,000.00",
        "field3": ""
    },
    {
        "no": "投资活动现金流出小计",
        "field1": "129,175,754.16	",
        "field2": "157,193,434.17",
        "field3": ""
    },
    {
        "no": "投资活动产生的现金流量净额",
        "field1": "-95,531,946.05		",
        "field2": "-134,315,644.65",
        "field3": ""
    },
    {
        "no": "三、筹资活动产生的现金流量",
        "field1": "	",
        "field2": "",
        "field3": ""
    },
    {
        "no": "吸收投资收到的现金",
        "field1": "	2,630,000.00	",
        "field2": "2,630,000.00",
        "field3": ""
    },
    {
        "no": "其中：子公司吸收少数股东投资收到的现金",
        "field1": "	2,630,000.00	",
        "field2": "2,630,000.00",
        "field3": ""
    },
    {
        "no": "取得借款收到的现金",
        "field1": "	2,672,869,126.34",
        "field2": "2,372,869,126.34",
        "field3": ""
    },
    {
        "no": "发行债券收到的现金",
        "field1": "0.00	",
        "field2": "0.00",
        "field3": ""
    },
    {
        "no": "收到其他与筹资活动有关的现金",
        "field1": "125,748,477.48	",
        "field2": "125,748,477.48",
        "field3": ""
    },
    {
        "no": "筹资活动现金流入小计",
        "field1": "2,801,297,603.82	",
        "field2": "2,501,247,603.82",
        "field3": ""
    },
    {
        "no": "筹资活动产生的现金流量净额",
        "field1": "2,651,205,154.35	",
        "field2": "2,451,205,154.35",
        "field3": ""
    },
    {
        "no": "四、汇率变动对现金及现金等价物的影响",
        "field1": "-9,137,639.60	",
        "field2": "-6,396,347.72",
        "field3": ""
    },
    {
        "no": "五、现金及现金等价物净增加额",
        "field1": "	-26,838,165.45	",
        "field2": "178,258,907.64",
        "field3": ""
    },
    {
        "no": "加:期初现金及现金等价物余额",
        "field1": "455,697,070.99	",
        "field2": "455,697,070.99",
        "field3": ""
    },
    {
        "no": "六、期末现金及现金等价物余额",
        "field1": "	428,858,905.54	",
        "field2": "633,955,978.63",
        "field3": ""
    },
]
let kemuData3 = [{
    "no": "货币资金增长率",
    "field1": "-10%",
    "field2": "-15.02%",
    "field3": "	货币资金账面余额下降，应关注资金供应情况。",
    "field4": "可能存在未入账的资金收款项目",
    "field5": "是"
    
},
{
    "no": "主营业务收入",
    "field1": "销售商品、提供劳务所收到的现金净额",
    "field2": "主营业务收入<销售商品、提供劳务所收到的现金净额",
    "field3": "可能存在少计收入的情况。",
    "field4": "",
    "field5": "是"
},
{
    "no": "销售费用占主营业务收入",
    "field1": "",
    "field2": "销售费用占主营业务收入",
    "field3": "销售费用占收入比例上升不太合理。",
    "field4": "公司费用控制不严，或者产品正在打开市场需要大量资金成本。",
    "field5": "是"
},
]
let mainChartData = {
    columns: ['日期', '本期', '上期', '增减率','平均值','最低值'],
    rows: [{
            '日期': '2015年',
            '本期': 133454.93,
            '上期': 119299.98,
            '增减率': 4.61,
            '平均值':2.31,
            '最低值':1.65
        },
        {
            '日期': '2016年',
            '本期': 153130.42,
            '上期': 135608.59,
            '增减率':5.44,
            '平均值':2.31,
            '最低值':1.65
        },
        {
            '日期': '2017年',
            '本期': 156494.52,
            '上期': 139177.78,
            '增减率': 9.07,
            '平均值':2.31,
            '最低值':1.65
        },
        {
            '日期': '2018年',
            '本期': 162108.25,
            '上期': 143880.40,
            '增减率': 10.24,
            '平均值':2.31,
            '最低值':1.65
        },
        {
            '日期': '2019年',
            '本期': 162670.20,
            '上期': 144330.80,
            '增减率': 12.27,
            '平均值':2.31,
            '最低值':1.65
        }
    ]
}
let mainChartData1 = {  columns: ['日期', '本期', '上期', '增减率','平均值','最低值'],
rows: [{
        '日期': '2015年',
        '本期': 113354.93,
        '上期': 89299.98,
        '增减率': 6.61,
        '平均值':1.31,
        '最低值':3.65
    },
    {
        '日期': '2016年',
        '本期': 103130.42,
        '上期': 115608.59,
        '增减率':2.44,
        '平均值':1.31,
        '最低值':3.65
    },
    {
        '日期': '2017年',
        '本期': 96494.52,
        '上期': 89177.78,
        '增减率': 9.07,
        '平均值':3.31,
        '最低值':3.65
    },
    {
        '日期': '2018年',
        '本期': 162108.25,
        '上期': 143880.40,
        '增减率': 10.24,
        '平均值':5.31,
        '最低值':1.65
    },
    {
        '日期': '2019年',
        '本期': 82670.20,
        '上期': 114330.80,
        '增减率': 12.27,
        '平均值':4.31,
        '最低值':5.65
    }
]}
let mainChartData2 = {  columns: ['日期', '本期', '上期', '增减率','平均值','最低值'],
rows: [{
        '日期': '2015年',
        '本期': 73454.93,
        '上期': 119299.98,
        '增减率': 4.61,
        '平均值':2.31,
        '最低值':1.65
    },
    {
        '日期': '2016年',
        '本期': 153130.42,
        '上期': 135608.59,
        '增减率':5.44,
        '平均值':2.31,
        '最低值':6.65
    },
    {
        '日期': '2017年',
        '本期': 66494.52,
        '上期': 29177.78,
        '增减率': 9.07,
        '平均值':2.31,
        '最低值':3.65
    },
    {
        '日期': '2018年',
        '本期': 32108.25,
        '上期': 63880.40,
        '增减率': 10.24,
        '平均值':5.31,
        '最低值':2.65
    },
    {
        '日期': '2019年',
        '本期': 62670.20,
        '上期': 54330.80,
        '增减率': 10.27,
        '平均值':3.31,
        '最低值':4.65
    }
]}
let mainChartData3 = {  columns: ['日期', '本期', '上期', '增减率','平均值','最低值'],
rows: [{
        '日期': '2015年',
        '本期': 133454.93,
        '上期': 119299.98,
        '增减率': 4.61,
        '平均值':2.31,
        '最低值':1.65
    },
    {
        '日期': '2016年',
        '本期': 153130.42,
        '上期': 135608.59,
        '增减率':5.44,
        '平均值':2.31,
        '最低值':1.65
    },
    {
        '日期': '2017年',
        '本期': 156494.52,
        '上期': 139177.78,
        '增减率': 9.07,
        '平均值':2.31,
        '最低值':4.65
    },
    {
        '日期': '2018年',
        '本期': 72108.25,
        '上期': 143880.40,
        '增减率': 10.24,
        '平均值':4.31,
        '最低值':6.65
    },
    {
        '日期': '2019年',
        '本期': 32670.20,
        '上期': 54330.80,
        '增减率': 12.27,
        '平均值':3.31,
        '最低值':6.65
    }
]}
let mainChartSettings = {
    showLine: ['增减率','平均值','最低值'],
    axisSite: {
        right: ['增减率','平均值','最低值']
    }
}
export {
    chartData1,
    chartData2,
    chartData3,
    chartData4,
    chartData5,
    chartData9,
    tableData,
    tableData1,
    goujiData,
    kemuData,
    kemuData1,
    kemuData2,
    kemuData3,
    mainChartData,
    mainChartData1,
    mainChartData2,
    mainChartData3,
    mainChartSettings

}