let gridData = [
    {
    "field1": "营业总收入",
    "field2": "0.00",
    "field3": "490.00",
    "field4": "-490.00",
    "field5": "-100.00",
},
{
    "field1": "营业总成本",
    "field2": "105,817.85",
    "field3": "114,161.48",
    "field4": "-8,343.63",
    "field5": "-7.31",
},
{
    "field1": "其中：营业成本",
    "field2": "0.00",
    "field3": "0.00",
    "field4": "0.00",
    "field5": "0.00",
},
{
    "field1": "销售费用",
    "field2": "0.00",
    "field3": "0.00",
    "field4": "0.00",
    "field5": "0.00",
},
{
    "field1": "管理费用",
    "field2": "33,616.3",
    "field3": "50,059.70",
    "field4": "-16,443.36",
    "field5": "-32.85",
},
{
    "field1": "财务费用",
    "field2": "41,479.971",
    "field3": "46,176.59",
    "field4": "-4,696.63",
    "field5": "-10.17",
},
    
{
    "field1": "投资收益",
    "field2": "753,411.37",
    "field3": "318,264.65",
    "field4": "318,264.65",
    "field5": "0.00",
},
{
    "field1": "资产减值损失",
    "field2": "-1,100.00",
    "field3": "-5,590.00",
    "field4": "4,490.00",
    "field5": "80.32",
},
{
    "field1": "营业利润",
    "field2": "646,493.52",
    "field3": "199,003.17",
    "field4": "447,490.35",
    "field5": "224.87",
},
{
    "field1": "营业外收入",
    "field2": "40.00",
    "field3": "34.80",
    "field4": "5.20",
    "field5": "14.94",
},
{
    "field1": "营业外支出",
    "field2": "12.65",
    "field3": "1,086.62",
    "field4": "-1,073.97",
    "field5": "-98.84",
},
{
    "field1": "利润总额",
    "field2": "646,520.87",
    "field3": "197,951.35",
    "field4": "448,569.52",
    "field5": "226.61",
},
{
    "field1": "净利润",
    "field2": "622,788.70",
    "field3": "197,951.35",
    "field4": "424,837.35",
    "field5": "214.62",
},
]
let gridData1 = [
    {
        "field1": "存货",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    },
    {
        "field1": "应收账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    },
    {
        "field1": "预付款项",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    }, 
     {
        "field1": "其他应收款",
        "field2": "533,661.49",
        "field3": "421,891.93",
        "field4": "421,891.93",
        "field5": "26.49",
    },
]
let gridData2 = [
    {
        "field1": "应付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    },
    {
        "field1": "预收款项",
        "field2": "0.00",
        "field3": "0.22",
        "field4": "0.00",
        "field5": "0.00",
    },
    {
        "field1": "应付职工薪酬",
        "field2": "610.42",
        "field3": "788.87",
        "field4": "-178.45",
        "field5": "-22.62",
    },
    {
        "field1": "应交税费",
        "field2": "464.40",
        "field3": "61.42",
        "field4": "402.99",
        "field5": "656.16",
    },
    {
        "field1": "应付利息",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    },
    {
        "field1": "其他应付款",
        "field2": "210,959.03",
        "field3": "204,203.07",
        "field4": "6,755.96",
        "field5": "3.31",
    },
    {
        "field1": "一年内到期的非流动负债",
        "field2": "1,350,000.00",
        "field3": "500,000.00",
        "field4": "850,000.00",
        "field5": "170.00",
    },
    {
        "field1": "其他流动负债",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    },
    {
        "field1": "经营性负债合计",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "0.00",
    },

]
let gridData3 = [
    {
        "field1": "财务风险系数",
        "field2": "1.52",
        "field3": "1.19",
        "field4": "0.33",
        "field5": "27.74",
    },
    {
        "field1": "经营风险系数",
        "field2": "1.09",
        "field3": "1.57",
        "field4": "-0.47",
        "field5": "-30.27",
    },
    {
        "field1": "营业安全率",
        "field2": "0.00",
        "field3": "6,761.76",
        "field4": "-6,761.76",
        "field5": "-100.00",
    },
    {
        "field1": "盈亏平衡点",
        "field2": "0.00",
        "field3": "-32,642.63",
        "field4": "32,642.63",
        "field5": "100.00",
    },

]
let gridData4 = [
    {
        "field1": "货币资金",
        "field2": "1,433,928.68",
        "field3": "530,198.17",
        "field4": "1,433,928.68",
        "field5": "短期借款",
        "field6": "1,620,000.00",
        "field7": "1,555,000.00",
        "field8": "1,620,000.00",
    },
    {
        "field1": "应收票据",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "应付票据",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "应付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "预收账款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "预付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "预收账款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "其他应收款",
        "field2": "533,661.49",
        "field3": "421,891.93",
        "field4": "533,661.49",
        "field5": "其他应收款",
        "field6": "210,959.03",
        "field7": "204,203.07",
        "field8": "210,959.03",
    },
    {
        "field1": "存货",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "流动负债",
        "field6": "3,182,033.86",
        "field7": "2,260,053.36",
        "field8": "3,182,033.86",
    },
    {
        "field1": "预付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "预收账款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "流动资产",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "长期借款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "长期股权投资",
        "field2": "8,329,294.34",
        "field3": "7,796,431.81",
        "field4": "7,796,431.81",
        "field5": "非流动负债",
        "field6": "2,079,242.20",
        "field7": "1,531,903.40",
        "field8": "2,079,242.20",
    },
    {
        "field1": "固定资产",
        "field2": "10,119.62",
        "field3": "10,119.62",
        "field4": "10,119.62",
        "field5": "负债合计",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "无形资产",
        "field2": "65,736.90",
        "field3": "65,736.90",
        "field4": "65,736.90",
        "field5": "盈余公积",
        "field6": "112,452.49",
        "field7": "50,173.62",
        "field8": "112,452.49",
    },
    {
        "field1": "非流动资产",
        "field2": "11,153,812.60",
        "field3": "10,032,363.56",
        "field4": "11,153,812.60",
        "field5": "未分配利润",
        "field6": "903,081.11",
        "field7": "390,809.38",
        "field8": "903,081.11",
    },
    {
        "field1": "总资产",
        "field2": "13,122,892.24",
        "field3": "10,985,815.25",
        "field4": "13,122,892.24",
        "field5": "所有者权益",
        "field6": "7,861,616.19",
        "field7": "7,193,858.49",
        "field8": "7,861,616.19",
    },
]
let gridData5 = [
    {
        "field1": "期间费用",
        "field2": "75,096.30",
        "field3": "96,236.29",
        "field4": "-21.97",
    },
    {
        "field1": "资产负债率",
        "field2": "40.09",
        "field3": "34.52",
        "field4": "5.57",
    },
    {
        "field1": "长短期借款占负债比重",
        "field2": "66.35",
        "field3": "0.00",
        "field4": "66.35",
    },
    {
        "field1": "利润总额",
        "field2": "646,520.87",
        "field3": "209,131.35",
        "field4": "209.15",
    },
  
]
let gridData6 = [
    {
        "field1": "资产净利率[%]",
        "field2": "5.17",
        "field3": "1.57",
        "field4": "3.60", 
        "field5": "0.00", 
    },
    {
        "field1": "资产净利率[%]",
        "field2": "646,520.87",
        "field3": "209.15",
        "field4": "209,131.35", 
        "field5": "0.00", 
    },
    {
        "field1": "净利润",
        "field2": "622,788.70",
        "field3": "11,262,001,79",
        "field4": "0.00", 
        "field5": "0.00", 
    },


]
let gridData7 = [
    {
        "field1": "货币资金",
        "field2": "1,433,928.68",
        "field3": "530,198.17",
        "field4": "170.45", 
        "field5": "短期借款", 
        "field6": "1,620,000.00", 
        "field7": "1,555,000.00", 
        "field8": "4.18", 
    },
    {
        "field1": "应收票据",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00", 
        "field5": "应付票据",
        "field6": "0.00", 
        "field7": "0.00", 
        "field8": "0.00",  
    },
    {
        "field1": "应收账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00", 
        "field5": "应付账款", 
        "field6": "0.00", 
        "field7": "0.00", 
        "field8": "0.00", 
    },
    {
        "field1": "预付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00", 
        "field5": "预收账款", 
        "field6": "0.00", 
        "field7": "0.00", 
        "field8": "0.00",  
    },
    {
        "field1": "其他应收款",
        "field2": "533,661.49",
        "field3": "421,891.93",
        "field4": "26.49", 
        "field5": "其他应付款", 
        "field6": "210,959.03", 
        "field7": "204,203.07", 
        "field8": "3.3", 
    },
    {
        "field1": "存货",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.009", 
        "field5": "一年内到期的非流动负债", 
        "field6": "0.00", 
        "field7": "0.00", 
        "field8": "0.00", 
    },
    {
        "field1": "流动资产合计",
        "field2": "1,969,079.65",
        "field3": "953,451.69",
        "field4": "106.52", 
        "field5": "流动负债合计", 
        "field6": "210,959.03", 
        "field7": "204,203.07", 
        "field8": "3.3", 
    },
    {
        "field1": "长期股权投资",
        "field2": "8,329,294.34",
        "field3": "7,796,431.81	",
        "field4": "6.83", 
        "field5": "长期借款", 
        "field6": "1,870,695.56", 
        "field7": "1,296,055.19", 
        "field8": "3.3", 
    },
    {
        "field1": "固定资产",
        "field2": "10,119.62",
        "field3": "10,390.74",
        "field4": "2.61", 
        "field5": "长期应付款", 
        "field6": "8,546.64", 
        "field7": "35,848.21", 
        "field8": "-76.16", 
    },
    {
        "field1": "在建工程",
        "field2": "847.90",
        "field3": "165.63",
        "field4": "411.92", 
        "field5": "其他非流动负债", 
        "field6": "0.00", 
        "field7": "0.00", 
        "field8": "0.00", 
    },
    {
        "field1": "无形资产",
        "field2": "65,736.90",
        "field3": "65,736.90",
        "field4": "0.00", 
        "field5": "非流动负债合计", 
        "field6": "2,079,242.20", 
        "field7": "1,531,903.40", 
        "field8": "35.73", 
    },
    {
        "field1": "开发支出",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00", 
        "field5": "负债合计", 
        "field6": "5,261,276.05", 
        "field7": "3,791,956.76", 
        "field8": "38.75", 
    },
    {
        "field1": "其他非流动资产",
        "field2": "2,632,630.38",
        "field3": "2,125,355.02",
        "field4": "23.87", 
        "field5": "实收资本", 
        "field6": "6,300,000.00", 
        "field7": "6,300,000.00", 
        "field8": "0.00", 
    },
    {
        "field1": "非流动资产合计",
        "field2": "11,153,812.60",
        "field3": "10,032,363.56",
        "field4": "11.18", 
        "field5": "非流动资产合计", 
        "field6": "546,082.59", 
        "field7": "452,875.49", 
        "field8": "20.58", 
    },
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "", 
        "field5": "未分配利润", 
        "field6": "903,081.11", 
        "field7": "390,809.38", 
        "field8": "131.08", 
    },
    {
        "field1": "资产总计",
        "field2": "13,122,892.24",
        "field3": "10,985,815.25",
        "field4": "19.45", 
        "field5": "所有者权益", 
        "field6": "7,861,616.19", 
        "field7": "7,861,616.19", 
        "field8": "9.28", 
    },

]
let chartData = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "短期借款",
            "2015年": "-3324.93",
            "2016年": "2159.04",
            "2017年": "4721.08"
        },
        {
            "日期": "向中央银行借款",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "拆入资金",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "交易性金融负债",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "预收款项",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "衍生金融负债",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "应付票据",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "应付账款",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },

    ]
}
let chartData1 = {
    columns: ["日期", "数值"],
    rows: [{
            "日期": "2018年",
            "数值": "-3200"
        },
        {
            "日期": "2019年",
            "数值": "-2000"
        },
    

    ]
}
let chartSettings = {
    showLine: ["数值"],
}
let chartData2 = {
    columns: ["日期", "营业利润", "资产净利率"],
    rows: [{
            "日期": "2018年",
            "营业利润": "2000.93",
            "资产净利率": "2159.04",
           
        },
        {
            "日期": "2019年",
            "营业利润": "6000.00",
            "资产净利率": "8000.00",
           
        },
    ]
}
let chartSettings1 = {
    showLine: ["资产净利率" ],
  
}
export {
    gridData,
    gridData1,
    gridData2,
    gridData3,
    gridData4,
    gridData5,
    gridData6,
    gridData7,
    chartData,
    chartData1,
    chartData2,
    chartSettings,
    chartSettings1

}