let chartData1 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
      { type: '速度', value: 80, a: 121, b: 2 }
    ]
}
let chartData2 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
      { type: '速度', value: 80, a: 248, b: 2 }
    ]
}
let chartData3 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
      { type: '速度', value: 80, a: 456, b: 2 }
    ]
}
let chartData4 = {
    columns: ['日期', '一年内可偿还的负债规模', '一年以上可偿还的负债规模', '下单率'],
    rows: [
        { '日期': '1月', '一年内可偿还的负债规模': 17.16, '一年以上可偿还的负债规模': 20.73, '下单率': 0.32 },
        { '日期': '2月', '一年内可偿还的负债规模': 3530, '一年以上可偿还的负债规模': -3230, '下单率': 0.26 },
        { '日期': '3月', '一年内可偿还的负债规模': 2923, '一年以上可偿还的负债规模': 2623, '下单率': 0.76 },
        { '日期': '4月', '一年内可偿还的负债规模': 1723, '一年以上可偿还的负债规模': 1423, '下单率': 0.49 },
        { '日期': '5月', '一年内可偿还的负债规模': 1393, '一年以上可偿还的负债规模': 1093, '下单率': 0.32 },
        { '日期': '6月', '一年内可偿还的负债规模': 3530, '一年以上可偿还的负债规模': 3230, '下单率': 0.26 },
        { '日期': '7月', '一年内可偿还的负债规模': 2923, '一年以上可偿还的负债规模': 2623, '下单率': 0.76 },
        { '日期': '8月', '一年内可偿还的负债规模': 1723, '一年以上可偿还的负债规模': 1423, '下单率': 0.49 },
        { '日期': '9月', '一年内可偿还的负债规模': 1393, '一年以上可偿还的负债规模': 1093, '下单率': 0.32 },
        { '日期': '10月', '一年内可偿还的负债规模': 3530, '一年以上可偿还的负债规模': 3230, '下单率': 0.26 },
        { '日期': '11月', '一年内可偿还的负债规模': 2923, '一年以上可偿还的负债规模': 2623, '下单率': 0.76 },
        { '日期': '12月', '一年内可偿还的负债规模': 1723, '一年以上可偿还的负债规模': 1423, '下单率': 0.49 },
    ]
}

export {
    chartData1,
    chartData2,
    chartData3,
    chartData4,
}