let tableData =[
    {"no":"盈亏平衡点",},
    {"no":"营业安全率",},
    {"no":"营业安全水平",},
    {"no":"经营风险系数","code":5.2,"name":-98.87,"sort":"企业的偿债能力与经济效益存在正负相关性","count":-178.59,"ratio":-59.10,"zengzhang":1806.72},
    ]
    let tableDataa =[
        {"no":"财务风险临界点","code":4.72,"name":5.98,"count":-34.88,"ratio":496822.96,"zengzhang":16.17},
        {"no":"筹资无差别点","code":4.23,"name":-2.00,"sort":"企业不应该再增加借款，而应该加大企业自有资金的比率，提高自有资金的比率也会使企业的自有资金利润率提高。","count":-95.32,"ratio":-0.81,"zengzhang":36.19},
        {"no":"财务风险杠杆系数","code":0.8,"name":540.73,"sort":"企业为负效应且财务风险敏感性企业","count":-165.01,"ratio":-1.51,"zengzhang":16.17},
        ]
    let table1Data = [
        { "no": 1, "field1": "企业发展阶段            ", "field2": "自由现金流", "field3": "初创阶段", "field4": "企业经营现金流为负，企业加大产品研发投入，研发费用大幅上升，企业可动用的资金总额较少，企业贷款期限较长。", "field5": "应关注研发支出，风险关注成本费用化" },
        { "no": 2, "field1": "贷款期限（基于长期债务）", "field2": "收入增长  ", "field3": "成长阶段", "field4": "客户短期偿债能力较强，侧重于流动贷款。                                                                  ", "field5": "关注资金的流动性风险              " }
    ]
    let table2Data = [
        { "no": 1, "field1": "   固定资产率   ", "field2": "	65.21 ", "field3": "  60.73", "field4": "   固定资产率 高于行业平均水平，则规定 资产周转天数远低于行业平均水平，可能存在营业收入虚增异常风险。                                                           " },
        { "no": 2, "field1": "   资产负债率   ", "field2": "	85.25 ", "field3": "  80.49", "field4": "   负债占资产的比例高于行业平均水平，存在一定财务风险。                                                                                                         " },
        { "no": 3, "field1": "   营业利润率   ", "field2": "	84.63 ", "field3": "  81.92", "field4": "   营业利润率低于行业平均水平，表明公司经营业务盈利能力相对较差，应关注经营风险。                                                                               " },
        { "no": 4, "field1": "   净资产收益率 ", "field2": "  37.95 ", "field3": "  28.59", "field4": "   净资产收益率低于行业平均水平 ，表明公司盈利能力和和运营资本的能力相对较差，可能收入下降 或成本费用上升，需关注经营风险。                                     " },
        { "no": 5, "field1": "   总资产收益率 ", "field2": "  28.63 ", "field3": "  20.83", "field4": "   总资产收益率低于行业平均水平，表明公司的投入产出比下降，盈利能力相对变差，可能营业收入下降或者成本费用上升。或者新增资产的盈利能力相对较差，需关注经营风险。 " }
    ]
    let table3Data = [
        { "no": 1, "field1": "  经营风险预警", "field2": "   主营业务收入利润率、营业利润比重", "field3": "  主营业务利润率偏低；本期营业 利润比重偏低，说明公司主营业务下降，生产经营异常。 ", "field4": "  经营风险增大，需加以关注；主营业务收入、营业利润。                  " },
        { "no": 2, "field1": "  资金风险预警", "field2": "   盈利现金比率   					", "field3": " 该比率小于1，说明本期净利中存在尚未实现现金的收入。在这种情况下，即使企业盈利，也可能发生现金短缺，严重时会导致企业破产。 ", "field4": "  经营现金净流量、净利润。  " },
        { "no": 3, "field1": "  债务状况预警", "field2": "   已获利息倍数   					", "field3": "	已获利息倍数大于1，说明企业在利息支付方面是安全的，企业有充分的收益来保证企业利息费用的支付。 ", "field4": "  息税前利润、利息支出。                              " },
        { "no": 4, "field1": "  现金状况预警", "field2": "   净利实现率   					", "field3": "	净利实现率过低，收现能力较差、收现速度缓慢。 ", "field4": "  经营活动现金净流入。                                                                                 " }
    ]
    let table4Data = [
        { "no": 1, "field1": "  企业发展阶段  			 ", "field2": "  经营活动现金净流入、投资活动现金净流出 ", "field3": "  成熟阶段 ", "field4": "  企业经营活动快速发展在现金流上体现为经营活动现金净流入的增长15,3480.00万元，与此同时投资活动现金净流出减少1,4100.21万元，而筹资活动现金净流入减少3,2340.11万元，甚至开始表现为净流出。", "field5": "   在前景悲观行业，关注行业财务指标盈利性。   " },
        { "no": 2, "field1": "  贷款期限（基于短期偿债）", "field2": "   资产负债率、权益总资产率              ", "field3": "  成长阶段 ", "field4": "  固定资产贷款比上年增长5,6220.26万元，增幅13.29%。                                                                                                                                      ", "field5": "   关注资产净额及净利润。" }
    ]
    let table5Data = [
        { "no": 1, "field1": "  净资产收益率  ", "field2": " 34.21 ", "field3": "  30.26 ", "field4": "  固定资产率 高于行业平均水平，则规定 资产周转天数远低于行业平均水平，可能存在营业收入虚增异常风险。 " },
        { "no": 2, "field1": "  总资产收益率 ", "field2": "  21.35 ", "field3": "  25.36  ", "field4": " 负债占资产的比例高于行业平均水平，存在一定财务风险。" }
    ]
    let table6Data = [
        { "no": 1, "field1": "  经营风险预警", "field2": "   现金流量结构 ", "field3": "  保守型 ", "field4": "  经营活动现金流入、投入活动现金流入、筹资活动现金流入。  " },
        { "no": 2, "field1": "  资金风险预警 ", "field2": "  营业利润比重", "field3": "   本期营业 利润比重接近平均值，说明公司主营业务上升，生产经营异常。", "field4": "   主营业务收入、营业利润。" }
    ]
    let chartData1= {
        columns: ['日期', '低风险','中低风险','中风险','中高风险','高风险'],
        rows: [
            { 日期: '低风险', '低风险': 1},
            { 日期: '中低风险', '中低风险': 2},
            { 日期: '中风险', '中风险': 11 },
            { 日期: '中高风险', '中高风险': 6 },
            { 日期: '中高风险', '高风险': 6 },
        ]
    }
    let chartData2={
        columns: ['type', 'a', 'b', 'value'],
        rows: [
            { type: '速度', value: 2, a:8, b: 2 }
        ]
    }
    let chartData3 = {
        columns: ['日期', '营业安全率', '盈亏平衡点'],
        rows: [{
                '日期': '2015年',
                '营业安全率': 57720.00,
                '盈亏平衡点': 56350.00,
                '下单率': 0.32
            },
            {
                '日期': '2016年',
                '营业安全率': 65950.00,
                '盈亏平衡点': 49320.00,
                '下单率': 0.26
            },
            {
                '日期': '2017年',
                '营业安全率': 56990.00,
                '盈亏平衡点': 54080.00,
                '下单率': 0.76
            },
            {
                '日期': '2018年',
                '营业安全率': 41690.00,
                '盈亏平衡点': 30840.00,
                '下单率': 0.49
            },
            {
                '日期': '2019年',
                '营业安全率': 51100.00,
                '盈亏平衡点': 40600.00,
                '下单率': 0.323
            },
        ]
    }
    let chartData4 = {
        columns: ['日期', '经营风险杠杆系数', '营业安全水平'],
        rows: [{
                '日期': '2015年',
                '经营风险杠杆系数': 13.00,
                '营业安全水平': -1.00,
            },
            {
                '日期': '2016年',
                '经营风险杠杆系数': 6.00,
                '营业安全水平': -60.00,
            },
            {
                '日期': '2017年',
                '经营风险杠杆系数': 1.00,
                '营业安全水平': -2.00,
            },
            {
                '日期': '2018年',
                '经营风险杠杆系数':3.00,
                '营业安全水平': 40.00,
            },
            {
                '日期': '2019年',
                '经营风险杠杆系数': 8.00,
                '营业安全水平': 6.00,
            },
        ]
    }
    let chartData33 = {
        columns: ['日期', '财务风险临界点', '筹资无差别点'],
        rows: [{
                '日期': '2015年',
                '财务风险临界点': 57720.00,
                '筹资无差别点': 56350.00,
            },
            {
                '日期': '2016年',
                '财务风险临界点': 65950.00,
                '筹资无差别点': 49320.00,
            },
            {
                '日期': '2017年',
                '财务风险临界点': 56990.00,
                '筹资无差别点': 54080.00,
            },
            {
                '日期': '2018年',
                '财务风险临界点': 41690.00,
                '筹资无差别点': 30840.00,
            },
            {
                '日期': '2019年',
                '财务风险临界点': 51100.00,
                '筹资无差别点': 40600.00,
            },
        ]
    }
    let chartData44 = {
        columns: ['日期', '财务风险杠杆系数', ],
        rows: [{
                '日期': '2015年',
                '财务风险杠杆系数': 13.00,
                '营业安全水平': -1.00,
            },
            {
                '日期': '2016年',
                '财务风险杠杆系数': 6.00,
                '营业安全水平': -60.00,
            },
            {
                '日期': '2017年',
                '财务风险杠杆系数': 1.00,
                '营业安全水平': -2.00,
            },
            {
                '日期': '2018年',
                '财务风险杠杆系数':3.00,
                '营业安全水平': 40.00,
            },
            {
                '日期': '2019年',
                '财务风险杠杆系数': 8.00,
                '营业安全水平': 6.00,
            },
        ]
    }
    export {
        tableData,
        tableDataa,
        table1Data,
        table2Data,
        table3Data,
        table4Data,
        table5Data,
        table6Data,
        chartData1,
        chartData2,
        chartData3,
        chartData33,
        chartData44,
        chartData4
    
    }