let chartData1 = {
    columns: ['field1', '苏州新乔建筑技术有限公司', '中铁建筑集团建筑发展有限公司', '天津三建建筑工程有限公司', '中国建筑集团有限公司 ', '河南建怀建筑工程有限公司', '广东长风建筑工程有限公司', '中楷建筑劳务有限公司 ', '福建融展建筑工程有限公司', '深圳市海龙建筑工程有限公司 ', '江苏轩洋建筑工程有限公司'],
    rows: [{
        "no": 1,
        "field1": "",
        '广东长旺财务股份有限公司': 8.8,
        '山东百丞税务服务股份有限公司': 8.4,
        '中延（苏州）科技股份有限公司': 8.3,
        '拉萨国瑞税务咨询股份有限公司 ': 8.2,
        '陕西公正税务服务股份有限公司': 7.5,
        '深圳皇嘉财润财务顾问股份有限公司': 7.3,
        '河北中浩华财税服务集团股份公司 ': 7.2,
        '北京华信永安会计服务有限公司': 6.8,
        '中瀚石林企业咨询（上海）有限公司 ': 6.5,
        '天衣（北京）科技有限公司': 6.2
    }, ]
}
let chartData2 = {
    columns: ['field1', '苏州新乔建筑技术有限公司', '中铁建筑集团建筑发展有限公司', '天津三建建筑工程有限公司', '中国建筑集团有限公司 ', '河南建怀建筑工程有限公司', '广东长风建筑工程有限公司', '中楷建筑劳务有限公司 ', '福建融展建筑工程有限公司', '深圳市海龙建筑工程有限公司 ', '江苏轩洋建筑工程有限公司'],
    rows: [{
        "no": 1,
        "field1": "",
        '苏州新乔建筑技术有限公司': 2.1,
        '中铁建筑集团建筑发展有限公司': 2.5,
        '天津三建建筑工程有限公司': 2.7,
        '中国建筑集团有限公司 ': 3.2,
        '河南建怀建筑工程有限公司': 3.5,
        '广东长风建筑工程有限公司': 3.6,
        '中楷建筑劳务有限公司 ': 3.9,
        '福建融展建筑工程有限公司': 4.1,
        '深圳市海龙建筑工程有限公司 ': 4.2,
        '江苏轩洋建筑工程有限公司': 4.3
    }, ]
}
let tableData1 = [{
        "no": 1,
        "field1": " 10000101 ",
        "field2": "广东长旺财务股份有限公司",
        "field3": "  1 ",
        "field4": "  8.8 ",
        "field5": "优秀"
    },
    {
        "no": 2,
        "field1": " 10000102 ",
        "field2": "山东百丞税务服务股份有限公司",
        "field3": "  2 ",
        "field4": "  8.4 ",
        "field5": "优秀"
    },
    {
        "no": 3,
        "field1": " 10000103 ",
        "field2": "中延（苏州）科技股份有限公司",
        "field3": "  3 ",
        "field4": "  8.4 ",
        "field5": "优秀"
    },
    {
        "no": 4,
        "field1": " 10000104 ",
        "field2": "拉萨国瑞税务咨询股份有限公司",
        "field3": "  4 ",
        "field4": "  8.2 ",
        "field5": "优秀"
    },
    {
        "no": 5,
        "field1": " 10000105 ",
        "field2": "陕西公正税务服务股份有限公司",
        "field3": "  5 ",
        "field4": "  7.5 ",
        "field5": "良好"
    },
    {
        "no": 6,
        "field1": " 10000106 ",
        "field2": "深圳皇嘉财润财务顾问股份有限公司",
        "field3": "  6 ",
        "field4": "  7.3 ",
        "field5": "良好"
    },
    {
        "no": 7,
        "field1": " 10000107 ",
        "field2": "河北中浩华财税服务集团股份公司",
        "field3": "  7 ",
        "field4": "  7.2 ",
        "field5": "良好"
    },
    {
        "no": 8,
        "field1": " 10000108 ",
        "field2": "北京华信永安会计服务有限公司",
        "field3": "  8 ",
        "field4": "  6.8 ",
        "field5": "一般"
    },
    {
        "no": 9,
        "field1": " 10000109 ",
        "field2": "中瀚石林企业咨询（上海）有限公司",
        "field3": "  9 ",
        "field4": "  6.5 ",
        "field5": "一般"
    },
    {
        "no": 10,
        "field1": " 10000110 ",
        "field2": "天衣（北京）科技有限公司",
        "field3": " 10 ",
        "field4": "  6.2 ",
        "field5": "一般"
    }
]
let tableData2 = [{
        "no": 1,
        "field1": " 10000302 ",
        "field2": "北京良得天下商务服务有限公司",
        "field3": "	1  ",
        "field4": " 2.1 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 2,
        "field1": " 10000303 ",
        "field2": "汉唐通信咨询股份有限公司",
        "field3": " 	2  ",
        "field4": " 2.5 ",
        "field5": "较差",
        "field6": " 详情       "
    },
    {
        "no": 3,
        "field1": " 10000304 ",
        "field2": "陕西淘钉智能财税有限公司",
        "field3": "	3  ",
        "field4": " 2.7 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 4,
        "field1": " 10000305 ",
        "field2": "山东富翔代理记账有限公司",
        "field3": "	4  ",
        "field4": " 3.2 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 5,
        "field1": " 10000306 ",
        "field2": "上海大之商科技发展股份有限公司",
        "field3": "	5  ",
        "field4": " 3.5 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 6,
        "field1": " 10000307 ",
        "field2": "广州财捷财务咨询有限公司",
        "field3": "	6  ",
        "field4": " 3.6 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 7,
        "field1": " 10000308 ",
        "field2": "重庆麦积财务管理有限公司",
        "field3": "	7  ",
        "field4": " 3.9 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 8,
        "field1": " 10000309 ",
        "field2": "海南财务财税中心",
        "field3": "	8  ",
        "field4": " 4.1 ",
        "field5": "较差",
        "field6": " 详情   "
    },
    {
        "no": 9,
        "field1": " 10000310 ",
        "field2": "北京小苗财税服务有限公司",
        "field3": "	9  ",
        "field4": " 4.2 ",
        "field5": "较差",
        "field6": " 详情       "
    },
    {
        "no": 10,
        "field1": " 10000311 ",
        "field2": "北京聚金汇会计事务有限公司",
        "field3": "	10 ",
        "field4": " 4.3 ",
        "field5": "较差",
        "field6": " 详情   "
    }
]

let tableData = [{
        "no": "评级标准",
        "field1": "AAA+",
        "field2": "利润最大化",
        "field3": "税项分析法",
        "field4": "股权融资",
        "field5": "检验异常",
        "field6": "4个",
        "field7": "详情",
        "field8": "详情"
    },
    {
        "no": "文字结论",
        "field1": "非常优秀",
        "field2": "低估负债",
        "field3": "毛利分析法",
        "field4": "债权融资",
        "field5": "检验异常",
        "field6": "3个",
        "field7": "详情",
        "field8": "详情"
    },
]
let tableData3 = []

export {
    chartData1,
    chartData2,
    tableData,
    tableData1,
    tableData2,
    tableData3,
}