let data1 = [
    {
        label: '(A)农、林、牧、渔业',
        children: [
            {
                label: '(A01)农业',
                children: [
                    {
                        label: '(A011)谷物种植',
                        children: [{
                            label: '(A0111)稻谷种植'
                        },
                            {
                                label: '(A0112)小麦种植',
                            },
                            {
                                label: '(A0113)玉米种植',
                            },
                            {
                                label: '(A0119)其他谷物种植',
                            },
                        ]
                    },
                    {
                        label: '(A012)豆类、油料和薯类种植',
                        children: [
                            {
                                label: '(A0121)豆类种植'
                            },
                            {
                                label: '(A0122)油料种植'
                            },
                            {
                                label: '(A0123)薯类种植'
                            },
                        ]
                    },
                    {
                        label: '(A013)棉、麻、糖、烟草种植',
                        children: [
                            {
                                label: '(A0131)棉花种植'
                            },
                            {
                                label: '(A0132)麻类种植'
                            },
                            {
                                label: '(A0133)糖料种植'
                            },
                            {
                                label: '(A0134)烟草种植'
                            },
                        ]
                    },
                    {
                        label: '(A014)蔬菜、食用菌及园艺作物种植',
                        children: [
                            {
                                label: '(A0141)蔬菜种植'
                            },
                            {
                                label: '(A0142)食用菌种植'
                            },
                            {
                                label: '(A0143)花卉种植'
                            },
                            {
                                label: '(A0149)其他园艺作物种植'
                            },
                        ]
                    },
                    {
                        label: '(A015)水果种植',
                        children: [
                            {
                                label: '(A0151)仁果类和核果类水果种植'
                            },
                            {
                                label: '(A0152)葡萄种植'
                            },
                            {
                                label: '(A0153)柑橘类种植'
                            },
                            {
                                label: '(A0154)香蕉等亚热带水果种植'
                            },
                            {
                                label: '(A0159)其他水果种植'
                            },
                        ]
                    },
                    {
                        label: '(A016)坚果、含油果、香料和饮料作物种植',
                        children: [
                            {
                                label: '(A0161)坚果种植'
                            },
                            {
                                label: '(A0162)含油果种植'
                            },
                            {
                                label: '(A0163)香料作物种植'
                            },
                            {
                                label: '(A0169)茶及其他饮料作物种植'
                            },
                        ]
                    },
                    {
                        label: '(A0170)中药材种植',
                    },
                    {
                        label: '(A0190)其他农业',
                    },
                ]
            },
            {
                label: '(A02)林业',
                children: [
                    {
                        label: '(A021)林木育种和育苗',
                        children: [
                            {
                                label: '(A0211)林木育种'
                            },
                            {
                                label: '(A0212)林木育苗'
                            },
                        ]
                    },
                    {
                        label: '(A0220)造林和更新',
                    },
                    {
                        label: '(A0230)森林经营和管护',
                    },
                    {
                        label: '(A024)木材和竹材采运',
                        children: [
                            {
                                label: '(A0241)木材采运'
                            },
                            {
                                label: '(A0242)竹材采运'
                            },
                        ]
                    },
                    {
                        label: '(A025)林产品采集',
                        children: [
                            {
                                label: '(A0251)木竹材林产品采集'
                            },
                            {
                                label: '(A0252)非木竹材林产品采集'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(A03)畜牧业',
                children: [
                    {
                        label: '(A031)牲畜饲养',
                        children: [
                            {
                                label: '(A0311)牛的饲养'
                            },
                            {
                                label: '(A0312)马的饲养'
                            },
                            {
                                label: '(A0313)猪的饲养'
                            },
                            {
                                label: '(A0314)羊的饲养'
                            },
                            {
                                label: '(A0315)骆驼饲养'
                            },
                            {
                                label: '(A0319)其他牲畜饲养'
                            },
                        ]
                    },
                    {
                        label: '(A032)家禽饲养',
                        children: [
                            {
                                label: '(A0321)鸡的饲养'
                            },
                            {
                                label: '(A0322)鸭的饲养'
                            },
                            {
                                label: '(A0323)鹅的饲养'
                            },
                            {
                                label: '(A0329)其他家禽饲养'
                            },
                        ]
                    },
                    {
                        label: '(A0330)狩猎和捕捉动物',
                    },
                    {
                        label: '(A0390)其他畜牧业',
                    },
                ]
            },
            {
                label: '(A04)渔业',
                children: [
                    {
                        label: '(A041)水产养殖',
                        children: [
                            {
                                label: '(A0411)海水养殖'
                            },
                            {
                                label: '(A0412)内陆养殖'
                            },
                        ]
                    },
                    {
                        label: '(A042)水产捕捞',
                        children: [
                            {
                                label: '(A0421)海水捕捞'
                            },
                            {
                                label: '(A0422)内陆捕捞'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(A05)农、林、牧、渔服务业',
                children: [
                    {
                        label: '(A051)农业服务业',
                        children: [
                            {
                                label: '(A0511)农业机械服务'
                            },
                            {
                                label: '(A0512)灌溉服务'
                            },
                            {
                                label: '(A0513)农产品初加工服务'
                            },
                            {
                                label: '(A0519)其他农业服务'
                            },
                        ]
                    },
                    {
                        label: '(A052)林业服务业',
                        children: [
                            {
                                label: '(A0521)林业有害生物防治服务'
                            },
                            {
                                label: '(A0522)森林防火服务'
                            },
                            {
                                label: '(A0523)林产品初级加工服务'
                            },
                            {
                                label: '(A0529)其他林业服务'
                            },
                        ]
                    },
                    {
                        label: '(A0530)畜牧服务业'
                    },
                    {
                        label: '(A0540)渔业服务业'
                    },
                ]
            },
        ]
    },
    {
        label: '(B)采矿业',
        children: [
            {
                label: '(B06)煤炭开采和洗选业',
                children: [
                    {
                        label: '(B0610)烟煤和无烟煤开采洗选'
                    },
                    {
                        label: '(B0620)褐煤开采洗选'
                    },
                    {
                        label: '(B0690)其他煤炭采选'
                    },
                ]
            },
            {
                label: '(B07)石油和天然气开采业',
                children: [
                    {
                        label: '(B0710)石油开采'
                    },
                    {
                        label: '(B0720)天然气开采'
                    },
                ]
            },
            {
                label: '(B08)黑色金属矿采选业',
                children: [
                    {
                        label: '(B0810)铁矿采选'
                    },
                    {
                        label: '(B0820)锰矿、铬矿采选'
                    },
                    {
                        label: '(B0890)其他黑色金属矿采选'
                    },
                ]
            },
            {
                label: '(B09)有色金属矿采选业',
                children: [
                    {
                        label: '(B091)常用有色金属矿采选',
                        children: [
                            {
                                label: '(B0911)铜矿采选'
                            },
                            {
                                label: '(B0912)铅锌矿采选'
                            },
                            {
                                label: '(B0913)镍钴矿采选'
                            },
                            {
                                label: '(B0914)锡矿采选'
                            },
                            {
                                label: '(B0915)锑矿采选'
                            },
                            {
                                label: '(B0916)铝矿采选'
                            },
                            {
                                label: '(B0917)镁矿采选'
                            },
                            {
                                label: '(B0919)其他常用有色金属矿采选'
                            },
                        ]
                    },
                    {
                        label: '(B092)贵金属矿采选',
                        children: [
                            {
                                label: '(B0921)金矿采选'
                            },
                            {
                                label: '(B0922)银矿采选'
                            },
                            {
                                label: '(B0929)其他贵金属矿采选'
                            }
                        ]
                    },
                    {
                        label: '(B093)稀有稀土金属矿采选',
                        children: [
                            {
                                label: '(B0931)钨钼矿采选'
                            },
                            {
                                label: '(B0932)稀土金属矿采选'
                            },
                            {
                                label: '(B0933)放射性金属矿采选'
                            },
                            {
                                label: '(B0939)其他稀有金属矿采选'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(B10)非金属矿采选业',
                children: [
                    {
                        label: '(B101)土砂石开采',
                        children: [
                            {
                                label: '(B1011)石灰石、石膏开采'
                            },
                            {
                                label: '(B1012)建筑装饰用石开采'
                            },
                            {
                                label: '(B1013)耐火土石开采'
                            },
                            {
                                label: '(B1019)粘土及其他土砂石开采'
                            },

                        ]
                    },
                    {
                        label: '(B1020)化学矿开采'
                    },
                    {
                        label: '(B1030)采盐'
                    },
                    {
                        label: '(B109)石棉及其他非金属矿采选',
                        children: [
                            {
                                label: '(B1091)石棉、云母矿采选'
                            },
                            {
                                label: '(B1092)石墨、滑石采选'
                            },
                            {
                                label: '(B1093)宝石、玉石采选'
                            },
                            {
                                label: '(B1099)其他未列明非金属矿采选'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(B11)开采辅助活动',
                children: [
                    {
                        label: '(B1110)煤炭开采和洗选辅助活动'
                    },
                    {
                        label: '(B1120)石油和天然气开采辅助活动'
                    },
                    {
                        label: '(B1190)其他开采辅助活动'
                    },
                ]
            },
            {
                label: '(B12)其他采矿业',
                children: [{
                    label: '(B1200)其他采矿业'
                }]
            },
        ]
    },
    {
        label: '(C)制造业',
        children: [{
            label: '(C13)农副食品加工业',
            children: [
                {
                    label: '(C1310)谷物磨制'
                },
                {
                    label: '(C1320)饲料加工'
                },
                {
                    label: '(C133)植物油加工',
                    children: [
                        {
                            label: '(C1331)食用植物油加工'
                        },
                        {
                            label: '(C1332)非食用植物油加工'
                        },
                    ]
                },
                {
                    label: '(C1340)制糖业'
                },
                {
                    label: '(C135)屠宰及肉类加工',
                    children: [
                        {
                            label: '(C1351)牲畜屠宰'
                        },
                        {
                            label: '(C1352)禽类屠宰'
                        },
                        {
                            label: '(C1353)肉制品及副产品加工'
                        },
                    ]
                },
                {
                    label: '(C136)水产品加工',
                    children: [
                        {
                            label: '(C1361)水产品冷冻加工'
                        },
                        {
                            label: '(C1362)鱼糜制品及水产品干腌制加工'
                        },
                        {
                            label: '(C1363)水产饲料制造'
                        },
                        {
                            label: '(C1364)鱼油提取及制品制造'
                        },
                        {
                            label: '(C1369)其他水产品加工'
                        },
                    ]
                },
                {
                    label: '(C137)蔬菜、水果和坚果加工',
                    children: [
                        {
                            label: '(C1371)蔬菜加工'
                        },
                        {
                            label: '(C1372)水果和坚果加工'
                        },

                    ]
                },
                {
                    label: '(C139)其他农副食品加工',
                    children: [
                        {
                            label: '(C1391)淀粉及淀粉制品制造'
                        },
                        {
                            label: '(C1392)豆制品制造'
                        },
                        {
                            label: '(C1393)蛋品加工'
                        },
                        {
                            label: '(C1399)其他未列明农副食品加工'
                        },
                    ]
                },
            ]
        },
            {
                label: '(C14)食品制造业',
                children: [
                    {
                        label: '(C141)焙烤食品制造',
                        children: [
                            {
                                label: '(C1411)糕点、面包制造'
                            },
                            {
                                label: '(C1419)饼干及其他焙烤食品制造'
                            },
                        ]
                    },
                    {
                        label: '(C142)糖果、巧克力及蜜饯制造',
                        children: [
                            {
                                label: '(C1421)糖果、巧克力制造'
                            },
                            {
                                label: '(C1422)蜜饯制作'
                            },
                        ]
                    },
                    {
                        label: '(C143)方便食品制造',
                        children: [
                            {
                                label: '(C1431)米、面制品制造'
                            },
                            {
                                label: '(C1432)速冻食品制造'
                            },
                            {
                                label: '(C1439)方便面及其他方便食品制造'
                            },
                        ]
                    },
                    {
                        label: '(C1440)乳制品制造'
                    },
                    {
                        label: '(C145)罐头食品制造',
                        children: [
                            {
                                label: '(C1451)肉、禽类罐头制造'
                            },
                            {
                                label: '(C1452)水产品罐头制造'
                            },
                            {
                                label: '(C1453)蔬菜、水果罐头制造'
                            },
                            {
                                label: '(C1459)其他罐头食品制造'
                            },
                        ]
                    },
                    {
                        label: '(C146)调味品、发酵制品制造',
                        children: [
                            {
                                label: '(C1461)味精制造'
                            },
                            {
                                label: '(C1462)酱油、食醋及类似制品制造'
                            },
                            {
                                label: '(C1469)其他调味品、发酵制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C149)其他食品制造',
                        children: [
                            {
                                label: '(C1491)营养食品制造'
                            },
                            {
                                label: '(C1492)保健食品制造'
                            },
                            {
                                label: '(C1493)冷冻饮品及食用冰制造'
                            },
                            {
                                label: '(C1494)盐加工'
                            },
                            {
                                label: '(C1495)食品及饲料添加剂制造'
                            },
                            {
                                label: '(C1499)其他未列明食品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C15)酒、饮料和精制茶制造业',
                children: [
                    {
                        label: '(C151)酒的制造',
                        children: [
                            {
                                label: '(C1511)酒精制造'
                            },
                            {
                                label: '(C1512)白酒制造'
                            },
                            {
                                label: '(C1513)啤酒制造'
                            },
                            {
                                label: '(C1514)黄酒制造'
                            },
                            {
                                label: '(C1515)葡萄酒制造'
                            },
                            {
                                label: '(C1519)其他酒制造'
                            },
                        ]
                    },
                    {
                        label: '(C152)饮料制造',
                        children: [
                            {
                                label: '(C1521)碳酸饮料制造'
                            },
                            {
                                label: '(C1522)瓶（罐）装饮用水制造'
                            },
                            {
                                label: '(C1523)果菜汁及果菜汁饮料制造'
                            },
                            {
                                label: '(C1524)含乳饮料和植物蛋白饮料制造'
                            },
                            {
                                label: '(C1525)固体饮料制造'
                            },
                            {
                                label: '(C1529)茶饮料及其他饮料制造'
                            },
                        ]
                    },
                    {
                        label: '(C1530)精制茶加工'
                    },
                ]
            },
            {
                label: '(C16)烟草制品业',
                children: [
                    {
                        label: '(C1610)烟叶复烤'
                    },
                    {
                        label: '(C1620)卷烟制造'
                    },
                    {
                        label: '(C1690)其他烟草制品制造'
                    },
                ]
            },
            {
                label: '(C17)纺织业',
                children: [
                    {
                        label: '(C171)棉纺织及印染精加工',
                        children: [
                            {
                                label: '(C1711)棉纺纱加工'
                            },
                            {
                                label: '(C1712)棉织造加工'
                            },
                            {
                                label: '(C1713)棉印染精加工'
                            },
                        ]
                    },
                    {
                        label: '(C172)毛纺织及染整精加工',
                        children: [
                            {
                                label: '(C1721)毛条和毛纱线加工'
                            },
                            {
                                label: '(C1722)毛织造加工'
                            },
                            {
                                label: '(C1723)毛染整精加工'
                            },
                        ]
                    },
                    {
                        label: '(C173)麻纺织及染整精加工',
                        children: [
                            {
                                label: '(C1731)麻纤维纺前加工和纺纱'
                            },
                            {
                                label: '(C1732)麻织造加工'
                            },
                            {
                                label: '(C1733)麻染整精加工'
                            },
                        ]
                    },
                    {
                        label: '(C174)丝绢纺织及印染精加工',
                        children: [
                            {
                                label: '(C1741)缫丝加工'
                            },
                            {
                                label: '(C1742)绢纺和丝织加工'
                            },
                            {
                                label: '(C1743)丝印染精加工'
                            },
                        ]
                    },
                    {
                        label: '(C175)化纤织造及印染精加工',
                        children: [
                            {
                                label: '(C1751)化纤织造加工'
                            },
                            {
                                label: '(C1752)化纤织物染整精加工'
                            },
                        ]
                    },
                    {
                        label: '(C176)针织或钩针编织物及其制品制造',
                        children: [
                            {
                                label: '(C1761)针织或钩针编织物织造'
                            },
                            {
                                label: '(C1762)针织或钩针编织物印染精加工'
                            },
                            {
                                label: '(C1763)针织或钩针编织品制造'
                            },
                        ]
                    },
                    {
                        label: '(C177)家用纺织制成品制造',
                        children: [
                            {
                                label: '(C1771)床上用品制造'
                            },
                            {
                                label: '(C1772)毛巾类制品制造'
                            },
                            {
                                label: '(C1773)窗帘、布艺类产品制造'
                            },
                            {
                                label: '(C1779)其他家用纺织制成品制造'
                            },
                        ]
                    },
                    {
                        label: '(C178)非家用纺织制成品制造',
                        children: [
                            {
                                label: '(C1781)非织造布制造'
                            },
                            {
                                label: '(C1782)绳、索、缆制造'
                            },
                            {
                                label: '(C1783)纺织带和帘子布制造'
                            },
                            {
                                label: '(C1784)篷、帆布制造'
                            },
                            {
                                label: '(C1789)其他非家用纺织制成品制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C18)纺织服装、服饰业',
                children: [
                    {
                        label: '(C1810)机织服装制造'
                    },
                    {
                        label: '(C1820)针织或钩针编织服装制造'
                    },
                    {
                        label: '(C1830)服饰制造'
                    },
                ]
            },
            {
                label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
                children: [
                    {
                        label: '(C1910)皮革鞣制加工'
                    },
                    {
                        label: '(C192)皮革制品制造',
                        children: [
                            {
                                label: '(C1921)皮革服装制造'
                            },
                            {
                                label: '(C1922)皮箱、包（袋）制造'
                            },
                            {
                                label: '(C1923)皮手套及皮装饰制品制造'
                            },
                            {
                                label: '(C1929)其他皮革制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C193)毛皮鞣制及制品加工',
                        children: [
                            {
                                label: '(C1931)毛皮鞣制加工'
                            },
                            {
                                label: '(C1932)毛皮服装加工'
                            },
                            {
                                label: '(C1939)其他毛皮制品加工'
                            },

                        ]
                    },
                    {
                        label: '(C194)羽毛(绒)加工及制品制造',
                        children: [
                            {
                                label: '(C1941)羽毛（绒）加工'
                            },
                            {
                                label: '(C1942)羽毛（绒）制品加工'
                            },
                        ]
                    },
                    {
                        label: '(C195)制鞋业',
                        children: [
                            {
                                label: '(C1951)纺织面料鞋制造'
                            },
                            {
                                label: '(C1952)皮鞋制造'
                            },
                            {
                                label: '(C1953)塑料鞋制造'
                            },
                            {
                                label: '(C1954)橡胶鞋制造'
                            },
                            {
                                label: '(C1959)其他制鞋业'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C20)木材加工和木、竹、藤、棕、草制品业',
                children: [
                    {
                        label: '(C201)木材加工',
                        children: [
                            {
                                label: '(C2011)锯材加工'
                            },
                            {
                                label: '(C2012)木片加工'
                            },
                            {
                                label: '(C2013)单板加工'
                            },
                            {
                                label: '(C2019)其他木材加工'
                            },
                        ]
                    },
                    {
                        label: '(C202)人造板制造',
                        children: [
                            {
                                label: '(C2021)胶合板制造'
                            },
                            {
                                label: '(C2022)纤维板制造'
                            },
                            {
                                label: '(C2023)刨花板制造'
                            },
                            {
                                label: '(C2029)其他人造板制造'
                            },
                        ]
                    },
                    {
                        label: '(C203)木制品制造',
                        children: [
                            {
                                label: '(C2031)建筑用木料及木材组件加工'
                            },
                            {
                                label: '(C2032)木门窗、楼梯制造'
                            },
                            {
                                label: '(C2033)地板制造'
                            },
                            {
                                label: '(C2034)木制容器制造'
                            },
                            {
                                label: '(C2039)软木制品及其他木制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C204)竹、藤、棕、草等制品制造',
                        children: [
                            {
                                label: '(C2041)竹制品制造'
                            },
                            {
                                label: '(C2042)藤制品制造'
                            },
                            {
                                label: '(C2043)棕制品制造'
                            },
                            {
                                label: '(C2049)草及其他制品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C21)家具制造业',
                children: [
                    {
                        label: '(C2110)木质家具制造'
                    },
                    {
                        label: '(C2120)竹、藤家具制造'
                    },
                    {
                        label: '(C2130)金属家具制造'
                    },
                    {
                        label: '(C2140)塑料家具制造'
                    },
                    {
                        label: '(C2190)其他家具制造'
                    },
                ]
            },
            {
                label: '(C22)造纸和纸制品业',
                children: [
                    {
                        label: '(C221)纸浆制造',
                        children: [
                            {
                                label: '(C2211)木竹浆制造'
                            },
                            {
                                label: '(C2212)非木竹浆制造'
                            },
                        ]
                    },
                    {
                        label: '(C222)造纸',
                        children: [
                            {
                                label: '(C2221)机制纸及纸板制造'
                            },
                            {
                                label: '(C2222)手工纸制造'
                            },
                            {
                                label: '(C2223)加工纸制造'
                            },
                        ]
                    },
                    {
                        label: '(C223)纸制品制造',
                        children: [
                            {
                                label: '(C2231)纸和纸板容器制造'
                            },
                            {
                                label: '(C2239)其他纸制品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C23)印刷和记录媒介复制业',
                children: [
                    {
                        label: '(C231)印刷',
                        children: [
                            {
                                label: '(C2311)书、报刊印刷'
                            },
                            {
                                label: '(C2312)本册印制'
                            },
                            {
                                label: '(C2319)包装装潢及其他印刷'
                            },
                        ]
                    },
                    {
                        label: '(C2320)装订及印刷相关服务'
                    },
                    {
                        label: '(C2330)记录媒介复制'
                    },
                ]
            },
            {
                label: '(C24)文教、工美、体育和娱乐用品制造业',
                children: [
                    {
                        label: '(C241)文教办公用品制造',
                        children: [
                            {
                                label: '(C2411)文具制造'
                            },
                            {
                                label: '(C2412)笔的制造'
                            },
                            {
                                label: '(C2413)教学用模型及教具制造'
                            },
                            {
                                label: '(C2414)墨水、墨汁制造'
                            },
                            {
                                label: '(C2419)其他文教办公用品制造'
                            },
                        ]
                    },
                    {
                        label: '(C242)乐器制造',
                        children: [
                            {
                                label: '(C2421)中乐器制造'
                            },
                            {
                                label: '(C2422)西乐器制造'
                            },
                            {
                                label: '(C2423)电子乐器制造'
                            },
                            {
                                label: '(C2429)其他乐器及零件制造'
                            },
                        ]
                    },
                    {
                        label: '(C243)工艺美术品制造',
                        children: [
                            {
                                label: '(C2431)雕塑工艺品制造'
                            },
                            {
                                label: '(C2432)金属工艺品制造'
                            },
                            {
                                label: '(C2433)漆器工艺品制造'
                            },
                            {
                                label: '(C2434)花画工艺品制造'
                            },
                            {
                                label: '(C2435)天然植物纤维编织工艺品制造'
                            },
                            {
                                label: '(C2436)抽纱刺绣工艺品制造'
                            },
                            {
                                label: '(C2437)地毯、挂毯制造'
                            },
                            {
                                label: '(C2438)珠宝首饰及有关物品制造'
                            },
                            {
                                label: '(C2439)其他工艺美术品制造'
                            },
                        ]
                    },
                    {
                        label: '(C244)体育用品制造',
                        children: [
                            {
                                label: '(C2441)球类制造'
                            },
                            {
                                label: '(C2442)体育器材及配件制造'
                            },
                            {
                                label: '(C2443)训练健身器材制造'
                            },
                            {
                                label: '(C2444)运动防护用具制造'
                            },
                            {
                                label: '(C2449)其他体育用品制造'
                            },
                        ]
                    },
                    {
                        label: '(C2450)玩具制造',
                    },
                    {
                        label: '(C246)游艺器材及娱乐用品制造',
                        children: [
                            {
                                label: '(C2461)露天游乐场所游乐设备制造'
                            },
                            {
                                label: '(C2462)游艺用品及室内游艺器材制造'
                            },
                            {
                                label: '(C2469)其他娱乐用品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C25)石油加工、炼焦和核燃料加工业',
                children: [
                    {
                        label: '(C251)精炼石油产品制造',
                        children: [
                            {
                                label: '(C2511)原油加工及石油制品制造'
                            },
                            {
                                label: '(C2512)人造原油制造'
                            },
                        ]
                    },
                    {
                        label: '(C2520)炼焦'
                    },
                    {
                        label: '(C2530)核燃料加工'
                    }
                ]
            },
            {
                label: '(C26)化学原料和化学制品制造业',
                children: [
                    {
                        label: '(C261)基础化学原料制造',
                        children: [
                            {
                                label: '(C2611)无机酸制造'
                            },
                            {
                                label: '(C2612)无机碱制造'
                            },
                            {
                                label: '(C2613)无机盐制造'
                            },
                            {
                                label: '(C2614)有机化学原料制造'
                            },
                            {
                                label: '(C2619)其他基础化学原料制造'
                            },
                        ]
                    },
                    {
                        label: '(C262)肥料制造',
                        children: [
                            {
                                label: '(C2621)氮肥制造'
                            },
                            {
                                label: '(C2622)磷肥制造'
                            },
                            {
                                label: '(C2623)钾肥制造'
                            },
                            {
                                label: '(C2624)复混肥料制造'
                            },
                            {
                                label: '(C2625)有机肥料及微生物肥料制造'
                            },
                            {
                                label: '(C2629)其他肥料制造'
                            },
                        ]
                    },
                    {
                        label: '(C263)农药制造',
                        children: [
                            {
                                label: '(C2631)化学农药制造'
                            },
                            {
                                label: '(C2632)生物化学农药及微生物农药制造'
                            },
                        ]
                    },
                    {
                        label: '(C264)涂料、油墨、颜料及类似产品制造',
                        children: [
                            {
                                label: '(C2641)涂料制造'
                            },
                            {
                                label: '(C2642)油墨及类似产品制造'
                            },
                            {
                                label: '(C2643)颜料制造'
                            },
                            {
                                label: '(C2644)染料制造'
                            },
                            {
                                label: '(C2645)密封用填料及类似品制造'
                            },
                        ]
                    },
                    {
                        label: '(C265)合成材料制造',
                        children: [
                            {
                                label: '(C2651)初级形态塑料及合成树脂制造'
                            },
                            {
                                label: '(C2652)合成橡胶制造'
                            },
                            {
                                label: '(C2653)合成纤维单（聚合）体制造'
                            },
                            {
                                label: '(C2659)其他合成材料制造'
                            },
                        ]
                    },
                    {
                        label: '(C266)专用化学产品制造',
                        children: [
                            {
                                label: '(C2661)化学试剂和助剂制造'
                            },
                            {
                                label: '(C2662)专项化学用品制造'
                            },
                            {
                                label: '(C2663)林产化学产品制造'
                            },
                            {
                                label: '(C2664)信息化学品制造'
                            },
                            {
                                label: '(C2665)环境污染处理专用药剂材料制造'
                            },
                            {
                                label: '(C2666)动物胶制造'
                            },
                            {
                                label: '(C2669)其他专用化学产品制造'
                            },
                        ]
                    },
                    {
                        label: '(C267)炸药、火工及焰火产品制造',
                        children: [
                            {
                                label: '(C2671)炸药及火工产品制造'
                            },
                            {
                                label: '(C2672)焰火、鞭炮产品制造'
                            },
                        ]
                    },
                    {
                        label: '(C268)日用化学产品制造',
                        children: [
                            {
                                label: '(C2681)肥皂及合成洗涤剂制造'
                            },
                            {
                                label: '(C2682)化妆品制造'
                            },
                            {
                                label: '(C2683)口腔清洁用品制造'
                            },
                            {
                                label: '(C2684)香料、香精制造'
                            },
                            {
                                label: '(C2689)其他日用化学产品制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C27)医药制造业',
                children: [
                    {
                        label: '(C2710)化学药品原料药制造'
                    },
                    {
                        label: '(C2720)化学药品制剂制造'
                    },
                    {
                        label: '(C2730)中药饮片加工'
                    },
                    {
                        label: '(C2740)中成药生产'
                    },
                    {
                        label: '(C2750)兽用药品制造'
                    },
                    {
                        label: '(C2760)生物药品制造'
                    },
                    {
                        label: '(C2770)卫生材料及医药用品制造'
                    },
                ]
            },
            {
                label: '(C28)化学纤维制造业',
                children: [
                    {
                        label: '(C281)纤维素纤维原料及纤维制造',
                        children: [
                            {
                                label: '(C2811)化纤浆粕制造'
                            },
                            {
                                label: '(C2812)人造纤维（纤维素纤维）制造'
                            },
                        ]
                    },
                    {
                        label: '(C282)合成纤维制造',
                        children: [
                            {
                                label: '(C2821)锦纶纤维制造'
                            },
                            {
                                label: '(C2822)涤纶纤维制造'
                            },
                            {
                                label: '(C2823)腈纶纤维制造'
                            },
                            {
                                label: '(C2824)维纶纤维制造'
                            },
                            {
                                label: '(C2825)丙纶纤维制造'
                            },
                            {
                                label: '(C2826)氨纶纤维制造'
                            },
                            {
                                label: '(C2829)其他合成纤维制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C29)橡胶和塑料制品业',
                children: [
                    {
                        label: '(C291)橡胶制品业',
                        children: [
                            {
                                label: '(C2911)轮胎制造'
                            },
                            {
                                label: '(C2912)橡胶板、管、带制造'
                            },
                            {
                                label: '(C2913)橡胶零件制造'
                            },
                            {
                                label: '(C2914)再生橡胶制造'
                            },
                            {
                                label: '(C2915)日用及医用橡胶制品制造'
                            },
                            {
                                label: '(C2919)其他橡胶制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C292)塑料制品业',
                        children: [
                            {
                                label: '(C2921)塑料薄膜制造'
                            },
                            {
                                label: '(C2922)塑料板、管、型材制造'
                            },
                            {
                                label: '(C2923)塑料丝、绳及编织品制造'
                            },
                            {
                                label: '(C2924)泡沫塑料制造'
                            },
                            {
                                label: '(C2925)塑料人造革、合成革制造'
                            },
                            {
                                label: '(C2926)塑料包装箱及容器制造'
                            },
                            {
                                label: '(C2927)日用塑料制品制造'
                            },
                            {
                                label: '(C2928)塑料零件制造'
                            },
                            {
                                label: '(C2929)其他塑料制品制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C30)非金属矿物制品业',
                children: [
                    {
                        label: '(C301)水泥、石灰和石膏制造',
                        children: [
                            {
                                label: '(C3011)水泥制造'
                            }, {
                                label: '(C3012)石灰和石膏制造'
                            },
                        ]
                    },
                    {
                        label: '(C302)石膏、水泥制品及类似制品制造',
                        children: [
                            {
                                label: '(C3021)水泥制品制造'
                            },
                            {
                                label: '(C3022)砼结构构件制造'
                            },
                            {
                                label: '(C3023)石棉水泥制品制造'
                            },
                            {
                                label: '(C3024)轻质建筑材料制造'
                            },
                            {
                                label: '(C3029)其他水泥类似制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C303)砖瓦、石材等建筑材料制造',
                        children: [
                            {
                                label: '(C3031)粘土砖瓦及建筑砌块制造'
                            },
                            {
                                label: '(C3032)建筑陶瓷制品制造'
                            },
                            {
                                label: '(C3033)建筑用石加工'
                            },
                            {
                                label: '(C3034)防水建筑材料制造'
                            },
                            {
                                label: '(C3035)隔热和隔音材料制造'
                            },
                            {
                                label: '(C3039)其他建筑材料制造'
                            },
                        ]
                    },
                    {
                        label: '(C304)玻璃制造',
                        children: [
                            {
                                label: '(C3041)平板玻璃制造'
                            },
                            {
                                label: '(C3049)其他玻璃制造'
                            },
                        ]
                    },
                    {
                        label: '(C305)玻璃制品制造',
                        children: [
                            {
                                label: '(C3051)技术玻璃制品制造'
                            }, {
                                label: '(C3052)光学玻璃制造'
                            },
                            {
                                label: '(C3053)玻璃仪器制造'
                            },
                            {
                                label: '(C3054)日用玻璃制品制造'
                            },
                            {
                                label: '(C3055)玻璃包装容器制造'
                            },
                            {
                                label: '(C3056)玻璃保温容器制造'
                            },
                            {
                                label: '(C3057)制镜及类似品加工'
                            },
                            {
                                label: '(C3059)其他玻璃制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C306)玻璃纤维和玻璃纤维增强塑料制品制造',
                        children: [
                            {
                                label: '(C3061)玻璃纤维及制品制造'
                            },
                            {
                                label: '(C3062)玻璃纤维增强塑料制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C307)陶瓷制品制造',
                        children: [
                            {
                                label: '(C3071)卫生陶瓷制品制造'
                            },
                            {
                                label: '(C3072)特种陶瓷制品制造'
                            },
                            {
                                label: '(C3073)日用陶瓷制品制造'
                            },
                            {
                                label: '(C3079)园林、陈设艺术及其他陶瓷制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C308)耐火材料制品制造',
                        children: [
                            {
                                label: '(C3081)石棉制品制造'
                            },
                            {
                                label: '(C3082)云母制品制造'
                            },
                            {
                                label: '(C3089)耐火陶瓷制品及其他耐火材料制造'
                            },
                        ]
                    },
                    {
                        label: '(C309)石墨及其他非金属矿物制品制造',
                        children: [
                            {
                                label: '(C3091)石墨及碳素制品制造'
                            },
                            {
                                label: '(C3099)其他非金属矿物制品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C31)黑色金属冶炼和压延加工业',
                children: [
                    {
                        label: '(C3110)炼铁'
                    },
                    {
                        label: '(C3120)炼钢'
                    },
                    {
                        label: '(C3130)黑色金属铸造'
                    },
                    {
                        label: '(C3140)钢压延加工'
                    },
                    {
                        label: '(C3150)铁合金冶炼'
                    },
                ]
            },
            {
                label: '(C32)有色金属冶炼和压延加工业',
                children: [
                    {
                        label: '(C321)常用有色金属冶炼',
                        children: [
                            {
                                label: '(C3211)铜冶炼'
                            },
                            {
                                label: '(C3212)铅锌冶炼'
                            },
                            {
                                label: '(C3213)镍钴冶炼'
                            },
                            {
                                label: '(C3214)锡冶炼'
                            },
                            {
                                label: '(C3215)锑冶炼'
                            },
                            {
                                label: '(C3216)铝冶炼'
                            },
                            {
                                label: '(C3217)镁冶炼'
                            },
                            {
                                label: '(C3219)其他常用有色金属冶炼'
                            },
                        ]
                    },
                    {
                        label: '(C322)贵金属冶炼',
                        children: [
                            {
                                label: '(C3221)金冶炼'
                            },
                            {
                                label: '(C3222)银冶炼'
                            },
                            {
                                label: '(C3229)其他贵金属冶炼'
                            },
                        ]
                    },
                    {
                        label: '(C323)稀有稀土金属冶炼',
                        children: [
                            {
                                label: '(C3231)钨钼冶炼'
                            },
                            {
                                label: '(C3232)稀土金属冶炼'
                            },
                            {
                                label: '(C3239)其他稀有金属冶炼'
                            },
                        ]
                    },
                    {
                        label: '(C3240)有色金属合金制造',
                    },
                    {
                        label: '(C3250)有色金属铸造',
                    },
                    {
                        label: '(C326)有色金属压延加工',
                        children: [
                            {
                                label: '(C3261)铜压延加工'
                            },
                            {
                                label: '(C3262)铝压延加工'
                            },
                            {
                                label: '(C3263)贵金属压延加工'
                            },
                            {
                                label: '(C3264)稀有稀土金属压延加工'
                            },
                            {
                                label: '(C3269)其他有色金属压延加工'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C33)金属制品业',
                children: [
                    {
                        label: '(C331)结构性金属制品制造',
                        children: [
                            {
                                label: '(C3311)金属结构制造'
                            },
                            {
                                label: '(C3312)金属门窗制造'
                            },
                        ]
                    },
                    {
                        label: '(C332)金属工具制造',
                        children: [
                            {
                                label: '(C3321)切削工具制造'
                            },
                            {
                                label: '(C3322)手工具制造'
                            },
                            {
                                label: '(C3323)农用及园林用金属工具制造'
                            },
                            {
                                label: '(C3324)刀剪及类似日用金属工具制造'
                            },
                            {
                                label: '(C3329)其他金属工具制造'
                            },
                        ]
                    },
                    {
                        label: '(C333)集装箱及金属包装容器制造',
                        children: [
                            {
                                label: '(C3331)集装箱制造'
                            },
                            {
                                label: '(C3332)金属压力容器制造'
                            },
                            {
                                label: '(C3333)金属包装容器制造'
                            },
                        ]
                    },
                    {
                        label: '(C3340)金属丝绳及其制品制造',
                    },
                    {
                        label: '(C335)建筑、安全用金属制品制造',
                        children: [
                            {
                                label: '(C3351)建筑、家具用金属配件制造'
                            },
                            {
                                label: '(C3352)建筑装饰及水暖管道零件制造'
                            },
                            {
                                label: '(C3353)安全、消防用金属制品制造'
                            },
                            {
                                label: '(C3359)其他建筑、安全用金属制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C3360)金属表面处理及热处理加工',
                    },
                    {
                        label: '(C337)搪瓷制品制造',
                        children: [
                            {
                                label: '(C3371)生产专用搪瓷制品制造'
                            },
                            {
                                label: '(C3372)建筑装饰搪瓷制品制造'
                            },
                            {
                                label: '(C3373)搪瓷卫生洁具制造'
                            },
                            {
                                label: '(C3379)搪瓷日用品及其他搪瓷制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C338)金属制日用品制造',
                        children: [
                            {
                                label: '(C3381)金属制厨房用器具制造'
                            },
                            {
                                label: '(C3382)金属制餐具和器皿制造'
                            },
                            {
                                label: '(C3383)金属制卫生器具制造'
                            },
                            {
                                label: '(C3389)其他金属制日用品制造'
                            },
                        ]
                    },
                    {
                        label: '(C339)其他金属制品制造',
                        children: [
                            {
                                label: '(C3391)锻件及粉末冶金制品制造'
                            },
                            {
                                label: '(C3392)交通及公共管理用金属标牌制造'
                            },
                            {
                                label: '(C3399)其他未列明金属制品制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C34)通用设备制造业',
                children: [
                    {
                        label: '(C341)锅炉及原动设备制造',
                        children: [
                            {
                                label: '(C3411)锅炉及辅助设备制造'
                            },
                            {
                                label: '(C3412)内燃机及配件制造'
                            },
                            {
                                label: '(C3413)汽轮机及辅机制造'
                            },
                            {
                                label: '(C3414)水轮机及辅机制造'
                            },
                            {
                                label: '(C3415)风能原动设备制造'
                            },
                            {
                                label: '(C3419)其他原动设备制造'
                            },
                        ]
                    }, {
                        label: '(C342)金属加工机械制造',
                        children: [
                            {
                                label: '(C3421)金属切削机床制造'
                            },
                            {
                                label: '(C3422)金属成形机床制造'
                            },
                            {
                                label: '(C3423)铸造机械制造'
                            },
                            {
                                label: '(C3424)金属切割及焊接设备制造'
                            },
                            {
                                label: '(C3425)机床附件制造'
                            },
                            {
                                label: '(C3429)其他金属加工机械制造'
                            },
                        ]
                    },
                    {
                        label: '(C343)物料搬运设备制造',
                        children: [
                            {
                                label: '(C3431)轻小型起重设备制造'
                            },
                            {
                                label: '(C3432)起重机制造'
                            },
                            {
                                label: '(C3433)生产专用车辆制造'
                            },
                            {
                                label: '(C3434)连续搬运设备制造'
                            },
                            {
                                label: '(C3435)电梯、自动扶梯及升降机制造'
                            },
                            {
                                label: '(C3439)其他物料搬运设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C344)泵、阀门、压缩机及类似机械制造',
                        children: [
                            {
                                label: '(C3441)泵及真空设备制造'
                            },
                            {
                                label: '(C3442)气体压缩机械制造'
                            },
                            {
                                label: '(C3443)阀门和旋塞制造'
                            },
                            {
                                label: '(C3444)液压和气压动力机械及元件制造'
                            },
                        ]
                    },
                    {
                        label: '(C345)轴承、齿轮和传动部件制造',
                        children: [
                            {
                                label: '(C3451)轴承制造'
                            },
                            {
                                label: '(C3452)齿轮及齿轮减、变速箱制造'
                            },
                            {
                                label: '(C3459)其他传动部件制造'
                            },
                        ]
                    },
                    {
                        label: '(C346)烘炉、风机、衡器、包装等设备制造',
                        children: [
                            {
                                label: '(C3461)烘炉、熔炉及电炉制造'
                            },
                            {
                                label: '(C3462)风机、风扇制造'
                            },
                            {
                                label: '(C3463)气体、液体分离及纯净设备制造'
                            },
                            {
                                label: '(C3464)制冷、空调设备制造'
                            },
                            {
                                label: '(C3465)风动和电动工具制造'
                            },
                            {
                                label: '(C3466)喷枪及类似器具制造'
                            },
                            {
                                label: '(C3467)衡器制造'
                            },
                            {
                                label: '(C3468)包装专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C347)文化、办公用机械制造',
                        children: [
                            {
                                label: '(C3471)电影机械制造'
                            },
                            {
                                label: '(C3472)幻灯及投影设备制造'
                            },
                            {
                                label: '(C3473)照相机及器材制造'
                            },
                            {
                                label: '(C3474)复印和胶印设备制造'
                            },
                            {
                                label: '(C3475)计算器及货币专用设备制造'
                            },
                            {
                                label: '(C3479)其他文化、办公用机械制造'
                            },
                        ]
                    },
                    {
                        label: '(C348)通用零部件制造',
                        children: [
                            {
                                label: '(C3481)金属密封件制造'
                            },
                            {
                                label: '(C3482)紧固件制造'
                            },
                            {
                                label: '(C3483)弹簧制造'
                            },
                            {
                                label: '(C3484)机械零部件加工'
                            },
                            {
                                label: '(C3489)其他通用零部件制造'
                            },

                        ]
                    },
                    {
                        label: '(C3490)其他通用设备制造业',
                    },
                ]
            },
            {
                label: '(C35)专用设备制造业',
                children: [
                    {
                        label: '(C351)采矿、冶金、建筑专用设备制造',
                        children: [
                            {
                                label: '(C3511)矿山机械制造'
                            },
                            {
                                label: '(C3512)石油钻采专用设备制造'
                            },
                            {
                                label: '(C3513)建筑工程用机械制造'
                            },
                            {
                                label: '(C3514)海洋工程专用设备制造'
                            },
                            {
                                label: '(C3515)建筑材料生产专用机械制造'
                            },
                            {
                                label: '(C3516)冶金专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C352)化工、木材、非金属加工专用设备制造',
                        children: [
                            {
                                label: '(C3521)炼油、化工生产专用设备制造'
                            },
                            {
                                label: '(C3522)橡胶加工专用设备制造'
                            },
                            {
                                label: '(C3523)塑料加工专用设备制造'
                            },
                            {
                                label: '(C3524)木材加工机械制造'
                            },
                            {
                                label: '(C3525)模具制造'
                            },
                            {
                                label: '(C3529)其他非金属加工专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C353)食品、饮料、烟草及饲料生产专用设备制造',
                        children: [
                            {
                                label: '(C3531)食品、酒、饮料及茶生产专用设备制造'
                            },
                            {
                                label: '(C3532)农副食品加工专用设备制造'
                            },
                            {
                                label: '(C3533)烟草生产专用设备制造'
                            },
                            {
                                label: '(C3534)饲料生产专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C354)印刷、制药、日化及日用品生产专用设备制造',
                        children: [
                            {
                                label: '(C3541)制浆和造纸专用设备制造'
                            },
                            {
                                label: '(C3542)印刷专用设备制造'
                            },
                            {
                                label: '(C3543)日用化工专用设备制造'
                            },
                            {
                                label: '(C3544)制药专用设备制造'
                            },
                            {
                                label: '(C3545)照明器具生产专用设备制造'
                            },
                            {
                                label: '(C3546)玻璃、陶瓷和搪瓷制品生产专用设备制造'
                            },
                            {
                                label: '(C3549)其他日用品生产专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C355)纺织、服装和皮革加工专用设备制造',
                        children: [
                            {
                                label: '(C3551)纺织专用设备制造'
                            },
                            {
                                label: '(C3552)皮革、毛皮及其制品加工专用设备制造'
                            },
                            {
                                label: '(C3553)缝制机械制造'
                            },
                            {
                                label: '(C3554)洗涤机械制造'
                            },
                        ]
                    },
                    {
                        label: '(C356)电子和电工机械专用设备制造',
                        children: [
                            {
                                label: '(C3561)电工机械专用设备制造'
                            },
                            {
                                label: '(C3562)电子工业专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C357)农、林、牧、渔专用机械制造',
                        children: [
                            {
                                label: '(C3571)拖拉机制造'
                            },
                            {
                                label: '(C3572)机械化农业及园艺机具制造'
                            },
                            {
                                label: '(C3573)营林及木竹采伐机械制造'
                            },
                            {
                                label: '(C3574)畜牧机械制造'
                            },
                            {
                                label: '(C3575)渔业机械制造'
                            },
                            {
                                label: '(C3576)农林牧渔机械配件制造'
                            },
                            {
                                label: '(C3577)棉花加工机械制造'
                            },
                            {
                                label: '(C3579)其他农、林、牧、渔业机械制造'
                            },
                        ]
                    },
                    {
                        label: '(C358)医疗仪器设备及器械制造',
                        children: [
                            {
                                label: '(C3581)医疗诊断、监护及治疗设备制造'
                            },
                            {
                                label: '(C3582)口腔科用设备及器具制造'
                            },
                            {
                                label: '(C3583)医疗实验室及医用消毒设备和器具制造'
                            },
                            {
                                label: '(C3584)医疗、外科及兽医用器械制造'
                            },
                            {
                                label: '(C3585)机械治疗及病房护理设备制造'
                            },
                            {
                                label: '(C3586)假肢、人工器官及植（介）入器械制造'
                            },
                            {
                                label: '(C3589)其他医疗设备及器械制造'
                            }
                        ]
                    },
                    {
                        label: '(C359)环保、社会公共服务及其他专用设备制造',
                        children: [
                            {
                                label: '(C3591)环境保护专用设备制造'
                            },
                            {
                                label: '(C3592)地质勘查专用设备制造'
                            },
                            {
                                label: '(C3593)邮政专用机械及器材制造'
                            },
                            {
                                label: '(C3594)商业、饮食、服务专用设备制造'
                            },
                            {
                                label: '(C3595)社会公共安全设备及器材制造'
                            },
                            {
                                label: '(C3596)交通安全、管制及类似专用设备制造'
                            },
                            {
                                label: '(C3597)水资源专用机械制造'
                            },
                            {
                                label: '(C3599)其他专用设备制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C36)汽车制造业',
                children: [
                    {
                        label: '(C3610)汽车整车制造'
                    },
                    {
                        label: '(C3620)改装汽车制造'
                    },
                    {
                        label: '(C3630)低速载货汽车制造'
                    },
                    {
                        label: '(C3640)电车制造'
                    }, {
                        label: '(C3650)汽车车身、挂车制造'
                    },
                    {
                        label: '(C3660)汽车零部件及配件制造'
                    },
                ]
            },
            {
                label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
                children: [
                    {
                        label: '(C371)铁路运输设备制造',
                        children: [
                            {
                                label: '(C3711)铁路机车车辆及动车组制造'
                            },
                            {
                                label: '(C3712)窄轨机车车辆制造'
                            },
                            {
                                label: '(C3713)铁路机车车辆配件制造'
                            },
                            {
                                label: '(C3714)铁路专用设备及器材、配件制造'
                            },
                            {
                                label: '(C3719)其他铁路运输设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C3720)城市轨道交通设备制造',
                    },
                    {
                        label: '(C373)船舶及相关装置制造',
                        children: [
                            {
                                label: '(C3731)金属船舶制造'
                            },
                            {
                                label: '(C3732)非金属船舶制造'
                            },
                            {
                                label: '(C3733)娱乐船和运动船制造'
                            },
                            {
                                label: '(C3734)船用配套设备制造'
                            },
                            {
                                label: '(C3735)船舶改装与拆除'
                            },
                            {
                                label: '(C3739)航标器材及其他相关装置制造'
                            },

                        ]
                    },
                    {
                        label: '(C374)航空、航天器及设备制造',
                        children: [
                            {
                                label: '(C3741)飞机制造'
                            },
                            {
                                label: '(C3742)航天器制造'
                            },
                            {
                                label: '(C3743)航空、航天相关设备制造'
                            },
                            {
                                label: '(C3749)其他航空航天器制造'
                            },
                        ]
                    },
                    {
                        label: '(C375)摩托车制造',
                        children: [
                            {
                                label: '(C3751)摩托车整车制造'
                            },
                            {
                                label: '(C3752)摩托车零部件及配件制造'
                            },
                        ]
                    },
                    {
                        label: '(C376)自行车制造',
                        children: [
                            {
                                label: '(C3761)脚踏自行车及残疾人座车制造'
                            },
                            {
                                label: '(C3762)助动自行车制造'
                            },
                        ]
                    },
                    {
                        label: '(C3770)非公路休闲车及零配件制造',
                    },
                    {
                        label: '(C379)潜水救捞及其他未列明运输设备制造',
                        children: [
                            {
                                label: '(C3791)潜水及水下救捞装备制造'
                            },
                            {
                                label: '(C3799)其他未列明运输设备制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C38)电气机械和器材制造业',
                children: [
                    {
                        label: '(C381)电机制造',
                        children: [
                            {
                                label: '(C3811)发电机及发电机组制造'
                            },
                            {
                                label: '(C3812)电动机制造'
                            },
                            {
                                label: '(C3819)微电机及其他电机制造'
                            },
                        ]
                    },
                    {
                        label: '(C382)输配电及控制设备制造',
                        children: [
                            {
                                label: '(C3821)变压器、整流器和电感器制造'
                            },
                            {
                                label: '(C3822)电容器及其配套设备制造'
                            },
                            {
                                label: '(C3823)配电开关控制设备制造'
                            },
                            {
                                label: '(C3824)电力电子元器件制造'
                            },
                            {
                                label: '(C3825)光伏设备及元器件制造'
                            },
                            {
                                label: '(C3829)其他输配电及控制设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C383)电线、电缆、光缆及电工器材制造',
                        children: [
                            {
                                label: '(C3831)电线、电缆制造'
                            },
                            {
                                label: '(C3832)光纤、光缆制造'
                            },
                            {
                                label: '(C3833)绝缘制品制造'
                            },
                            {
                                label: '(C3839)其他电工器材制造'
                            },
                        ]
                    },
                    {
                        label: '(C384)电池制造',
                        children: [
                            {
                                label: '(C3841)锂离子电池制造'
                            },
                            {
                                label: '(C3842)镍氢电池制造'
                            },
                            {
                                label: '(C3849)其他电池制造'
                            },
                        ]
                    },
                    {
                        label: '(C385)家用电力器具制造',
                        children: [
                            {
                                label: '(C3851)家用制冷电器具制造'
                            },
                            {
                                label: '(C3852)家用空气调节器制造'
                            },
                            {
                                label: '(C3853)家用通风电器具制造'
                            },
                            {
                                label: '(C3854)家用厨房电器具制造'
                            }, {
                                label: '(C3855)家用清洁卫生电器具制造'
                            },
                            {
                                label: '(C3856)家用美容、保健电器具制造'
                            },
                            {
                                label: '(C3857)家用电力器具专用配件制造'
                            },
                            {
                                label: '(C3859)其他家用电力器具制造'
                            },
                        ]
                    },
                    {
                        label: '(C386)非电力家用器具制造',
                        children: [
                            {
                                label: '(C3861)燃气、太阳能及类似能源家用器具制造'
                            },
                            {
                                label: '(C3869)其他非电力家用器具制造'
                            },
                        ]
                    },
                    {
                        label: '(C387)照明器具制造',
                        children: [
                            {
                                label: '(C3871)电光源制造'
                            },
                            {
                                label: '(C3872)照明灯具制造'
                            },
                            {
                                label: '(C3879)灯用电器附件及其他照明器具制造'
                            },
                        ]
                    },
                    {
                        label: '(C389)其他电气机械及器材制造',
                        children: [
                            {
                                label: '(C3891)电气信号设备装置制造'
                            },
                            {
                                label: '(C3899)其他未列明电气机械及器材制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C39)计算机、通信和其他电子设备制造业',
                children: [
                    {
                        label: '(C391)计算机制造',
                        children: [
                            {
                                label: '(C3911)计算机整机制造'
                            },
                            {
                                label: '(C3912)计算机零部件制造'
                            },
                            {
                                label: '(C3913)计算机外围设备制造'
                            },
                            {
                                label: '(C3919)其他计算机制造'
                            },
                        ]
                    },
                    {
                        label: '(C392)通信设备制造',
                        children: [
                            {
                                label: '(C3921)通信系统设备制造'
                            },
                            {
                                label: '(C3922)通信终端设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C393)广播电视设备制造',
                        children: [
                            {
                                label: '(C3931)广播电视节目制作及发射设备制造'
                            },
                            {
                                label: '(C3932)广播电视接收设备及器材制造'
                            },
                            {
                                label: '(C3939)应用电视设备及其他广播电视设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C3940)雷达及配套设备制造',
                    },
                    {
                        label: '(C395)视听设备制造',
                        children: [
                            {
                                label: '(C3951)电视机制造'
                            },
                            {
                                label: '(C3952)音响设备制造'
                            },
                            {
                                label: '(C3953)影视录放设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C396)电子器件制造',
                        children: [
                            {
                                label: '(C3961)电子真空器件制造'
                            },
                            {
                                label: '(C3962)半导体分立器件制造'
                            },
                            {
                                label: '(C3963)集成电路制造'
                            },
                            {
                                label: '(C3969)光电子器件及其他电子器件制造'
                            },
                        ]
                    },
                    {
                        label: '(C397)电子元件制造',
                        children: [
                            {
                                label: '(C3971)电子元件及组件制造'
                            },
                            {
                                label: '(C3972)印制电路板制造'
                            },
                        ]
                    },
                    {
                        label: '(C3990)其他电子设备制造',
                    },

                ]
            },
            {
                label: '(C40)仪器仪表制造业',
                children: [
                    {
                        label: '(C401)通用仪器仪表制造',
                        children: [
                            {
                                label: '(C4011)工业自动控制系统装置制造'
                            },
                            {
                                label: '(C4012)电工仪器仪表制造'
                            },
                            {
                                label: '(C4013)绘图、计算及测量仪器制造'
                            },
                            {
                                label: '(C4014)实验分析仪器制造'
                            },
                            {
                                label: '(C4015)试验机制造'
                            },
                            {
                                label: '(C4019)供应用仪表及其他通用仪器制造'
                            },
                        ]
                    },
                    {
                        label: '(C402)专用仪器仪表制造',
                        children: [
                            {
                                label: '(C4021)环境监测专用仪器仪表制造'
                            },
                            {
                                label: '(C4022)运输设备及生产用计数仪表制造'
                            },
                            {
                                label: '(C4023)导航、气象及海洋专用仪器制造'
                            },
                            {
                                label: '(C4024)农林牧渔专用仪器仪表制造'
                            },
                            {
                                label: '(C4025)地质勘探和地震专用仪器制造'
                            },
                            {
                                label: '(C4026)教学专用仪器制造'
                            },
                            {
                                label: '(C4027)核子及核辐射测量仪器制造'
                            },
                            {
                                label: '(C4028)电子测量仪器制造'
                            },
                            {
                                label: '(C4029)其他专用仪器制造'
                            },
                        ]
                    },
                    {
                        label: '(C4030)钟表与计时仪器制造',
                    },
                    {
                        label: '(C404)光学仪器及眼镜制造',
                        children: [
                            {
                                label: '(C4041)光学仪器制造'
                            },
                            {
                                label: '(C4042)眼镜制造'
                            },
                        ]
                    },
                    {
                        label: '(C4090)其他仪器仪表制造业',
                    },
                ]
            },
            {
                label: '(C41)其他制造业',
                children: [
                    {
                        label: '(C411)日用杂品制造',
                        children: [
                            {
                                label: '(C4111)鬃毛加工、制刷及清扫工具制造'
                            },
                            {
                                label: '(C4119)其他日用杂品制造'
                            },
                        ]
                    },
                    {
                        label: '(C4120)煤制品制造'
                    },
                    {
                        label: '(C4130)核辐射加工'
                    },
                    {
                        label: '(C4190)其他未列明制造业'
                    },

                ]
            },
            {
                label: '(C42)废弃资源综合利用业',
                children: [
                    {
                        label: '(C4210)金属废料和碎屑加工处理'
                    },
                    {
                        label: '(C4220)非金属废料和碎屑加工处理'
                    },
                ]
            },
            {
                label: '(C43)金属制品、机械和设备修理业',
                children: [
                    {
                        label: '(C4310)金属制品修理'
                    },
                    {
                        label: '(C4320)通用设备修理'
                    },
                    {
                        label: '(C4330)专用设备修理'
                    },
                    {
                        label: '(C434)铁路、船舶、航空航天等运输设备修理',
                        children: [
                            {
                                label: '(C4341)铁路运输设备修理'
                            },
                            {
                                label: '(C4342)船舶修理'
                            },
                            {
                                label: '(C4343)航空航天器修理'
                            },
                            {
                                label: '(C4349)其他运输设备修理'
                            },
                        ]
                    },
                    {
                        label: '(C4350)电气设备修理'
                    },
                    {
                        label: '(C4360)仪器仪表修理'
                    },
                    {
                        label: '(C4390)其他机械和设备修理业'
                    },

                ]
            },
        ]
    },
    {
        label: '(D)电力、热力、燃气及水生产和供应业',
        children: [
            {
                label: '(D44)电力、热力生产和供应业',
                children: [
                    {
                        label: '(D441)电力生产',
                        children: [
                            {
                                label: '(D4411)火力发电'
                            },
                            {
                                label: '(D4412)水力发电'
                            },
                            {
                                label: '(D4413)核力发电'
                            },
                            {
                                label: '(D4414)风力发电'
                            },
                            {
                                label: '(D4415)太阳能发电'
                            },
                            {
                                label: '(D4419)其他电力生产'
                            },
                        ]
                    },
                    {
                        label: '(D4420)电力供应',
                    },
                    {
                        label: '(D4430)热力生产和供应',
                    },
                ]
            },
            {
                label: '(D45)燃气生产和供应业',
                children: [
                    {
                        label: '(D4500)燃气生产和供应业'
                    }]
            },
            {
                label: '(D46)水的生产和供应业',
                children: [
                    {
                        label: '(D4610)自来水生产和供应'
                    },
                    {
                        label: '(D4620)污水处理及其再生利用'
                    },
                    {
                        label: '(D4690)其他水的处理、利用与分配'
                    },
                ]
            }]
    },
    {
        label: '(E)建筑业',
        children: [
            {
                label: '(E47)房屋建筑业',
                children: [{
                    label: '(E4700)房屋建筑业'
                }]
            },
            {
                label: '(E48)土木工程建筑业',
                children: [
                    {
                        label: '(E481)铁路、道路、隧道和桥梁工程建筑',
                        children: [
                            {
                                label: '(E4811)铁路工程建筑'
                            },
                            {
                                label: '(E4812)公路工程建筑'
                            },
                            {
                                label: '(E4813)市政道路工程建筑'
                            },
                            {
                                label: '(E4819)其他道路、隧道和桥梁工程建筑'
                            },
                        ]
                    },
                    {
                        label: '(E482)水利和内河港口工程建筑',
                        children: [
                            {
                                label: '(E4821)水源及供水设施工程建筑'
                            },
                            {
                                label: '(E4822)河湖治理及防洪设施工程建筑'
                            },
                            {
                                label: '(E4823)港口及航运设施工程建筑'
                            },
                        ]
                    },
                    {
                        label: '(E4830)海洋工程建筑'
                    },
                    {
                        label: '(E4840)工矿工程建筑'
                    },
                    {
                        label: '(E485)架线和管道工程建筑',
                        children: [
                            {
                                label: '(E4851)架线及设备工程建筑'
                            },
                            {
                                label: '(E4852)管道工程建筑'
                            },
                        ]
                    },
                    {
                        label: '(E4890)其他土木工程建筑'
                    },
                ]
            },
            {
                label: '(E49)建筑安装业',
                children: [
                    {
                        label: '(E4910)电气安装'
                    },
                    {
                        label: '(E4920)管道和设备安装'
                    },
                    {
                        label: '(E4990)其他建筑安装业'
                    },
                ]
            },
            {
                label: '(E50)建筑装饰和其他建筑业',
                children: [
                    {
                        label: '(E5010)建筑装饰业'
                    },
                    {
                        label: '(E502)工程准备活动',
                        children: [
                            {
                                label: '(E5021)建筑物拆除活动'
                            },
                            {
                                label: '(E5029)其他工程准备活动'
                            },
                        ]
                    },
                    {
                        label: '(E5030)提供施工设备服务'
                    },
                    {
                        label: '(E5090)其他未列明建筑业'
                    },
                ]
            }]
    },
    {
        label: '(F)批发和零售业',
        children: [{
            label: '(F51)批发业',
            children: [
                {
                    label: '(F511)农、林、牧产品批发',
                    children: [
                        {
                            label: '(F5111)谷物、豆及薯类批发'
                        },
                        {
                            label: '(F5112)种子批发'
                        },
                        {
                            label: '(F5113)饲料批发'
                        },
                        {
                            label: '(F5114)棉、麻批发'
                        },
                        {
                            label: '(F5115)林业产品批发'
                        },
                        {
                            label: '(F5116)牲畜批发'
                        },
                        {
                            label: '(F5119)其他农牧产品批发'
                        },
                    ]
                },
                {
                    label: '(F512)食品、饮料及烟草制品批发',
                    children: [
                        {
                            label: '(F5121)米、面制品及食用油批发'
                        },
                        {
                            label: '(F5122)糕点、糖果及糖批发'
                        },
                        {
                            label: '(F5123)果品、蔬菜批发'
                        },
                        {
                            label: '(F5124)肉、禽、蛋、奶及水产品批发'
                        },
                        {
                            label: '(F5125)盐及调味品批发'
                        },
                        {
                            label: '(F5126)营养和保健品批发'
                        },
                        {
                            label: '(F5127)酒、饮料及茶叶批发'
                        },
                        {
                            label: '(F5128)烟草制品批发'
                        },
                        {
                            label: '(F5129)其他食品批发'
                        },
                    ]
                },
                {
                    label: '(F513)纺织、服装及家庭用品批发',
                    children: [
                        {
                            label: '(F5131)纺织品、针织品及原料批发'
                        },
                        {
                            label: '(F5132)服装批发'
                        },
                        {
                            label: '(F5133)鞋帽批发'
                        },
                        {
                            label: '(F5134)化妆品及卫生用品批发'
                        },
                        {
                            label: '(F5135)厨房、卫生间用具及日用杂货批发'
                        },
                        {
                            label: '(F5136)灯具、装饰物品批发'
                        },
                        {
                            label: '(F5137)家用电器批发'
                        },
                        {
                            label: '(F5139)其他家庭用品批发'
                        },
                    ]
                },
                {
                    label: '(F514)文化、体育用品及器材批发',
                    children: [
                        {
                            label: '(F5141)文具用品批发'
                        },
                        {
                            label: '(F5142)体育用品及器材批发'
                        },
                        {
                            label: '(F5143)图书批发'
                        },
                        {
                            label: '(F5144)报刊批发'
                        },
                        {
                            label: '(F5145)音像制品及电子出版物批发'
                        },
                        {
                            label: '(F5146)首饰、工艺品及收藏品批发'
                        },
                        {
                            label: '(F5149)其他文化用品批发'
                        },
                    ]
                },
                {
                    label: '(F515)医药及医疗器材批发',
                    children: [
                        {
                            label: '(F5151)西药批发'
                        },
                        {
                            label: '(F5152)中药批发'
                        },
                        {
                            label: '(F5153)医疗用品及器材批发'
                        },
                    ]
                },
                {
                    label: '(F516)矿产品、建材及化工产品批发',
                    children: [
                        {
                            label: '(F5161)煤炭及制品批发'
                        },
                        {
                            label: '(F5162)石油及制品批发'
                        },
                        {
                            label: '(F5163)非金属矿及制品批发'
                        },
                        {
                            label: '(F5164)金属及金属矿批发'
                        },
                        {
                            label: '(F5165)建材批发'
                        },
                        {
                            label: '(F5166)化肥批发'
                        },
                        {
                            label: '(F5167)农药批发'
                        },
                        {
                            label: '(F5168)农用薄膜批发'
                        },
                        {
                            label: '(F5169)其他化工产品批发'
                        },
                    ]
                },
                {
                    label: '(F517)机械设备、五金产品及电子产品批发',
                    children: [
                        {
                            label: '(F5171)农业机械批发'
                        },
                        {
                            label: '(F5172)汽车批发'
                        },
                        {
                            label: '(F5173)汽车零配件批发'
                        },
                        {
                            label: '(F5174)摩托车及零配件批发'
                        },
                        {
                            label: '(F5175)五金产品批发'
                        },
                        {
                            label: '(F5176)电气设备批发'
                        },
                        {
                            label: '(F5177)计算机、软件及辅助设备批发'
                        },
                        {
                            label: '(F5178)通讯及广播电视设备批发'
                        },
                        {
                            label: '(F5179)其他机械设备及电子产品批发'
                        },
                    ]
                },
                {
                    label: '(F518)贸易经纪与代理',
                    children: [
                        {
                            label: '(F5181)贸易代理'
                        },
                        {
                            label: '(F5182)拍卖'
                        },
                        {
                            label: '(F5189)其他贸易经纪与代理'
                        },
                    ]
                },
                {
                    label: '(F519)其他批发业',
                    children: [
                        {
                            label: '(F5191)再生物资回收与批发'
                        },
                        {
                            label: '(F5199)其他未列明批发业'
                        },
                    ]
                },

            ]
        },
            {
                label: '(F52)零售业',
                children: [
                    {
                        label: '(F521)综合零售',
                        children: [
                            {
                                label: '(F5211)百货零售'
                            },
                            {
                                label: '(F5212)超级市场零售'
                            },
                            {
                                label: '(F5219)其他综合零售'
                            },
                        ]
                    },
                    {
                        label: '(F522)食品、饮料及烟草制品专门零售',
                        children: [
                            {
                                label: '(F5221)粮油零售'
                            },
                            {
                                label: '(F5222)糕点、面包零售'
                            },
                            {
                                label: '(F5223)果品、蔬菜零售'
                            },
                            {
                                label: '(F5224)肉、禽、蛋、奶及水产品零售'
                            },
                            {
                                label: '(F5225)营养和保健品零售'
                            },
                            {
                                label: '(F5226)酒、饮料及茶叶零售'
                            },
                            {
                                label: '(F5227)烟草制品零售'
                            }, {
                                label: '(F5229)其他食品零售'
                            },
                        ]
                    },
                    {
                        label: '(F523)纺织、服装及日用品专门零售',
                        children: [
                            {
                                label: '(F5231)纺织品及针织品零售'
                            },
                            {
                                label: '(F5232)服装零售'
                            },
                            {
                                label: '(F5233)鞋帽零售'
                            },
                            {
                                label: '(F5234)化妆品及卫生用品零售'
                            },
                            {
                                label: '(F5235)钟表、眼镜零售'
                            },
                            {
                                label: '(F5236)箱、包零售'
                            },
                            {
                                label: '(F5237)厨房用具及日用杂品零售'
                            },
                            {
                                label: '(F5238)自行车零售'
                            },
                            {
                                label: '(F5239)其他日用品零售'
                            },

                        ]
                    },
                    {
                        label: '(F524)文化、体育用品及器材专门零售',
                        children: [
                            {
                                label: '(F5241)文具用品零售'
                            },
                            {
                                label: '(F5242)体育用品及器材零售'
                            },
                            {
                                label: '(F5243)图书、报刊零售'
                            },
                            {
                                label: '(F5244)音像制品及电子出版物零售'
                            },
                            {
                                label: '(F5245)珠宝首饰零售'
                            },
                            {
                                label: '(F5246)工艺美术品及收藏品零售'
                            },
                            {
                                label: '(F5247)乐器零售'
                            },
                            {
                                label: '(F5248)照相器材零售'
                            },
                            {
                                label: '(F5249)其他文化用品零售'
                            },

                        ]
                    },
                    {
                        label: '(F525)医药及医疗器材专门零售',
                        children: [
                            {
                                label: '(F5251)药品零售'
                            },
                            {
                                label: '(F5252)医疗用品及器材零售'
                            },
                        ]
                    },
                    {
                        label: '(F526)汽车、摩托车、燃料及零配件专门零售',
                        children: [
                            {
                                label: '(F5261)汽车零售'
                            },
                            {
                                label: '(F5262)汽车零配件零售'
                            },
                            {
                                label: '(F5263)摩托车及零配件零售'
                            },
                            {
                                label: '(F5264)机动车燃料零售'
                            },

                        ]
                    },
                    {
                        label: '(F527)家用电器及电子产品专门零售',
                        children: [
                            {
                                label: '(F5271)家用视听设备零售'
                            },
                            {
                                label: '(F5272)日用家电设备零售'
                            },
                            {
                                label: '(F5273)计算机、软件及辅助设备零售'
                            },
                            {
                                label: '(F5274)通信设备零售'
                            },
                            {
                                label: '(F5279)其他电子产品零售'
                            },
                        ]
                    },
                    {
                        label: '(F528)五金、家具及室内装饰材料专门零售',
                        children: [
                            {
                                label: '(F5281)五金零售'
                            },
                            {
                                label: '(F5282)灯具零售'
                            },
                            {
                                label: '(F5283)家具零售'
                            },
                            {
                                label: '(F5284)涂料零售'
                            },
                            {
                                label: '(F5285)卫生洁具零售'
                            },
                            {
                                label: '(F5286)木质装饰材料零售'
                            },
                            {
                                label: '(F5287)陶瓷、石材装饰材料零售'
                            },
                            {
                                label: '(F5289)其他室内装饰材料零售'
                            },
                        ]
                    },
                    {
                        label: '(F529)货摊、无店铺及其他零售业',
                        children: [
                            {
                                label: '(F5291)货摊食品零售'
                            },
                            {
                                label: '(F5292)货摊纺织、服装及鞋零售'
                            },
                            {
                                label: '(F5293)货摊日用品零售'
                            },
                            {
                                label: '(F5294)互联网零售'
                            },
                            {
                                label: '(F5295)邮购及电视、电话零售'
                            },
                            {
                                label: '(F5296)旧货零售'
                            },
                            {
                                label: '(F5297)生活用燃料零售'
                            },
                            {
                                label: '(F5299)其他未列明零售业'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(F53)商业贸易',
            }]
    },
    {
        label: '(G)交通运输、仓储和邮政业',
        children: [
            {
                label: '(G53)铁路运输业',
                children: [
                    {
                        label: '(G5310)铁路旅客运输'
                    },
                    {
                        label: '(G5320)铁路货物运输'
                    },
                    {
                        label: '(G533)铁路运输辅助活动',
                        children: [
                            {
                                label: '(G5331)客运火车站'
                            },
                            {
                                label: '(G5332)货运火车站'
                            },
                            {
                                label: '(G5339)其他铁路运输辅助活动'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(G54)道路运输业',
                children: [
                    {
                        label: '(G541)城市公共交通运输',
                        children: [
                            {
                                label: '(G5411)公共电汽车客运'
                            },
                            {
                                label: '(G5412)城市轨道交通'
                            },
                            {
                                label: '(G5413)出租车客运'
                            },
                            {
                                label: '(G5419)其他城市公共交通运输'
                            },
                        ]
                    },
                    {
                        label: '(G5420)公路旅客运输'
                    },

                    {
                        label: '(G5430)道路货物运输'
                    },

                    {
                        label: '(G544)道路运输辅助活动',
                        children: [
                            {
                                label: '(G5441)客运汽车站'
                            },
                            {
                                label: '(G5442)公路管理与养护'
                            },
                            {
                                label: '(G5449)其他道路运输辅助活动'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(G55)水上运输业',
                children: [
                    {
                        label: '(G551)水上旅客运输',
                        children: [
                            {
                                label: '(G5511)海洋旅客运输'
                            },
                            {
                                label: '(G5512)内河旅客运输'
                            },
                            {
                                label: '(G5513)客运轮渡运输'
                            },
                        ]
                    },
                    {
                        label: '(G552)水上货物运输',
                        children: [
                            {
                                label: '(G5521)远洋货物运输'
                            },
                            {
                                label: '(G5522)沿海货物运输'
                            },
                            {
                                label: '(G5523)内河货物运输'
                            },
                        ]
                    },
                    {
                        label: '(G553)水上运输辅助活动',
                        children: [
                            {
                                label: '(G5531)客运港口'
                            },
                            {
                                label: '(G5532)货运港口'
                            },
                            {
                                label: '(G5539)其他水上运输辅助活动'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(G56)航空运输业',
                children: [
                    {
                        label: '(G561)航空客货运输',
                        children: [
                            {
                                label: '(G5611)航空旅客运输'
                            },
                            {
                                label: '(G5612)航空货物运输'
                            },
                        ]
                    },
                    {
                        label: '(G5620)通用航空服务'
                    },
                    {
                        label: '(G563)航空运输辅助活动',
                        children: [
                            {
                                label: '(G5631)机场'
                            },
                            {
                                label: '(G5632)空中交通管理'
                            },
                            {
                                label: '(G5639)其他航空运输辅助活动'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(G57)管道运输业',
                children: [{
                    label: '(G5700)管道运输业'
                }]
            },
            {
                label: '(G58)装卸搬运和运输代理业',
                children: [{
                    label: '(G5810)装卸搬运'
                },
                    {
                        label: '(G582)运输代理业',
                        children: [
                            {
                                label: '(G5821)货物运输代理'
                            },
                            {
                                label: '(G5822)旅客票务代理'
                            },
                            {
                                label: '(G5829)其他运输代理业'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(G59)仓储业',
                children: [
                    {
                        label: '(G591)谷物、棉花等农产品仓储',
                        children: [
                            {
                                label: '(G5911)谷物仓储'
                            },
                            {
                                label: '(G5912)棉花仓储'
                            },
                            {
                                label: '(G5919)其他农产品仓储'
                            },
                        ]
                    },
                    {
                        label: '(G5990)其他仓储业'
                    },


                ]
            },
            {
                label: '(G60)邮政业',
                children: [
                    {
                        label: '(G6010)邮政基本服务'
                    },
                    {
                        label: '(G6020)快递服务'
                    },
                ]
            }]
    },
    {
        label: '(H)住宿和餐饮业',
        children: [{
            label: '(H61)住宿业',
            children: [
                {
                    label: '(H6110)旅游饭店'
                },
                {
                    label: '(H6120)一般旅馆'
                },
                {
                    label: '(H6190)其他住宿业'
                },
            ]
        }, {
            label: '(H62)餐饮业',
            children: [
                {
                    label: '(H6210)正餐服务'
                },
                {
                    label: '(H6220)快餐服务'
                },
                {
                    label: '(H623)饮料及冷饮服务',
                    children: [
                        {
                            label: '(H6231)茶馆服务'
                        },
                        {
                            label: '(H6232)咖啡馆服务'
                        },
                        {
                            label: '(H6233)酒吧服务'
                        },
                        {
                            label: '(H6239)其他饮料及冷饮服务'
                        },
                    ]
                },
                {
                    label: '(H629)其他餐饮业',
                    children: [
                        {
                            label: '(H6291)小吃服务'
                        },
                        {
                            label: '(H6292)餐饮配送服务'
                        },
                        {
                            label: '(H6299)其他未列明餐饮业'
                        },
                    ]
                },
            ]
        }]
    },
    {
        label: '(I)信息传输、软件和信息技术服务业',
        children: [
            {
                label: '(I63)电信、广播电视和卫星传输服务',
                children: [
                    {
                        label: '(I631)电信',
                        children: [
                            {
                                label: '(I6311)固定电信服务'
                            },
                            {
                                label: '(I6312)移动电信服务'
                            },
                            {
                                label: '(I6319)其他电信服务'
                            },
                        ]
                    },
                    {
                        label: '(I632)广播电视传输服务',
                        children: [
                            {
                                label: '(I6321)有线广播电视传输服务'
                            },
                            {
                                label: '(I6322)无线广播电视传输服务'
                            },
                        ]
                    },
                    {
                        label: '(I6330)卫星传输服务',
                        children: [
                            {
                                label: ''
                            },
                        ]
                    },

                ]
            },
            {
                label: '(I64)互联网和相关服务',
                children: [
                    {
                        label: '(I6410)互联网接入及相关服务'
                    },
                    {
                        label: '(I6420)互联网信息服务'
                    },
                    {
                        label: '(I6490)其他互联网服务'
                    },
                ]
            },
            {
                label: '(I65)软件和信息技术服务业',
                children: [
                    {
                        label: '(I6510)软件开发'
                    },
                    {
                        label: '(I6520)信息系统集成服务'
                    },
                    {
                        label: '(I6530)信息技术咨询服务'
                    },
                    {
                        label: '(I6540)数据处理和存储服务'
                    },
                    {
                        label: '(I6550)集成电路设计'
                    },
                    {
                        label: '(I659)其他信息技术服务业',
                        children: [
                            {
                                label: '(I6591)数字内容服务'
                            },
                            {
                                label: '(I6592)呼叫中心'
                            },
                            {
                                label: '(I6599)其他未列明信息技术服务业'
                            },
                        ]
                    },
                ]
            }]
    },
    {
        label: '(J)金融业',
        children: [
            {
                label: '(J66)货币金融服务',
                children: [
                    {
                        label: '(J6610)中央银行服务'
                    },
                    {
                        label: '(J6620)货币银行服务'
                    },
                    {
                        label: '(J663)非货币银行服务',
                        children: [
                            {
                                label: '(J6631)金融租赁服务'
                            },
                            {
                                label: '(J6632)财务公司'
                            },
                            {
                                label: '(J6633)典当'
                            },
                            {
                                label: '(J6639)其他非货币银行服务'
                            },
                        ]
                    },
                    {
                        label: '(J6640)银行监管服务'
                    },
                ]
            },
            {
                label: '(J67)资本市场服务',
                children: [
                    {
                        label: '(J671)证券市场服务',
                        children: [
                            {
                                label: '(J6711)证券市场管理服务'
                            },
                            {
                                label: '(J6712)证券经纪交易服务'
                            },
                            {
                                label: '(J6713)基金管理服务'
                            },
                        ]
                    },
                    {
                        label: '(J672)期货市场服务',
                        children: [
                            {
                                label: '(J6721)期货市场管理服务'
                            },
                            {
                                label: '(J6729)其他期货市场服务'
                            },
                        ]
                    },
                    {
                        label: '(J6730)证券期货监管服务'
                    },
                    {
                        label: '(J6740)资本投资服务'
                    },
                    {
                        label: '(J6790)其他资本市场服务'
                    },
                ]
            },
            {
                label: '(J68)保险业',
                children: [
                    {
                        label: '(J681)人身保险',
                        children: [
                            {
                                label: '(J6811)人寿保险'
                            },
                            {
                                label: '(J6812)健康和意外保险'
                            },
                        ]
                    },
                    {
                        label: '(J6820)财产保险'
                    },
                    {
                        label: '(J6830)再保险'
                    },
                    {
                        label: '(J6840)养老金'
                    },
                    {
                        label: '(J6850)保险经纪与代理服务'
                    },
                    {
                        label: '(J6860)保险监管服务'
                    },
                    {
                        label: '(J689)其他保险活动',
                        children: [
                            {
                                label: '(J6891)风险和损失评估'
                            },
                            {
                                label: '(J6899)其他未列明保险活动'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(J69)其他金融业',
                children: [
                    {
                        label: '(J6910)金融信托与管理服务'
                    },
                    {
                        label: '(J6920)控股公司服务'
                    },
                    {
                        label: '(J6930)非金融机构支付服务'
                    },
                    {
                        label: '(J6940)金融信息服务'
                    },
                    {
                        label: '(J6990)其他未列明金融业'
                    },
                ]
            },
        ]
    }, {
        label: '(K)房地产业',
        children: [{
            label: '(K70)房地产业',
            children: [
                {
                    label: '(K7010)房地产开发经营'
                },
                {
                    label: '(K7020)物业管理'
                },
                {
                    label: '(K7030)房地产中介服务'
                },
                {
                    label: '(K7040)自有房地产经营活动'
                },
                {
                    label: '(K7090)其他房地产业'
                },

            ]
        },]
    }, {
        label: '(L)租赁和商务服务业',
        children: [{
            label: '(L71)租赁业',
            children: [
                {
                    label: '(L711)机械设备租赁',
                    children: [
                        {
                            label: '(L7111)汽车租赁'
                        },
                        {
                            label: '(L7112)农业机械租赁'
                        },
                        {
                            label: '(L7113)建筑工程机械与设备租赁'
                        },
                        {
                            label: '(L7114)计算机及通讯设备租赁'
                        },
                        {
                            label: '(L7119)其他机械与设备租赁'
                        },
                    ]
                },
                {
                    label: '(L712)文化及日用品出租',
                    children: [
                        {
                            label: '(L7121)娱乐及体育设备出租'
                        },
                        {
                            label: '(L7122)图书出租'
                        },
                        {
                            label: '(L7123)音像制品出租'
                        },
                        {
                            label: '(L7129)其他文化及日用品出租'
                        },
                    ]
                },
            ]
        }, {
            label: '(L72)商务服务业',
            children: [
                {
                    label: '(L721)企业管理服务',
                    children: [
                        {
                            label: '(L7211)企业总部管理'
                        },
                        {
                            label: '(L7212)投资与资产管理'
                        },
                        {
                            label: '(L7213)单位后勤管理服务'
                        },
                        {
                            label: '(L7219)其他企业管理服务'
                        },
                    ]
                },
                {
                    label: '(L722)法律服务',
                    children: [
                        {
                            label: '(L7221)律师及相关法律服务'
                        },
                        {
                            label: '(L7222)公证服务'
                        },
                        {
                            label: '(L7229)其他法律服务'
                        },
                    ]
                },
                {
                    label: '(L723)咨询与调查',
                    children: [
                        {
                            label: '(L7231)会计、审计及税务服务'
                        },
                        {
                            label: '(L7232)市场调查'
                        },
                        {
                            label: '(L7233)社会经济咨询'
                        },
                        {
                            label: '(L7239)其他专业咨询'
                        },
                    ]
                },
                {
                    label: '(L7240)广告业',
                },
                {
                    label: '(L7250)知识产权服务',
                },
                {
                    label: '(L726)人力资源服务',
                    children: [
                        {
                            label: '(L7261)公共就业服务'
                        },
                        {
                            label: '(L7262)职业中介服务'
                        },
                        {
                            label: '(L7263)劳务派遣服务'
                        },
                        {
                            label: '(L7269)其他人力资源服务'
                        },
                    ]
                },
                {
                    label: '(L727)旅行社及相关服务',
                    children: [
                        {
                            label: '(L7271)旅行社服务'
                        },
                        {
                            label: '(L7272)旅游管理服务'
                        },
                        {
                            label: '(L7279)其他旅行社相关服务'
                        },
                    ]
                },
                {
                    label: '(L728)安全保护服务',
                    children: [
                        {
                            label: '(L7281)安全服务'
                        },
                        {
                            label: '(L7282)安全系统监控服务'
                        },
                        {
                            label: '(L7289)其他安全保护服务'
                        },
                    ]
                },
                {
                    label: '(L729)其他商务服务业',
                    children: [
                        {
                            label: '(L7291)市场管理'
                        },
                        {
                            label: '(L7292)会议及展览服务'
                        },
                        {
                            label: '(L7293)包装服务'
                        },
                        {
                            label: '(L7294)办公服务'
                        },
                        {
                            label: '(L7295)信用服务'
                        },
                        {
                            label: '(L7296)担保服务'
                        },
                        {
                            label: '(L7299)其他未列明商务服务业'
                        },
                    ]
                },
            ]
        }]
    },
    {
        label: '(M)科学研究和技术服务业',
        children: [{
            label: '(M73)研究和试验发展',
            children: [
                {
                    label: '(M7310)自然科学研究和试验发展'
                },
                {
                    label: '(M7320)工程和技术研究和试验发展'
                },
                {
                    label: '(M7330)农业科学研究和试验发展'
                },
                {
                    label: '(M7340)医学研究和试验发展'
                },
                {
                    label: '(M7350)社会人文科学研究'
                },
            ]
        },
            {
                label: '(M74)专业技术服务业',
                children: [
                    {
                        label: '(M7410)气象服务'
                    },
                    {
                        label: '(M7420)地震服务'
                    },
                    {
                        label: '(M7430)海洋服务'
                    },
                    {
                        label: '(M7440)测绘服务'
                    },
                    {
                        label: '(M7450)质检技术服务'
                    },
                    {
                        label: '(M746)环境与生态监测',
                        children: [
                            {
                                label: '(M7461)环境保护监测'
                            },
                            {
                                label: '(M7462)生态监测'
                            },
                        ]
                    },

                    {
                        label: '(M747)地质勘查',
                        children: [
                            {
                                label: '(M7471)能源矿产地质勘查'
                            }, {
                                label: '(M7472)固体矿产地质勘查'
                            },
                            {
                                label: '(M7473)水、二氧化碳等矿产地质勘查'
                            },
                            {
                                label: '(M7474)基础地质勘查'
                            },
                            {
                                label: '(M7475)地质勘查技术服务'
                            },
                        ]
                    },

                    {
                        label: '(M748)工程技术',
                        children: [
                            {
                                label: '(M7481)工程管理服务'
                            },
                            {
                                label: '(M7482)工程勘察设计'
                            },
                            {
                                label: '(M7483)规划管理'
                            },
                        ]
                    },

                    {
                        label: '(M749)其他专业技术服务业',
                        children: [
                            {
                                label: '(M7491)专业化设计服务'
                            },
                            {
                                label: '(M7492)摄影扩印服务'
                            },
                            {
                                label: '(M7493)兽医服务'
                            },
                            {
                                label: '(M7499)其他未列明专业技术服务业'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(M75)科技推广和应用服务业',
                children: [
                    {
                        label: '(M751)技术推广服务',
                        children: [
                            {
                                label: '(M7511)农业技术推广服务'
                            },
                            {
                                label: '(M7512)生物技术推广服务'
                            },
                            {
                                label: '(M7513)新材料技术推广服务'
                            },
                            {
                                label: '(M7514)节能技术推广服务'
                            },
                            {
                                label: '(M7519)其他技术推广服务'
                            },
                        ]
                    },
                    {
                        label: '(M7520)科技中介服务'
                    },
                    {
                        label: '(M7590)其他科技推广和应用服务业'
                    },

                ]
            },
        ]
    },
    {
        label: '(N)水利、环境和公共设施管理业',
        children: [{
            label: '(N76)水利管理业',
            children: [
                {
                    label: '(N7610)防洪除涝设施管理'
                },

                {
                    label: '(N7620)水资源管理'
                },

                {
                    label: '(N7630)天然水收集与分配'
                },

                {
                    label: '(N7640)水文服务'
                },

                {
                    label: '(N7690)其他水利管理业'
                },

            ]
        },
            {
                label: '(N77)生态保护和环境治理业',
                children: [
                    {
                        label: '(N771)生态保护',
                        children: [
                            {
                                label: '(N7711)自然保护区管理'
                            },
                            {
                                label: '(N7712)野生动物保护'
                            },
                            {
                                label: '(N7713)野生植物保护'
                            },
                            {
                                label: '(N7719)其他自然保护'
                            },
                        ]
                    },
                    {
                        label: '(N772)环境治理业',
                        children: [
                            {
                                label: '(N7721)水污染治理'
                            },
                            {
                                label: '(N7722)大气污染治理'
                            },
                            {
                                label: '(N7723)固体废物治理'
                            },
                            {
                                label: '(N7724)危险废物治理'
                            },
                            {
                                label: '(N7725)放射性废物治理'
                            },
                            {
                                label: '(N7729)其他污染治理'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(N78)公共设施管理业',
                children: [
                    {
                        label: '(N7810)市政设施管理'
                    },
                    {
                        label: '(N7820)环境卫生管理'
                    },
                    {
                        label: '(N7830)城乡市容管理'
                    },
                    {
                        label: '(N7840)绿化管理'
                    },
                    {
                        label: '(N785)公园和游览景区管理',
                        children: [
                            {
                                label: '(N7851)公园管理'
                            },
                            {
                                label: '(N7852)游览景区管理'
                            },
                        ]
                    },
                ]
            },
        ]
    },
    {
        label: '(O)居民服务、修理和其他服务业',
        children: [{
            label: '(O79)居民服务业',
            children: [
                {
                    label: '(O7910)家庭服务'
                },
                {
                    label: '(O7920)托儿所服务'
                },
                {
                    label: '(O7930)洗染服务'
                },
                {
                    label: '(O7940)理发及美容服务'
                },
                {
                    label: '(O7950)洗浴服务'
                },
                {
                    label: '(O7960)保健服务'
                },
                {
                    label: '(O7970)婚姻服务'
                },
                {
                    label: '(O7980)殡葬服务'
                },
                {
                    label: '(O7990)其他居民服务业'
                },
            ]
        }, {
            label: '(O80)机动车、电子产品和日用产品修理业',
            children: [
                {
                    label: '(O801)汽车、摩托车修理与维护',
                    children: [
                        {
                            label: '(O8011)汽车修理与维护'
                        },
                        {
                            label: '(O8012)摩托车修理与维护'
                        },
                    ]
                },
                {
                    label: '(O802)计算机和办公设备维修',
                    children: [
                        {
                            label: '(O8021)计算机和辅助设备修理'
                        },
                        {
                            label: '(O8022)通讯设备修理'
                        },
                        {
                            label: '(O8029)其他办公设备维修'
                        },
                    ]
                },
                {
                    label: '(O803)家用电器修理',
                    children: [
                        {
                            label: '(O8031)家用电子产品修理'
                        },
                        {
                            label: '(O8032)日用电器修理'
                        },
                    ]
                },
                {
                    label: '(O809)其他日用产品修理业',
                    children: [
                        {
                            label: '(O8091)自行车修理'
                        },
                        {
                            label: '(O8092)鞋和皮革修理'
                        },
                        {
                            label: '(O8093)家具和相关物品修理'
                        },
                        {
                            label: '(O8099)其他未列明日用产品修理业'
                        },
                    ]
                },
            ]
        },
            {
                label: '(O81)其他服务业',
                children: [
                    {
                        label: '(O811)清洁服务',
                        children: [
                            {
                                label: '(O8111)建筑物清洁服务'
                            },
                            {
                                label: '(O8119)其他清洁服务'
                            },
                        ]
                    },
                    {
                        label: '(O8190)其他未列明服务业'
                    },

                ]
            },
        ]
    },
    {
        label: '(P)教育',
        children: [{
            label: '(P82)教育',
            children: [
                {
                    label: '(P8210)学前教育',
                },
                {
                    label: '(P822)初等教育',
                    children: [
                        {
                            label: '(P8221)普通小学教育'
                        },
                        {
                            label: '(P8222)成人小学教育'
                        },
                    ]
                },
                {
                    label: '(P823)中等教育',
                    children: [
                        {
                            label: '(P8231)普通初中教育'
                        },
                        {
                            label: '(P8232)职业初中教育'
                        },
                        {
                            label: '(P8233)成人初中教育'
                        },
                        {
                            label: '(P8234)普通高中教育'
                        },
                        {
                            label: '(P8235)成人高中教育'
                        },
                        {
                            label: '(P8236)中等职业学校教育'
                        },
                    ]
                },
                {
                    label: '(P824)高等教育',
                    children: [
                        {
                            label: '(P8241)普通高等教育'
                        },
                        {
                            label: '(P8242)成人高等教育'
                        },
                    ]
                },
                {
                    label: '(P8250)特殊教育',
                },
                {
                    label: '(P829)技能培训、教育辅助及其他教育',
                    children: [
                        {
                            label: '(P8291)职业技能培训'
                        },
                        {
                            label: '(P8292)体校及体育培训'
                        },
                        {
                            label: '(P8293)文化艺术培训'
                        },
                        {
                            label: '(P8294)教育辅助服务'
                        },
                        {
                            label: '(P8299)其他未列明教育'
                        },
                    ]
                },
            ]
        },]
    },
    {
        label: '(Q)卫生和社会工作',
        children: [{
            label: '(Q83)卫生',
            children: [
                {
                    label: '(Q831)医院',
                    children: [
                        {
                            label: '(Q8311)综合医院'
                        },
                        {
                            label: '(Q8312)中医医院'
                        },
                        {
                            label: '(Q8313)中西医结合医院'
                        },
                        {
                            label: '(Q8314)民族医院'
                        },
                        {
                            label: '(Q8315)专科医院'
                        },
                        {
                            label: '(Q8316)疗养院'
                        },
                    ]
                },
                {
                    label: '(Q832)社区医疗与卫生院',
                    children: [
                        {
                            label: '(Q8321)社区卫生服务中心（站）'
                        },
                        {
                            label: '(Q8322)街道卫生院'
                        },
                        {
                            label: '(Q8323)乡镇卫生院'
                        },
                    ]
                },
                {
                    label: '(Q8330)门诊部（所）'
                },
                {
                    label: '(Q8340)计划生育技术服务活动'
                },
                {
                    label: '(Q8350)妇幼保健院（所、站）'
                },
                {
                    label: '(Q8360)专科疾病防治院（所、站）'
                },
                {
                    label: '(Q8370)疾病预防控制中心'
                },
                {
                    label: '(Q8390)其他卫生活动'
                },
            ]
        }, {
            label: '(Q84)社会工作',
            children: [
                {
                    label: '(Q841)提供住宿社会工作',
                    children: [
                        {
                            label: '(Q8411)干部休养所'
                        },
                        {
                            label: '(Q8412)护理机构服务'
                        },
                        {
                            label: '(Q8413)精神康复服务'
                        },
                        {
                            label: '(Q8414)老年人、残疾人养护服务'
                        },
                        {
                            label: '(Q8415)孤残儿童收养和庇护服务'
                        },
                        {
                            label: '(Q8419)其他提供住宿社会救助'
                        },
                    ]
                },
                {
                    label: '(Q842)不提供住宿社会工作',
                    children: [
                        {
                            label: '(Q8421)社会看护与帮助服务'
                        },
                        {
                            label: '(Q8429)其他不提供住宿社会工作'
                        },
                    ]
                },
            ]
        }]
    },
    {
        label: '(R)文化、体育和娱乐业',
        children: [{
            label: '(R85)新闻和出版业',
            children: [
                {
                    label: '(R8510)新闻业'
                },
                {
                    label: '(R852)出版业',
                    children: [
                        {
                            label: '(R8521)图书出版'
                        },
                        {
                            label: '(R8522)报纸出版'
                        },
                        {
                            label: '(R8523)期刊出版'
                        },
                        {
                            label: '(R8524)音像制品出版'
                        },
                        {
                            label: '(R8525)电子出版物出版'
                        },
                        {
                            label: '(R8529)其他出版业'
                        },
                    ]
                },
            ]
        },
            {
                label: '(R86)广播、电视、电影和影视录音制作业',
                children: [
                    {
                        label: '(R8610)广播'
                    },
                    {
                        label: '(R8620)电视'
                    },
                    {
                        label: '(R8630)电影和影视节目制作'
                    },
                    {
                        label: '(R8640)电影和影视节目发行'
                    },
                    {
                        label: '(R8650)电影放映'
                    },
                    {
                        label: '(R8660)录音制作'
                    },
                ]
            },
            {
                label: '(R87)文化艺术业',
                children: [
                    {
                        label: '(R8710)文艺创作与表演'
                    },
                    {
                        label: '(R8720)艺术表演场馆'
                    },
                    {
                        label: '(R873)图书馆与档案馆',
                        children: [
                            {
                                label: '(R8731)图书馆'
                            },
                            {
                                label: '(R8732)档案馆'
                            },
                        ]
                    },
                    {
                        label: '(R8740)文物及非物质文化遗产保护'
                    },
                    {
                        label: '(R8750)博物馆'
                    },
                    {
                        label: '(R8760)烈士陵园、纪念馆'
                    },
                    {
                        label: '(R8770)群众文化活动'
                    },
                    {
                        label: '(R8790)其他文化艺术业'
                    },
                ]
            },
            {
                label: '(R88)体育',
                children: [
                    {
                        label: '(R8810)体育组织'
                    },
                    {
                        label: '(R8820)体育场馆'
                    },
                    {
                        label: '(R8830)休闲健身活动'
                    },
                    {
                        label: '(R8890)其他体育'
                    },
                ]
            },
            {
                label: '(R89)娱乐业',
                children: [
                    {
                        label: '(R891)室内娱乐活动',
                        children: [
                            {
                                label: '(R8911)歌舞厅娱乐活动'
                            },
                            {
                                label: '(R8912)电子游艺厅娱乐活动'
                            },
                            {
                                label: '(R8913)网吧活动'
                            },
                            {
                                label: '(R8919)其他室内娱乐活动'
                            },
                        ]
                    },
                    {
                        label: '(R8920)游乐园'
                    },
                    {
                        label: '(R8930)彩票活动'
                    },
                    {
                        label: '(R894)文化、娱乐、体育经纪代理',
                        children: [
                            {
                                label: '(R8941)文化娱乐经纪人'
                            },
                            {
                                label: '(R8942)体育经纪人'
                            },
                            {
                                label: '(R8949)其他文化艺术经纪代理'
                            },
                        ]
                    },
                    {
                        label: '(R8990)其他娱乐业'
                    },
                ]
            },
        ]
    },
    {
        label: '(S)公共管理、社会保障和社会组织',
        children: [{
            label: '(S90)中国共产党机关',
            children: [
                {
                    label: '(S9000)中国共产党机关'
                },

            ]
        },
            {
                label: '(S91)国家机构',
                children: [
                    {
                        label: '(S9110)国家权力机构',
                    },
                    {
                        label: '(S912)国家行政机构',
                        children: [
                            {
                                label: '(S9121)综合事务管理机构'
                            },
                            {
                                label: '(S9122)对外事务管理机构'
                            },
                            {
                                label: '(S9123)公共安全管理机构'
                            },
                            {
                                label: '(S9124)社会事务管理机构'
                            },
                            {
                                label: '(S9125)经济事务管理机构'
                            },
                            {
                                label: '(S9126)行政监督检查机构'
                            },
                        ]
                    },
                    {
                        label: '(S913)人民法院和人民检察院',
                        children: [
                            {
                                label: '(S9131)人民法院'
                            },
                            {
                                label: '(S9132)人民检察院'
                            },
                        ]
                    },
                    {
                        label: '(S9190)其他国家机构',
                    },
                ]
            },
            {
                label: '(S92)人民政协、民主党派',
                children: [
                    {
                        label: '(S9210)人民政协'
                    },
                    {
                        label: '(S9220)民主党派'
                    },
                ]
            },
            {
                label: '(S93)社会保障',
                children: [
                    {
                        label: '(S9300)社会保障'
                    },
                ]
            },
            {
                label: '(S94)群众团体、社会团体和其他成员组织',
                children: [
                    {
                        label: '(S941)群众团体',
                        children: [
                            {
                                label: '(S9411)工会'
                            },
                            {
                                label: '(S9412)妇联'
                            },
                            {
                                label: '(S9413)共青团'
                            },
                            {
                                label: '(S9419)其他群众团体'
                            },
                        ]
                    },
                    {
                        label: '(S942)社会团体',
                        children: [
                            {
                                label: '(S9421)专业性团体'
                            },
                            {
                                label: 'S9422)行业性团体'
                            },
                            {
                                label: '(S9429)其他社会团体'
                            },
                        ]
                    },
                    {
                        label: '(S9430)基金会'
                    },
                    {
                        label: '(S9440)宗教组织'
                    },
                ]
            },
            {
                label: '(S95)基层群众自治组织',
                children: [
                    {
                        label: '(S9510)社区自治组织'
                    },
                    {
                        label: '(S9520)村民自治组织'
                    },
                ]
            },
        ]
    },
    {
        label: '(T)国际组织',
        children: [{
            label: '(T96)国际组织',
            children: [{
                label: '(T9600)国际组织'
            },]
        },]
    },
    {
        label: '(Z)综合',
    },
]

let data2 = [
    {
        label: '(A)农、林、牧、渔业',
        children: [
            {
                label: '(A01)农业',
            },
            {
                label: '(A02)林业',
                children: [
                    {
                        label: '(A0230)森林经营和管护',
                    },
                ]
            },
            {
                label: '(A03)畜牧业',
            },
            {
                label: '(A04)渔业',
            },
        ]
    },
    {
        label: '(B)采矿业',
        children: [
            {
                label: '(B06)煤炭开采和洗选业',
            },
            {
                label: '(B07)石油和天然气开采业',
                children: [
                    {
                        label: '(B0710)石油开采'
                    },
                    {
                        label: '(B0720)天然气开采'
                    },
                ]
            },
            {
                label: '(B08)黑色金属矿采选业',
                children: [
                    {
                        label: '(B0810)铁矿采选'
                    },
                    {
                        label: '(B0820)锰矿、铬矿采选'
                    },
                    {
                        label: '(B0890)其他黑色金属矿采选'
                    },
                ]
            },
            {
                label: '(B09)有色金属矿采选业',
                children: [
                    {
                        label: '(B091)常用有色金属矿采选',
                        children: [
                            {
                                label: '(B0911)铜矿采选'
                            },
                            {
                                label: '(B0912)铅锌矿采选'
                            },
                            {
                                label: '(B0913)镍钴矿采选'
                            },
                            {
                                label: '(B0914)锡矿采选'
                            },
                            {
                                label: '(B0915)锑矿采选'
                            },
                            {
                                label: '(B0916)铝矿采选'
                            },
                            {
                                label: '(B0917)镁矿采选'
                            },
                            {
                                label: '(B0919)其他常用有色金属矿采选'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(B10)非金属矿采选业',
                children: [
                    {
                        label: '(B101)土砂石开采',
                        children: [
                            {
                                label: '(B1011)石灰石、石膏开采'
                            },
                            {
                                label: '(B1012)建筑装饰用石开采'
                            },
                            {
                                label: '(B1013)耐火土石开采'
                            },
                        ]
                    },
                    {
                        label: '(B1020)化学矿开采'
                    },
                    {
                        label: '(B1030)采盐'
                    },
                    {
                        label: '(B109)石棉及其他非金属矿采选',
                        children: [
                            {
                                label: '(B1091)石棉、云母矿采选'
                            },
                            {
                                label: '(B1092)石墨、滑石采选'
                            },
                            {
                                label: '(B1093)宝石、玉石采选'
                            },
                            {
                                label: '(B1099)其他未列明非金属矿采选'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(B12)其他采矿业',
                children: [{
                    label: '(B1200)其他采矿业'
                }]
            },
        ]
    },
    {
        label: '(C)制造业',
        children: [{
            label: '(C13)农副食品加工业',
            children: [
                {
                    label: '(C1320)饲料加工'
                },
                {
                    label: '(C133)植物油加工',
                    children: [
                        {
                            label: '(C1331)食用植物油加工'
                        },
                        {
                            label: '(C1332)非食用植物油加工'
                        },
                    ]
                },
                {
                    label: '(C1340)制糖业'
                },
                {
                    label: '(C135)屠宰及肉类加工',
                    children: [
                        {
                            label: '(C1351)牲畜屠宰'
                        },
                        {
                            label: '(C1352)禽类屠宰'
                        },
                        {
                            label: '(C1353)肉制品及副产品加工'
                        },
                    ]
                },
                {
                    label: '(C136)水产品加工',
                    children: [
                        {
                            label: '(C1361)水产品冷冻加工'
                        },
                        {
                            label: '(C1362)鱼糜制品及水产品干腌制加工'
                        },
                        {
                            label: '(C1363)水产饲料制造'
                        },
                        {
                            label: '(C1364)鱼油提取及制品制造'
                        },
                        {
                            label: '(C1369)其他水产品加工'
                        },
                    ]
                },
                {
                    label: '(C137)蔬菜、水果和坚果加工',
                    children: [
                        {
                            label: '(C1371)蔬菜加工'
                        },
                        {
                            label: '(C1372)水果和坚果加工'
                        },

                    ]
                },
                {
                    label: '(C139)其他农副食品加工',
                },
            ]
        },
            {
                label: '(C14)食品制造业',
                children: [
                    {
                        label: '(C141)焙烤食品制造',
                        children: [
                            {
                                label: '(C1411)糕点、面包制造'
                            },
                        ]
                    },
                    {
                        label: '(C142)糖果、巧克力及蜜饯制造',
                        children: [
                            {
                                label: '(C1421)糖果、巧克力制造'
                            },
                            {
                                label: '(C1422)蜜饯制作'
                            },
                        ]
                    },
                    {
                        label: '(C143)方便食品制造',
                    },
                    {
                        label: '(C1440)乳制品制造'
                    },
                    {
                        label: '(C145)罐头食品制造',
                    },
                    {
                        label: '(C146)调味品、发酵制品制造',
                    },
                    {
                        label: '(C149)其他食品制造',
                        children: [
                            {
                                label: '(C1494)盐加工'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C15)酒、饮料和精制茶制造业',
                children: [
                    {
                        label: '(C151)酒的制造',
                        children: [
                            {
                                label: '(C1511)酒精制造'
                            },
                            {
                                label: '(C1512)白酒制造'
                            },
                            {
                                label: '(C1513)啤酒制造'
                            },
                            {
                                label: '(C1514)黄酒制造'
                            },
                            {
                                label: '(C1515)葡萄酒制造'
                            },
                            {
                                label: '(C1519)其他酒制造'
                            },
                        ]
                    },
                    {
                        label: '(C152)饮料制造',
                        children: [
                            {
                                label: '(C1521)碳酸饮料制造'
                            },
                            {
                                label: '(C1522)瓶（罐）装饮用水制造'
                            },
                            {
                                label: '(C1523)果菜汁及果菜汁饮料制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C16)烟草制品业',
                children: [
                    {
                        label: '(C1610)烟叶复烤'
                    },
                    {
                        label: '(C1620)卷烟制造'
                    },
                    {
                        label: '(C1690)其他烟草制品制造'
                    },
                ]
            },
            {
                label: '(C17)纺织业',
                children: [
                    {
                        label: '(C171)棉纺织及印染精加工',
                        children: [
                            {
                                label: '(C1711)棉纺纱加工'
                            },
                            {
                                label: '(C1712)棉织造加工'
                            },
                            {
                                label: '(C1713)棉印染精加工'
                            },
                        ]
                    },
                    {
                        label: '(C172)毛纺织及染整精加工',
                        children: [
                            {
                                label: '(C1721)毛条和毛纱线加工'
                            },
                            {
                                label: '(C1722)毛织造加工'
                            },
                            {
                                label: '(C1723)毛染整精加工'
                            },
                        ]
                    },
                    {
                        label: '(C173)麻纺织及染整精加工',
                        children: [
                            {
                                label: '(C1731)麻纤维纺前加工和纺纱'
                            },
                            {
                                label: '(C1732)麻织造加工'
                            },
                            {
                                label: '(C1733)麻染整精加工'
                            },
                        ]
                    },
                    {
                        label: '(C174)丝绢纺织及印染精加工',
                        children: [
                            {
                                label: '(C1741)缫丝加工'
                            },
                            {
                                label: '(C1742)绢纺和丝织加工'
                            },
                            {
                                label: '(C1743)丝印染精加工'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C18)纺织服装、服饰业',
                children: [
                    {
                        label: '(C1810)机织服装制造'
                    },

                    {
                        label: '(C1830)服饰制造'
                    },
                ]
            },
            {
                label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
                children: [
                    {
                        label: '(C1910)皮革鞣制加工'
                    },
                    {
                        label: '(C192)皮革制品制造',
                        children: [
                            {
                                label: '(C1921)皮革服装制造'
                            },
                            {
                                label: '(C1922)皮箱、包（袋）制造'
                            },
                            {
                                label: '(C1923)皮手套及皮装饰制品制造'
                            },
                            {
                                label: '(C1929)其他皮革制品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C20)木材加工和木、竹、藤、棕、草制品业',
                children: [
                    {
                        label: '(C201)木材加工',
                        children: [
                            {
                                label: '(C2011)锯材加工'
                            },
                            {
                                label: '(C2012)木片加工'
                            },
                        ]
                    },
                    {
                        label: '(C202)人造板制造',
                    },
                    {
                        label: '(C203)木制品制造',
                    },
                    {
                        label: '(C204)竹、藤、棕、草等制品制造',
                        children: [
                            {
                                label: '(C2041)竹制品制造'
                            },
                            {
                                label: '(C2042)藤制品制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C21)家具制造业',
                children: [
                    {
                        label: '(C2110)木质家具制造'
                    },
                    {
                        label: '(C2120)竹、藤家具制造'
                    },
                    {
                        label: '(C2130)金属家具制造'
                    },
                    {
                        label: '(C2140)塑料家具制造'
                    },
                    {
                        label: '(C2190)其他家具制造'
                    },
                ]
            },
            {
                label: '(C22)造纸和纸制品业',
                children: [
                    {
                        label: '(C221)纸浆制造',
                    },
                    {
                        label: '(C222)造纸',
                    },
                    {
                        label: '(C223)纸制品制造',
                    },
                ]
            },
            {
                label: '(C23)印刷和记录媒介复制业',
                children: [
                    {
                        label: '(C231)印刷',
                        children: [
                            {
                                label: '(C2311)书、报刊印刷'
                            },
                            {
                                label: '(C2319)包装装潢及其他印刷'
                            },
                        ]
                    },
                    {
                        label: '(C2330)记录媒介复制'
                    },
                ]
            },
            {
                label: '(C24)文教、工美、体育和娱乐用品制造业',
                children: [
                    {
                        label: '(C241)文教办公用品制造',
                        children: [
                            {
                                label: '(C2411)文具制造'
                            },
                            {
                                label: '(C2412)笔的制造'
                            },
                        ]
                    },
                    {
                        label: '(C243)工艺美术品制造',
                    },
                    {
                        label: '(C244)体育用品制造',
                    },
                ]
            },
            {
                label: '(C25)石油加工、炼焦和核燃料加工业',
                children: [
                    {
                        label: '(C251)精炼石油产品制造',
                        children: [
                            {
                                label: '(C2511)原油加工及石油制品制造'
                            },
                            {
                                label: '(C2512)人造原油制造'
                            },
                        ]
                    },
                    {
                        label: '(C2520)炼焦'
                    },
                ]
            },
            {
                label: '(C26)化学原料和化学制品制造业',
                children: [
                    {
                        label: '(C261)基础化学原料制造',
                        children: [
                            {
                                label: '(C2611)无机酸制造'
                            },
                            {
                                label: '(C2612)无机碱制造'
                            },
                            {
                                label: '(C2613)无机盐制造'
                            },
                            {
                                label: '(C2614)有机化学原料制造'
                            },
                        ]
                    },
                    {
                        label: '(C262)肥料制造',
                        children: [
                            {
                                label: '(C2621)氮肥制造'
                            },
                            {
                                label: '(C2622)磷肥制造'
                            },
                            {
                                label: '(C2623)钾肥制造'
                            },
                            {
                                label: '(C2624)复混肥料制造'
                            },
                        ]
                    },
                    {
                        label: '(C263)农药制造',
                        children: [
                            {
                                label: '(C2631)化学农药制造'
                            },
                            {
                                label: '(C2632)生物化学农药及微生物农药制造'
                            },
                        ]
                    },

                    {
                        label: '(C268)日用化学产品制造',
                        children: [
                            {
                                label: '(C2681)肥皂及合成洗涤剂制造'
                            },
                            {
                                label: '(C2682)化妆品制造'
                            },
                            {
                                label: '(C2683)口腔清洁用品制造'
                            },
                            {
                                label: '(C2684)香料、香精制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C27)医药制造业',
                children: [
                    {
                        label: '(C2710)化学药品原料药制造'
                    },
                    {
                        label: '(C2720)化学药品制剂制造'
                    },
                    {
                        label: '(C2730)中药饮片加工'
                    },
                    {
                        label: '(C2740)中成药生产'
                    },
                    {
                        label: '(C2750)兽用药品制造'
                    },
                    {
                        label: '(C2760)生物药品制造'
                    },
                    {
                        label: '(C2770)卫生材料及医药用品制造'
                    },
                ]
            },
            {
                label: '(C28)化学纤维制造业',
                children: [
                    {
                        label: '(C281)纤维素纤维原料及纤维制造',
                        children: [
                            {
                                label: '(C2811)化纤浆粕制造'
                            },
                            {
                                label: '(C2812)人造纤维（纤维素纤维）制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C29)橡胶和塑料制品业',
                children: [
                    {
                        label: '(C291)橡胶制品业',
                        children: [
                            {
                                label: '(C2911)轮胎制造'
                            },
                            {
                                label: '(C2912)橡胶板、管、带制造'
                            },
                            {
                                label: '(C2915)日用及医用橡胶制品制造'
                            },
                        ]
                    },
                    {
                        label: '(C292)塑料制品业',
                        children: [
                            {
                                label: '(C2921)塑料薄膜制造'
                            },
                            {
                                label: '(C2922)塑料板、管、型材制造'
                            },
                            {
                                label: '(C2923)塑料丝、绳及编织品制造'
                            },
                            {
                                label: '(C2924)泡沫塑料制造'
                            },
                            {
                                label: '(C2925)塑料人造革、合成革制造'
                            },
                            {
                                label: '(C2926)塑料包装箱及容器制造'
                            },
                            {
                                label: '(C2927)日用塑料制品制造'
                            },
                            {
                                label: '(C2928)塑料零件制造'
                            },
                            {
                                label: '(C2929)其他塑料制品制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C30)非金属矿物制品业',
                children: [
                    {
                        label: '(C301)水泥、石灰和石膏制造',
                        children: [
                            {
                                label: '(C3011)水泥制造'
                            },
                        ]
                    },
                    {
                        label: '(C302)石膏、水泥制品及类似制品制造',
                    },
                    {
                        label: '(C303)砖瓦、石材等建筑材料制造',
                        children: [
                            {
                                label: '(C3032)建筑陶瓷制品制造'
                            },
                            {
                                label: '(C3033)建筑用石加工'
                            },
                            {
                                label: '(C3035)隔热和隔音材料制造'
                            },
                            {
                                label: '(C3039)其他建筑材料制造'
                            },
                        ]
                    },
                    {
                        label: '(C304)玻璃制造',
                        children: [
                            {
                                label: '(C3041)平板玻璃制造'
                            },
                        ]
                    },
                    {
                        label: '(C305)玻璃制品制造',
                        children: [
                            {
                                label: '(C3051)技术玻璃制品制造'
                            }, {
                                label: '(C3052)光学玻璃制造'
                            },
                            {
                                label: '(C3054)日用玻璃制品制造'
                            },
                            {
                                label: '(C3056)玻璃保温容器制造'
                            },
                            {
                                label: '(C3057)制镜及类似品加工'
                            },
                        ]
                    },
                    {
                        label: '(C306)玻璃纤维和玻璃纤维增强塑料制品制造',
                    },
                ]
            },
            {
                label: '(C31)黑色金属冶炼和压延加工业',
                children: [
                    {
                        label: '(C3110)炼铁'
                    },
                    {
                        label: '(C3120)炼钢'
                    },
                    {
                        label: '(C3140)钢压延加工'
                    },
                    {
                        label: '(C3150)铁合金冶炼'
                    },
                ]
            },
            {
                label: '(C32)有色金属冶炼和压延加工业',
                children: [
                    {
                        label: '(C321)常用有色金属冶炼',
                        children: [
                            {
                                label: '(C3211)铜冶炼'
                            },
                            {
                                label: '(C3212)铅锌冶炼'
                            },
                            {
                                label: '(C3213)镍钴冶炼'
                            },
                            {
                                label: '(C3214)锡冶炼'
                            },
                            {
                                label: '(C3215)锑冶炼'
                            },
                            {
                                label: '(C3216)铝冶炼'
                            },
                            {
                                label: '(C3217)镁冶炼'
                            },
                            {
                                label: '(C3219)其他常用有色金属冶炼'
                            },
                        ]
                    },
                    {
                        label: '(C322)贵金属冶炼',
                        children: [
                            {
                                label: '(C3221)金冶炼'
                            },
                            {
                                label: '(C3222)银冶炼'
                            },
                            {
                                label: '(C3229)其他贵金属冶炼'
                            },
                        ]
                    },
                    {
                        label: '(C323)稀有稀土金属冶炼',
                        children: [
                            {
                                label: '(C3231)钨钼冶炼'
                            },
                            {
                                label: '(C3232)稀土金属冶炼'
                            },
                            {
                                label: '(C3239)其他稀有金属冶炼'
                            },
                        ]
                    },
                    {
                        label: '(C3240)有色金属合金制造',
                    },
                    {
                        label: '(C3250)有色金属铸造',
                    },
                    {
                        label: '(C326)有色金属压延加工',
                        children: [
                            {
                                label: '(C3261)铜压延加工'
                            },
                            {
                                label: '(C3262)铝压延加工'
                            },
                            {
                                label: '(C3263)贵金属压延加工'
                            },
                            {
                                label: '(C3264)稀有稀土金属压延加工'
                            },
                            {
                                label: '(C3269)其他有色金属压延加工'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C33)金属制品业',
                children: [
                    {
                        label: '(C331)结构性金属制品制造',
                        children: [
                            {
                                label: '(C3311)金属结构制造'
                            },
                            {
                                label: '(C3312)金属门窗制造'
                            },
                        ]
                    },
                    {
                        label: '(C332)金属工具制造',
                        children: [
                            {
                                label: '(C3321)切削工具制造'
                            },
                            {
                                label: '(C3322)手工具制造'
                            },
                        ]
                    },
                    {
                        label: '(C333)集装箱及金属包装容器制造',
                    },

                    {
                        label: '(C335)建筑、安全用金属制品制造',
                        children: [
                            {
                                label: '(C3352)建筑装饰及水暖管道零件制造'
                            },
                        ]
                    },
                    {
                        label: '(C337)搪瓷制品制造',
                    },
                ]
            },
            {
                label: '(C34)通用设备制造业',
                children: [
                    {
                        label: '(C341)锅炉及原动设备制造',
                        children: [
                            {
                                label: '(C3411)锅炉及辅助设备制造'
                            },
                            {
                                label: '(C3412)内燃机及配件制造'
                            },
                            {
                                label: '(C3413)汽轮机及辅机制造'
                            },
                            {
                                label: '(C3414)水轮机及辅机制造'
                            },
                        ]
                    }, {
                        label: '(C342)金属加工机械制造',
                        children: [
                            {
                                label: '(C3421)金属切削机床制造'
                            },
                            {
                                label: '(C3422)金属成形机床制造'
                            },
                            {
                                label: '(C3423)铸造机械制造'
                            },
                            {
                                label: '(C3425)机床附件制造'
                            },
                        ]
                    },
                    {
                        label: '(C344)泵、阀门、压缩机及类似机械制造',
                        children: [
                            {
                                label: '(C3441)泵及真空设备制造'
                            },
                            {
                                label: '(C3442)气体压缩机械制造'
                            },
                            {
                                label: '(C3443)阀门和旋塞制造'
                            },
                        ]
                    },
                    {
                        label: '(C345)轴承、齿轮和传动部件制造',
                        children: [
                            {
                                label: '(C3451)轴承制造'
                            },
                        ]
                    },
                    {
                        label: '(C346)烘炉、风机、衡器、包装等设备制造',
                        children: [
                            {
                                label: '(C3462)风机、风扇制造'
                            },
                            {
                                label: '(C3463)气体、液体分离及纯净设备制造'
                            },
                            {
                                label: '(C3464)制冷、空调设备制造'
                            },
                            {
                                label: '(C3465)风动和电动工具制造'
                            },
                        ]
                    },
                    {
                        label: '(C347)文化、办公用机械制造',
                        children: [
                            {
                                label: '(C3471)电影机械制造'
                            },
                            {
                                label: '(C3472)幻灯及投影设备制造'
                            },
                            {
                                label: '(C3473)照相机及器材制造'
                            },
                            {
                                label: '(C3474)复印和胶印设备制造'
                            },
                            {
                                label: '(C3479)其他文化、办公用机械制造'
                            },
                        ]
                    },
                    {
                        label: '(C348)通用零部件制造',
                    },
                    {
                        label: '(C3490)其他通用设备制造业',
                    },
                ]
            },
            {
                label: '(C35)专用设备制造业',
                children: [
                    {
                        label: '(C351)采矿、冶金、建筑专用设备制造',
                    },
                    {
                        label: '(C352)化工、木材、非金属加工专用设备制造',
                        children: [
                            {
                                label: '(C3521)炼油、化工生产专用设备制造'
                            },
                            {
                                label: '(C3522)橡胶加工专用设备制造'
                            },
                            {
                                label: '(C3523)塑料加工专用设备制造'
                            },
                            {
                                label: '(C3524)木材加工机械制造'
                            },
                            {
                                label: '(C3525)模具制造'
                            },
                            {
                                label: '(C3529)其他非金属加工专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C354)印刷、制药、日化及日用品生产专用设备制造',
                        children: [
                            {
                                label: '(C3542)印刷专用设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C355)纺织、服装和皮革加工专用设备制造',
                    },
                    {
                        label: '(C357)农、林、牧、渔专用机械制造',
                        children: [
                            {
                                label: '(C3571)拖拉机制造'
                            },
                            {
                                label: '(C3572)机械化农业及园艺机具制造'
                            },
                            {
                                label: '(C3573)营林及木竹采伐机械制造'
                            },
                            {
                                label: '(C3574)畜牧机械制造'
                            },
                            {
                                label: '(C3575)渔业机械制造'
                            },
                            {
                                label: '(C3576)农林牧渔机械配件制造'
                            },
                            {
                                label: '(C3579)其他农、林、牧、渔业机械制造'
                            },
                        ]
                    },
                    {
                        label: '(C358)医疗仪器设备及器械制造',
                    },
                    {
                        label: '(C359)环保、社会公共服务及其他专用设备制造',
                        children: [
                            {
                                label: '(C3596)交通安全、管制及类似专用设备制造'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(C36)汽车制造业',
                children: [
                    {
                        label: '(C3610)汽车整车制造'
                    },
                    {
                        label: '(C3620)改装汽车制造'
                    },
                    {
                        label: '(C3640)电车制造'
                    }, {
                        label: '(C3650)汽车车身、挂车制造'
                    },
                    {
                        label: '(C3660)汽车零部件及配件制造'
                    },
                ]
            },
            {
                label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
                children: [
                    {
                        label: '(C371)铁路运输设备制造',
                        children: [
                            {
                                label: '(C3711)铁路机车车辆及动车组制造'
                            },
                            {
                                label: '(C3713)铁路机车车辆配件制造'
                            },
                            {
                                label: '(C3714)铁路专用设备及器材、配件制造'
                            },
                        ]
                    },
                    {
                        label: '(C373)船舶及相关装置制造',
                        children: [
                            {
                                label: '(C3731)金属船舶制造'
                            },
                            {
                                label: '(C3732)非金属船舶制造'
                            },

                        ]
                    },
                    {
                        label: '(C374)航空、航天器及设备制造',
                        children: [
                            {
                                label: '(C3742)航天器制造'
                            },
                        ]
                    },
                    {
                        label: '(C375)摩托车制造',
                        children: [
                            {
                                label: '(C3751)摩托车整车制造'
                            },
                            {
                                label: '(C3752)摩托车零部件及配件制造'
                            },
                        ]
                    },
                    {
                        label: '(C376)自行车制造',
                    },
                ]
            },
            {
                label: '(C38)电气机械和器材制造业',
                children: [
                    {
                        label: '(C381)电机制造',
                        children: [
                            {
                                label: '(C3811)发电机及发电机组制造'
                            },
                            {
                                label: '(C3812)电动机制造'
                            },
                            {
                                label: '(C3819)微电机及其他电机制造'
                            },
                        ]
                    },
                    {
                        label: '(C382)输配电及控制设备制造',
                        children: [
                            {
                                label: '(C3821)变压器、整流器和电感器制造'
                            },
                            {
                                label: '(C3822)电容器及其配套设备制造'
                            },
                            {
                                label: '(C3823)配电开关控制设备制造'
                            },
                            {
                                label: '(C3824)电力电子元器件制造'
                            },
                        ]
                    },
                    {
                        label: '(C383)电线、电缆、光缆及电工器材制造',
                        children: [
                            {
                                label: '(C3831)电线、电缆制造'
                            },
                            {
                                label: '(C3833)绝缘制品制造'
                            },
                            {
                                label: '(C3839)其他电工器材制造'
                            },
                        ]
                    },
                    {
                        label: '(C385)家用电力器具制造',
                        children: [
                            {
                                label: '(C3852)家用空气调节器制造'
                            },
                            {
                                label: '(C3853)家用通风电器具制造'
                            },
                            {
                                label: '(C3855)家用清洁卫生电器具制造'
                            },
                        ]
                    },
                    {
                        label: '(C387)照明器具制造',
                        children: [
                            {
                                label: '(C3871)电光源制造'
                            },
                            {
                                label: '(C3872)照明灯具制造'
                            },
                            {
                                label: '(C3879)灯用电器附件及其他照明器具制造'
                            },
                        ]
                    },
                    {
                        label: '(C389)其他电气机械及器材制造',
                    },

                ]
            },
            {
                label: '(C39)计算机、通信和其他电子设备制造业',
                children: [
                    {
                        label: '(C391)计算机制造',
                        children: [
                            {
                                label: '(C3911)计算机整机制造'
                            },
                            {
                                label: '(C3912)计算机零部件制造'
                            },
                            {
                                label: '(C3913)计算机外围设备制造'
                            },
                            {
                                label: '(C3919)其他计算机制造'
                            },
                        ]
                    },
                    {
                        label: '(C392)通信设备制造',
                    },
                    {
                        label: '(C393)广播电视设备制造',
                        children: [
                            {
                                label: '(C3931)广播电视节目制作及发射设备制造'
                            },
                            {
                                label: '(C3932)广播电视接收设备及器材制造'
                            },
                            {
                                label: '(C3939)应用电视设备及其他广播电视设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C3940)雷达及配套设备制造',
                    },
                    {
                        label: '(C395)视听设备制造',
                        children: [
                            {
                                label: '(C3951)电视机制造'
                            },
                            {
                                label: '(C3953)影视录放设备制造'
                            },
                        ]
                    },
                    {
                        label: '(C396)电子器件制造',
                        children: [
                            {
                                label: '(C3961)电子真空器件制造'
                            },
                            {
                                label: '(C3962)半导体分立器件制造'
                            },
                            {
                                label: '(C3963)集成电路制造'
                            },
                        ]
                    },
                    {
                        label: '(C397)电子元件制造',
                        children: [
                            {
                                label: '(C3971)电子元件及组件制造'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(C40)仪器仪表制造业',
                children: [
                    {
                        label: '(C401)通用仪器仪表制造',
                        children: [
                            {
                                label: '(C4011)工业自动控制系统装置制造'
                            },
                            {
                                label: '(C4012)电工仪器仪表制造'
                            },
                            {
                                label: '(C4013)绘图、计算及测量仪器制造'
                            },
                            {
                                label: '(C4014)实验分析仪器制造'
                            },
                            {
                                label: '(C4015)试验机制造'
                            },
                        ]
                    },
                    {
                        label: '(C402)专用仪器仪表制造',
                        children: [
                            {
                                label: '(C4021)环境监测专用仪器仪表制造'
                            },
                            {
                                label: '(C4023)导航、气象及海洋专用仪器制造'
                            },
                            {
                                label: '(C4026)教学专用仪器制造'
                            },
                            {
                                label: '(C4028)电子测量仪器制造'
                            },
                        ]
                    },
                    {
                        label: '(C4030)钟表与计时仪器制造',
                    },
                ]
            },
        ]
    },
    {
        label: '(D)电力、热力、燃气及水生产和供应业',
        children: [
            {
                label: '(D44)电力、热力生产和供应业',
                children: [
                    {
                        label: '(D441)电力生产',
                        children: [
                            {
                                label: '(D4411)火力发电'
                            },
                            {
                                label: '(D4412)水力发电'
                            },
                            {
                                label: '(D4413)核力发电'
                            },
                        ]
                    },
                    {
                        label: '(D4420)电力供应',
                    },
                ]
            },
            {
                label: '(D45)燃气生产和供应业',
                children: [
                    {
                        label: '(D4500)燃气生产和供应业'
                    }]
            },
            {
                label: '(D46)水的生产和供应业',
            }]
    },
    {
        label: '(E)建筑业',
        children: [
            {
                label: '(E47)房屋建筑业',
                children: [{
                    label: '(E4700)房屋建筑业'
                }]
            },
            {
                label: '(E48)土木工程建筑业',
                children: [
                    {
                        label: '(E481)铁路、道路、隧道和桥梁工程建筑',
                        children: [
                            {
                                label: '(E4811)铁路工程建筑'
                            },
                            {
                                label: '(E4812)公路工程建筑'
                            },
                            {
                                label: '(E4819)其他道路、隧道和桥梁工程建筑'
                            },
                        ]
                    },
                    {
                        label: '(E482)水利和内河港口工程建筑',
                        children: [
                            {
                                label: '(E4823)港口及航运设施工程建筑'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(E49)建筑安装业',
                children: [
                    {
                        label: '(E4910)电气安装'
                    },
                    {
                        label: '(E4920)管道和设备安装'
                    },
                    {
                        label: '(E4990)其他建筑安装业'
                    },
                ]
            },]
    },
    {
        label: '(F)批发和零售业',
        children: [{
            label: '(F51)批发业',
            children: [
                {
                    label: '(F511)农、林、牧产品批发',
                    children: [
                        {
                            label: '(F5111)谷物、豆及薯类批发'
                        },
                        {
                            label: '(F5112)种子批发'
                        },
                    ]
                },
                {
                    label: '(F512)食品、饮料及烟草制品批发',
                    children: [
                        {
                            label: '(F5121)米、面制品及食用油批发'
                        },
                        {
                            label: '(F5124)肉、禽、蛋、奶及水产品批发'
                        },
                        {
                            label: '(F5128)烟草制品批发'
                        },
                        {
                            label: '(F5129)其他食品批发'
                        },
                    ]
                },
                {
                    label: '(F513)纺织、服装及家庭用品批发',
                },
                {
                    label: '(F514)文化、体育用品及器材批发',
                    children: [
                        {
                            label: '(F5141)文具用品批发'
                        },
                        {
                            label: '(F5142)体育用品及器材批发'
                        },
                        {
                            label: '(F5143)图书批发'
                        },
                        {
                            label: '(F5144)报刊批发'
                        },
                    ]
                },
                {
                    label: '(F515)医药及医疗器材批发',
                    children: [
                        {
                            label: '(F5151)西药批发'
                        },
                        {
                            label: '(F5152)中药批发'
                        },
                        {
                            label: '(F5153)医疗用品及器材批发'
                        },
                    ]
                },
                {
                    label: '(F516)矿产品、建材及化工产品批发',
                    children: [
                        {
                            label: '(F5161)煤炭及制品批发'
                        },
                        {
                            label: '(F5162)石油及制品批发'
                        },
                        {
                            label: '(F5164)金属及金属矿批发'
                        },
                        {
                            label: '(F5165)建材批发'
                        },
                        {
                            label: '(F5169)其他化工产品批发'
                        },
                    ]
                },
                {
                    label: '(F517)机械设备、五金产品及电子产品批发',
                    children: [
                        {
                            label: '(F5172)汽车批发'
                        },
                        {
                            label: '(F5173)汽车零配件批发'
                        },
                        {
                            label: '(F5174)摩托车及零配件批发'
                        },
                        {
                            label: '(F5179)其他机械设备及电子产品批发'
                        },
                    ]
                },

                {
                    label: '(F519)其他批发业',
                    children: [
                        {
                            label: '(F5191)再生物资回收与批发'
                        },
                    ]
                },

            ]
        },
            {
                label: '(F52)零售业',
                children: [
                    {
                        label: '(F521)综合零售',
                    },
                    {
                        label: '(F522)食品、饮料及烟草制品专门零售',
                        children: [
                            {
                                label: '(F5221)粮油零售'
                            },
                            {
                                label: '(F5227)烟草制品零售'
                            }, {
                                label: '(F5229)其他食品零售'
                            },
                        ]
                    },
                    {
                        label: '(F523)纺织、服装及日用品专门零售',
                    },
                    {
                        label: '(F524)文化、体育用品及器材专门零售',
                        children: [
                            {
                                label: '(F5241)文具用品零售'
                            },
                            {
                                label: '(F5242)体育用品及器材零售'
                            },
                            {
                                label: '(F5243)图书、报刊零售'
                            },
                        ]
                    },
                    {
                        label: '(F525)医药及医疗器材专门零售',
                        children: [
                            {
                                label: '(F5251)药品零售'
                            },
                            {
                                label: '(F5252)医疗用品及器材零售'
                            },
                        ]
                    },
                    {
                        label: '(F526)汽车、摩托车、燃料及零配件专门零售',
                        children: [
                            {
                                label: '(F5261)汽车零售'
                            },
                            {
                                label: '(F5262)汽车零配件零售'
                            },
                            {
                                label: '(F5263)摩托车及零配件零售'
                            },

                        ]
                    },
                ]
            },
            {
                label: '(F53)商业贸易',
            }]
    },
    {
        label: '(G)交通运输、仓储和邮政业',
        children: [
            {
                label: '(G53)铁路运输业',
                children: [
                    {
                        label: '(G5310)铁路旅客运输'
                    },
                    {
                        label: '(G5320)铁路货物运输'
                    },
                ]
            },
            {
                label: '(G54)道路运输业',
                children: [
                    {
                        label: '(G541)城市公共交通运输',
                        children: [
                            {
                                label: '(G5411)公共电汽车客运'
                            },
                            {
                                label: '(G5412)城市轨道交通'
                            },
                            {
                                label: '(G5413)出租车客运'
                            },
                            {
                                label: '(G5419)其他城市公共交通运输'
                            },
                        ]
                    },
                    {
                        label: '(G5420)公路旅客运输'
                    },

                    {
                        label: '(G5430)道路货物运输'
                    },

                ]
            },
            {
                label: '(G55)水上运输业',
                children: [
                    {
                        label: '(G551)水上旅客运输',
                        children: [
                            {
                                label: '(G5511)海洋旅客运输'
                            },
                            {
                                label: '(G5512)内河旅客运输'
                            },
                            {
                                label: '(G5513)客运轮渡运输'
                            },
                        ]
                    },
                    {
                        label: '(G552)水上货物运输',
                        children: [
                            {
                                label: '(G5521)远洋货物运输'
                            },
                            {
                                label: '(G5522)沿海货物运输'
                            },
                            {
                                label: '(G5523)内河货物运输'
                            },
                        ]
                    },
                    {
                        label: '(G553)水上运输辅助活动',
                        children: [
                            {
                                label: '(G5531)客运港口'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(G56)航空运输业',
                children: [
                    {
                        label: '(G561)航空客货运输',
                        children: [
                            {
                                label: '(G5611)航空旅客运输'
                            },
                            {
                                label: '(G5612)航空货物运输'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(G59)仓储业',
                children: [
                    {
                        label: '(G591)谷物、棉花等农产品仓储',
                        children: [
                            {
                                label: '(G5911)谷物仓储'
                            },
                            {
                                label: '(G5912)棉花仓储'
                            },
                            {
                                label: '(G5919)其他农产品仓储'
                            },
                        ]
                    },
                    {
                        label: '(G5990)其他仓储业'
                    },
                ]
            },
        ]
    },
    {
        label: '(H)住宿和餐饮业',
        children: [{
            label: '(H61)住宿业',
            children: [
                {
                    label: '(H6110)旅游饭店'
                },
                {
                    label: '(H6120)一般旅馆'
                },
            ]
        }, {
            label: '(H62)餐饮业',
            children: [
                {
                    label: '(H6210)正餐服务'
                },
                {
                    label: '(H6220)快餐服务'
                },
                {
                    label: '(H623)饮料及冷饮服务',
                    children: [
                        {
                            label: '(H6239)其他饮料及冷饮服务'
                        },
                    ]
                },
                {
                    label: '(H629)其他餐饮业',
                },
            ]
        }]
    },
    {
        label: '(I)信息传输、软件和信息技术服务业',
        children: [
            {
                label: '(I63)电信、广播电视和卫星传输服务',
                children: [
                    {
                        label: '(I631)电信',
                        children: [
                            {
                                label: '(I6311)固定电信服务'
                            },
                            {
                                label: '(I6312)移动电信服务'
                            },
                            {
                                label: '(I6319)其他电信服务'
                            },
                        ]
                    },

                ]
            },
            {
                label: '(I65)软件和信息技术服务业',
            }]
    },
    {
        label: '(K)房地产业',
        children: [{
            label: '(K70)房地产业',
            children: [
                {
                    label: '(K7010)房地产开发经营'
                },
                {
                    label: '(K7020)物业管理'
                },
                {
                    label: '(K7030)房地产中介服务'
                },
                {
                    label: '(K7040)自有房地产经营活动'
                },
                {
                    label: '(K7090)其他房地产业'
                },

            ]
        },]
    }, {
        label: '(L)租赁和商务服务业',
        children: [{
            label: '(L72)商务服务业',
            children: [
                {
                    label: '(L723)咨询与调查',
                    children: [
                        {
                            label: '(L7233)社会经济咨询'
                        },
                    ]
                },
            ]
        }]
    },
    {
        label: '(M)科学研究和技术服务业',
        children: [
            {
                label: '(M747)地质勘查',
            },
            {
                label: '(M748)工程技术',
                children: [
                    {
                        label: '(M7482)工程勘察设计'
                    },
                    {
                        label: '(M7483)规划管理'
                    },
                ]
            },
            {
                label: '(N77)生态保护和环境治理业',
                children: [
                    {
                        label: '(N771)生态保护',
                        children: [
                            {
                                label: '(N7711)自然保护区管理'
                            },
                            {
                                label: '(N7712)野生动物保护'
                            },
                            {
                                label: '(N7713)野生植物保护'
                            },
                            {
                                label: '(N7719)其他自然保护'
                            },
                        ]
                    },
                    {
                        label: '(N772)环境治理业',
                        children: [
                            {
                                label: '(N7721)水污染治理'
                            },
                            {
                                label: '(N7722)大气污染治理'
                            },
                            {
                                label: '(N7723)固体废物治理'
                            },
                            {
                                label: '(N7724)危险废物治理'
                            },
                            {
                                label: '(N7725)放射性废物治理'
                            },
                            {
                                label: '(N7729)其他污染治理'
                            },
                        ]
                    },
                ]
            },
            {
                label: '(N78)公共设施管理业',
                children: [
                    {
                        label: '(N7810)市政设施管理'
                    },
                    {
                        label: '(N7840)绿化管理'
                    },
                    {
                        label: '(N785)公园和游览景区管理',
                        children: [
                            {
                                label: '(N7852)游览景区管理'
                            },
                        ]
                    },
                ]
            },
        ]
    },
    {
        label: '(Q)卫生和社会工作',
        children: [{
            label: '(Q84)社会工作',
        }]
    },
    {
        label: '(R)文化、体育和娱乐业',
        children: [
            {
                label: '(R87)文化艺术业',
            },
        ]
    },
    // {
    //   label: '一、工业',
    //   children: [
    //     {
    //     label: '1、煤炭工业▲▲',
    //     },
    //     {
    //       label: '2、石油石化工业',
    //     children: [
    //       {
    //       label: '（1）天然原油天然气开采业'
    //     },
    //     {
    //       label: '（1）天然原油天然气开采业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '3、冶金工业',
    //   children: [
    //     {
    //     label: '（1）黑色金属矿采选业▲'
    //   },
    //   {
    //     label: '（2）有色金属矿采选业▲'
    //   },
    //   {
    //     label: '（3）黑色金属冶炼业▲'
    //   },
    //   {
    //     label: '（3）黑色金属冶炼业▲'
    //   },
    // ]
    // },
    // {
    //   label: '4、建材工业',
    //   children: [
    //     {
    //     label: '（1）建筑用矿石采选业'
    //   },
    //   {
    //     label: '（2）水泥制造业'
    //   },
    //   {
    //     label: '（3）水泥及石膏制品制造业'
    //   },
    //   {
    //     label: '（4）砖瓦石材及其它建筑材料制造业'
    //   },
    //   {
    //     label: '（5）平板玻璃制品业'
    //   },
    //   {
    //     label: '（6）结构性金属制品业'
    //   },
    //   {
    //     label: '（7）建筑用金属业'
    //   },
    // ]
    // },
    // {
    //   label: '5、化学工业',
    //   children: [
    //     {
    //     label: '（1）基础化学原料制造业'
    //   },  {
    //     label: '（2）肥料制造业'
    //   },
    //   {
    //     label: '（3）日用化学产品制造业'
    //   },
    //   {
    //     label: '（4）化纤制造业'
    //   },
    //   {
    //     label: '（5）橡胶制品业'
    //   },
    //   {
    //     label: '（5）橡胶制品业'
    //   },
    //   {
    //     label: '（7）农药制造业'
    //   },
    // ]
    // },
    // {
    //   label: '6、森林工业'
    // },
    // {
    //   label: '7、食品工业',
    //   children: [
    //     {
    //     label: '（1）食品加工业'
    //   },
    //   {
    //     label: '（2）食品制造业'
    //   },
    // ]
    // },
    // {
    //   label: '8、烟草工业',
    //   children: [
    //     {
    //     label: '（1）卷烟制造业'
    //   },
    // ]
    // },
    // {
    //   label: '9、纺织工业',
    //   children: [
    //     {
    //     label: '（1）棉化纤纺织业'
    //   },
    //   {
    //     label: '（2）毛纺织业'
    //   },
    //   {
    //     label: '（3）麻纺织业'
    //   },
    //   {
    //     label: '（4）丝绢纺织业'
    //   },
    // ]
    // },
    // {
    //   label: '10、医药工业',
    //   children: [
    //     {
    //     label: '（1）化学药品制造业'
    //   },
    //    {
    //     label: '（2）中药材及中成药加工业'
    //   },
    // ]
    // },
    // {
    //   label: '11、机械工业',
    //   children: [
    //     {
    //     label: '（1）金属制品业',
    //     children: [
    //       {
    //       label: '①金属工具制造业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '（2）通用设备制造业▲',
    //     children: [
    //       {
    //       label: '①锅炉及原动机制造业'
    //     },
    //     {
    //       label: '②金属加工机械制造业'
    //     },
    //     {
    //       label: '③其它通用设备制造业'
    //     },
    //     {
    //       label: '④轴承制造业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '（3）专用设备制造业',
    //     children: [
    //       {
    //       label: '①冶金矿山建筑设备制造'
    //     },
    //     {
    //       label: '②化工木材非金属加工设备制造业'
    //     },
    //     {
    //       label: '③轻纺设备制造业'
    //     },
    //     {
    //       label: '④农林牧渔水利业机械制造业'
    //     },
    //     {
    //       label: '⑤医疗仪器设备制造业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '（4）交通运输设备制造业',
    //     children: [
    //       {
    //       label: '①铁路运输设备制造业▲'
    //     },
    //     {
    //       label: '②汽车制造业▲'
    //     },
    //     {
    //       label: '③摩托车制造业'
    //     },
    //     {
    //       label: '④自行车制造业'
    //     },
    //     {
    //       label: '⑤船舶制造业'
    //     },
    //     {
    //       label: '⑥航空器制造业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '（5）电气机械及器材制造业',
    //     children: [
    //       {
    //       label: '①电机制造业▲'
    //     },
    //     {
    //       label: '②输配电及控制设备制造业'
    //     },
    //     {
    //       label: '③电工器材制造业'
    //     },
    //     {
    //       label: '④家用电器制造业'
    //     },
    //     {
    //       label: '⑤照明器具制造业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '（6）仪器仪表及文化办公用制造业',
    //     children: [
    //       {
    //       label: '①通用仪器仪表制造业'
    //     },
    //     {
    //       label: '②专用仪器仪表制造业'
    //     },
    //     {
    //       label: '③文化办公用机械制造业'
    //     },
    //     {
    //       label: '④钟表制造业'
    //     },
    //   ]
    //   },
    // ]
    // },
    // {
    //   label: '12、电子工业',
    //   children: [
    //     {
    //     label: '（1）通信设备制造业'
    //   },
    //   {
    //     label: '（2）广播电视设备制造业'
    //   },
    //   {
    //     label: '（3）电子计算机制造业'
    //   },
    //   {
    //     label: '（4）电子元器件制造业'
    //   },
    //   {
    //     label: '（5）家用影视设备制造业'
    //   },
    // ]
    // },
    // {
    //   label: '13、电力燃气工业',
    //   children: [
    //     {
    //     label: '（1）电力生产业',
    //     children: [
    //       {
    //       label: '①火力发电业'
    //     },
    //     {
    //       label: '②水力发电业▲'
    //     },
    //   ]
    //   },
    //   {
    //     label: '（2）电力供应业'
    //   },
    //   {
    //     label: '（3）燃气生产和供应业'
    //   },
    // ]
    // },
    // {
    //   label: '14、水生产与供应业'
    // },
    // {
    //   label: '15、轻工业',
    //   children: [
    //     {
    //     label: '（1）采盐业'
    //   },
    //   {
    //     label: '（2）酒和饮料制造业',
    //     children: [
    //       {
    //       label: '①白酒制造业▲'
    //     },
    //     {
    //       label: '②啤酒制造业▲'
    //     },
    //     {
    //       label: '③制茶业'
    //     },

    //   ]
    //   },
    //   {
    //     label: '（3）服装鞋帽制造业'
    //   },
    //   {
    //     label: '（4）皮革毛皮羽绒及其制品业'
    //   },
    //   {
    //     label: '（5）家具制造业'
    //   },
    //   {
    //     label: '（6）造纸及纸制品业'
    //   },
    //   {
    //     label: '（7）印刷业记录媒介的复制业'
    //   },
    //   {
    //     label: '（8）文教体育用品制造业'
    //   },
    //   {
    //     label: '（9）工艺品及其它制造业'
    //   },
    // ]
    // },
    //  ]
    // },
    // {
    //   label: '二、建筑业',
    //   children: [
    //     {
    //     label: '1、房屋和土木工程建筑业',
    //     children: [
    //       {
    //       label: '（1）房屋建筑业'
    //     },
    //     {
    //       label: '（2）土木工程建筑业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '2、建筑安装业'
    //   },
    //   {
    //     label: '3、建筑装饰业'
    //   },
    // ]
    // },
    // {
    //   label: '三、交通运输仓储及邮政业',
    //   children: [
    //     {
    //     label: '1、铁路运输业'
    //   },
    //   {
    //     label: '2、道路运输业'
    //   },
    //   {
    //     label: '3、城市公共交通业'
    //   },
    //   {
    //     label: '4、水上运输业'
    //   },
    //   {
    //     label: '5、港口业▲'
    //   },
    //   {
    //     label: '6、航空运输业'
    //   },
    //   {
    //     label: '7、仓储业'
    //   },
    // ]
    // },
    // {
    //   label: '四、信息技术服务业',
    //   children: [
    //     {
    //     label: '1、电信业'
    //   },
    //   {
    //     label: '2、计算机服务及软件业'
    //   },
    // ]
    // },
    // {
    //   label: '五、批发和零售贸易业',
    //   children: [
    //     {
    //     label: '1、商业贸易',
    //     children: [
    //       {
    //       label: '（1）商业批发'
    //     },
    //     {
    //       label: '（2）商业零售'
    //     },
    //     {
    //       label: '（3）图书报刊批发及零售业'
    //     },
    //   ]
    //   },
    //   {
    //     label: '2、粮食业',
    //     children: [
    //       {
    //       label: '（1）粮油批发'
    //     },
    //     {
    //       label: '（2）粮油零售'
    //     },
    //     {
    //       label: '（3）粮油仓储'
    //     },
    //   ]
    //   },
    // {
    //   label: '3、物资贸易',
    //   children: [
    //     {
    //     label: '（1）物资批发'
    //   },
    //   {
    //     label: '（2）物资零售'
    //   },
    // ]
    // },
    // ]
    // },
    // {
    //   label: '六、住宿和餐饮业',
    //   children: [
    //     {
    //     label: '1、住宿业'
    //   },
    //   {
    //     label: '2、餐饮业'
    //   },
    // ]
    // },
    // {
    //   label: '七、房地产业',
    //   children: [
    //     {
    //     label: '1、房地产开发'
    //   },
    //   {
    //     label: '2、物业管理业'
    //   },
    // ]
    // },
    // {
    //   label: '八、社会服务业',
    //   children: [
    //     {
    //     label: '1、信息咨询服务业'
    //   },
    //   {
    //     label: '2、公共设施管理业'
    //   },
    // ]
    // },
    // {
    //   label: '九、传播与文化业',
    //   children: [
    //     {
    //     label: '1、出版业'
    //   },
    //   {
    //     label: '2、广播电影电视业'
    //   },
    //   {
    //     label: '3、文化艺术业'
    //   },
    // ]
    // },
    // {
    //   label: '十、农林牧渔业',
    //   children: [
    //     {
    //     label: '1、农业'
    //   },
    //   {
    //     label: '2、林业'
    //   },
    //   {
    //     label: '3、畜牧业'
    //   },
    //   {
    //     label: '4、渔业'
    //   },
    // ]
    // },
    // {
    //   label: '十一、地质勘查业'
    // },
    // {
    //   label: '十二、科研设计'
    // },
    // {
    //   label: '十三、外贸企业'
    // },
    // {
    //   label: '十四、投资公司'
    // },
    // {
    //   label: '十五、高速公路'
    // },
    // {
    //   label: '十六、大旅游'
    // },
    // {
    //   label: '十七、地方铁路'
    // },
    // {
    //   label: '十八、机场▲'
    // },


]


let tableData1 = [
    {
        "field1": "一、盈利能力状况",

    },
    {
        "field1": "净资产收益率(％)",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
    },
    {
        "field1": "总资产报酬率(％)",
        "field2": "8.8",
        "field3": "6.2",
        "field4": "2",
        "field5": "-2.8",
        "field6": "-8.7",
    },
    {
        "field1": "销售(营业)利润率(％)",
        "field2": "19.1",
        "field3": "14.5",
        "field4": "7.6",
        "field5": "2.4",
        "field6": "-4.5",
    },
    {
        "field1": "盈余现金保障倍数",
        "field2": "7",
        "field3": "4.4",
        "field4": "0.9",
        "field5": "-1.4",
        "field6": "-3.8",
    },
    {
        "field1": "成本费用利润率(％)",
        "field2": "8.6",
        "field3": "6",
        "field4": "2.4",
        "field5": "-9.9",
        "field6": "-24.3",
    },
    {
        "field1": "资本收益率(％)",
        "field2": "12.1",
        "field3": "8.3",
        "field4": "2.9",
        "field5": "-4.6",
        "field6": "-12.5",
    },
    {
        "field1": "二、资产质量状况",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
    },
    {
        "field1": "总资产周转率(次)",
        "field2": "1.8",
        "field3": "1.2",
        "field4": "0.8",
        "field5": "0.5",
        "field6": "0.3",
    },
    {
        "field1": "应收账款周转率(次)",
        "field2": "18.9",
        "field3": "14.9",
        "field4": "9.6",
        "field5": "5.7",
        "field6": "4.1",
    },
    {
        "field1": "不良资产比率(％)",
        "field2": "0.6",
        "field3": "1.9",
        "field4": "5.5",
        "field5": "11.9",
        "field6": "16.2",
    },
    {
        "field1": "流动资产周转率(次)",
        "field2": "2.3",
        "field3": "1.8",
        "field4": "1",
        "field5": "0.8",
        "field6": "0.6",
    },
    {
        "field1": "资产现金回收率(％)",
        "field2": "8.9",
        "field3": "5",
        "field4": "1.2",
        "field5": "-3.1",
        "field6": "-7.4",
    },
    {
        "field1": "三、债务风险状况",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
    },
    {
        "field1": "资产负债率(％)",
        "field2": "55",
        "field3": "60",
        "field4": "65",
        "field5": "75",
        "field6": "90",
    },
    {
        "field1": "已获利息倍数",
        "field2": "5.2",
        "field3": "3.5",
        "field4": "2.1",
        "field5": "0.2",
        "field6": "-6.5",
    },
    {
        "field1": "速动比率(％)",
        "field2": "138.6",
        "field3": "114.5",
        "field4": "79.9",
        "field5": "65.1",
        "field6": "42.2",
    },
    {
        "field1": "现金流动负债比率(％)",
        "field2": "13.9",
        "field3": "7.5",
        "field4": "3",
        "field5": "-3.6",
        "field6": "-9.3",
    },
    {
        "field1": "带息负债比率(％)",
        "field2": "23.4",
        "field3": "33.3",
        "field4": "45.2",
        "field5": "57.2",
        "field6": "80.7",
    },
    {
        "field1": "或有负债比率(％)",
        "field2": "1.1",
        "field3": "2.1",
        "field4": "6.8",
        "field5": "15.5",
        "field6": "24.1",
    },
    {
        "field1": "四、经营増长状况"
    },
    {
        "field1": "销售(营业)增长率(％)",
        "field2": "28.5",
        "field3": "19.1",
        "field4": "12.7",
        "field5": "3.1",
        "field6": "-7",
    },
    {
        "field1": "资本保值增值率(％)",
        "field2": "108.3",
        "field3": "105.4",
        "field4": "102.8",
        "field5": "96.5",
        "field6": "90.4",
    },
    {
        "field1": "销售(营业)利润增长率(％)",
        "field2": "21.4",
        "field3": "12.9",
        "field4": "4.6",
        "field5": "-13.3",
        "field6": "-25.9",
    },
    {
        "field1": "总资产增长率(％)",
        "field2": "16.6",
        "field3": "10.9",
        "field4": "5.2",
        "field5": "-2.2",
        "field6": "-7.1",
    },
    {
        "field1": "技术投入比率(％)",
        "field2": "1.6",
        "field3": "1.2",
        "field4": "0.8",
        "field5": "0.5",
        "field6": "0.2",
    },
    {
        "field1": "五、补充资料"
    },
    {
        "field1": "存货周转率(次)",
        "field2": "14.6",
        "field3": "7.1",
        "field4": "3.2",
        "field5": "2.2",
        "field6": "1.5",
    },
    {
        "field1": "两金占流动资产比重(％)",
        "field2": "16.1",
        "field3": "34.6",
        "field4": "44.2",
        "field5": "51.1",
        "field6": "66.5",
    },
    {
        "field1": "成本费用占营业总收入比重(％)",
        "field2": "73.3",
        "field3": "87.3",
        "field4": "99.1",
        "field5": "107.8",
        "field6": "117.8",
    },
    {
        "field1": "经济增加值率(％)",
        "field2": "7",
        "field3": "3.3",
        "field4": "-1",
        "field5": "-7.3",
        "field6": "-12",
    },
    {
        "field1": "EBITDA 率(%)",
        "field2": "4",
        "field3": "2.4",
        "field4": "7.8",
        "field5": "1.2",
        "field6": "5.4",
    },
    {
        "field1": "资本积累率(％)",
        "field2": "29.4",
        "field3": "18.9",
        "field4": "3.6",
        "field5": "-1.2",
        "field6": "-12.8",
    },
    {
        "field1": "三年资本平均增长率（%）",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
    },
    {
        "field1": "三年销售平均增长率（%）",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
    },
    {
        "field1": "不良资产比率(％)",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
    },
    {
        "field1": "期间费用占营业收入的比率（%）",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
    },
]
let tableData2 = [
    {
        "field1": "一、盈利能力状况",

    },
    {
        "field1": "销售净利率(％)",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "净资产收益率(％)",
        "field2": "8.8",
        "field3": "6.2",
        "field4": "2",
        "field5": "-2.8",
        "field6": "-8.7",
        "field7": "-9.5",
    },
    {
        "field1": "总资产收益率(％)",
        "field2": "29.4",
        "field3": "18.9",
        "field4": "3.6",
        "field5": "-1.2",
        "field6": "-12.8",
        "field7": "-9.5",
    },
    {
        "field1": "总资产报酬率(％)",
        "field2": "7",
        "field3": "3.3",
        "field4": "-1",
        "field5": "-7.3",
        "field6": "-12",
        "field7": "5.5",
    },
    {
        "field1": "销售(营业)利润率(％)",
        "field2": "6",
        "field3": "3.3",
        "field4": "-1",
        "field5": "-7.3",
        "field6": "-12",
        "field7": "5.5",
    },
    {
        "field1": "盈余现金保障倍数",
        "field2": "2",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-5.3",
        "field6": "-12",
        "field7": "5.5",
    },
    {
        "field1": "成本费用利润率(％)",
        "field2": "5",
        "field3": "3.3",
        "field4": "-4",
        "field5": "-7.3",
        "field6": "-12",
        "field7": "5.5",
    },
    {
        "field1": "资本收益率(％)",
        "field2": "2",
        "field3": "3.3",
        "field4": "-3",
        "field5": "-5.3",
        "field6": "-12",
        "field7": "3.5",
    },
    {
        "field1": "三年平均净资产收益率(％)",
        "field2": "2",
        "field3": "3.3",
        "field4": "-5",
        "field5": "7.3",
        "field6": "-72",
        "field7": "1.5",
    },
    {
        "field1": "三年平均销售利润率(％)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "三年平均总资产报酬率(％)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },

    {
        "field1": "二、资产质量状况",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "总资产周转率(次)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "应收账款周转率(次)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "应付账款周转率(次)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "预收账款周转率(次)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "预付账款周转率(次)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "存货周转率（次）",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "流动资产周转率(次)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "总资产周转天数(天)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "应收账款周转天数(天)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "应付账款周转天数(天)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "预收账款周转天数(天)",
        "field2": "4",
        "field3": "2.3",
        "field4": "-1",
        "field5": "-4.3",
        "field6": "-32",
        "field7": "5.5",
    },
    {
        "field1": "预付账款周转天数(天)"
    },
    {
        "field1": "存货周转天数(天)"
    },
    {
        "field1": "流动资产周转天数(天)"
    },
    {
        "field1": "不良资产比率(％)"
    },
    {
        "field1": "资产现金回收率(％)"
    },
    {
        "field1": "三年平均存货周转率(％)"
    },
    {
        "field1": "三年平均应收账款周转率(％)"
    },
    {
        "field1": "三年平均总资产周转率(％)"
    },
    {
        "field1": "三、债务风险状况"
    },
    {
        "field1": "资产负债率(％)"
    },
    {
        "field1": "已获利息倍数"
    },
    {
        "field1": "速动比率(％)"
    },
    {
        "field1": "现金比率(％)"
    },
    {
        "field1": "现金流动负债比率(％)"
    },
    {
        "field1": "产权比率（％)"
    },
    {
        "field1": "带息负债比率(％)"
    },
    {
        "field1": "或有负债比率(％)"
    },
    {
        "field1": "四、经营増长状况"
    },
    {
        "field1": "销售(营业)增长率(％)"
    },
    {
        "field1": "资本保值增值率(％)"
    },
    {
        "field1": "销售(营业)利润增长率(％)"
    },
    {
        "field1": "总资产增长率(％)"
    },
    {
        "field1": "技术投入比率(％)"
    },
    {
        "field1": "销售毛利率%"
    },
    {
        "field1": "销售净利率%"
    },
    {
        "field1": "三年销售(营业)收入平均增长率%"
    },
    {
        "field1": "五、补充资料"
    },
    {
        "field1": "两金占流动资产比重(％)"
    },
    {
        "field1": "成本费用占营业总收入比重(％)"
    },
    {
        "field1": "经济增加值率(％)"
    },
    {
        "field1": "EBITDA 率(%)"
    },
    {
        "field1": "资本积累率(％)"
    },
    {
        "field1": "三年平均（负债总额-预收账款）/三年平均（利润总额+利息费用）"
    },
    {
        "field1": "六、收入类"
    },
    {
        "field1": "营业收入"
    },
    {
        "field1": "净利润"
    },
    {
        "field1": "营业税金及附加"
    },
    {
        "field1": "投资收益"
    },
    {
        "field1": "实现利润增长率(%)"
    },
    {
        "field1": "营业税金及附加"
    },
    {
        "field1": "投资收益"
    },
    {
        "field1": "实现利润增长率(%)"
    },
    {
        "field1": "营业利润增长率(%)"
    },
    {
        "field1": "营业外利润增长率(%)"
    },
    {
        "field1": "营业收入增长率(%)"
    },
    {
        "field1": "净利润增长率(%)"
    },
    {
        "field1": "营业收入净额增长率(%)"
    },
    {
        "field1": "主营业务利润/营业收入增长额比例"
    },
    {
        "field1": "三年利润平均增长率(%)"
    },
    {
        "field1": "七、资产类"
    },
    {
        "field1": "资产总计"
    },
    {
        "field1": "总资产增长率(%)"
    },
    {
        "field1": "流动资产合计"
    },
    {
        "field1": "流动资产增长率(%)"
    },
    {
        "field1": "货币资金"
    },
    {
        "field1": "货币资金/营业收入比例"
    },
    {
        "field1": "存货"
    },
    {
        "field1": "存货占资产比例"
    },
    {
        "field1": "存货占营业收入收入比例"
    },
    {
        "field1": "存货/营业收入增长额比例"
    },
    {
        "field1": "存货/固定资产原值增长率比例"
    },
    {
        "field1": "应收账款"
    }, 
    {
        "field1": "应收账款增长率(%)"
    },
    {
        "field1": "应收账款/营业收入增长额比例"
    },
    {
        "field1": "应收账款占总资产比例"
    },
    {
        "field1": "应收账款/固定资产原值增长率比例"
    },
    {
        "field1": "其他应收款占营业收入比率(%)"
    },
    {
        "field1": "其他应收款"
    },
    {
        "field1": "其他应收占资产比"
    }, 
    {
        "field1": "固定资产"
    },
    {
        "field1": "固定资产/总资产占比"
    },
    {
        "field1": "固定资产成新率(%)"
    },
    {
        "field1": "固定资产更新率(%)"
    },
    {
        "field1": "固定资产增长率(%)"
    },
    {
        "field1": "可供出售金融资产"
    },
    {
        "field1": "长期股权投资比例"
    },
    {
        "field1": "在建工程/固定资产占比"
    },
    {
        "field1": "在建工程/营业收入占比"
    }, {
        "field1": "利息保障倍数"
    }, {
        "field1": "内部资产收益率增减百分点"
    },
    {
        "field1": "对外投资收益率增减百分点"
    },
    {
        "field1": "投资收益增长率(%)"
    },
    {
        "field1": "商誉"
    },
    {
        "field1": "投资性房地产"
    },
    {
        "field1": "无形资产"
    },
    {
        "field1": "开发支出"
    }, {
        "field1": "递延所得税资产"
    },
    {
        "field1": "预收款项"
    },
    {
        "field1": "预收账款/营业收入比例"
    },
    {
        "field1": "递延所得税负债"
    },
    {
        "field1": "流动比率（%）"
    },
    {
        "field1": "三年平均总资产增长率"
    }, {
        "field1": "八、负债类"
    },
    {
        "field1": "负债合计"
    },
    {
        "field1": "负债合计增长率(%)"
    },
    {
        "field1": "流动负债总计"
    },
    {
        "field1": "短期借款"
    },
    {
        "field1": "短期借款/营业收入比例"
    },
    {
        "field1": "短期借款占比"
    },
    {
        "field1": "长期借款"
    },
    {
        "field1": "长期借款占比"
    },
    {
        "field1": "应付账款"
    },
    {
        "field1": "其他应付款"
    },
    {
        "field1": "预付账款/营业成本比例"
    },
    {
        "field1": "预收账款增长率(%)"
    },
    {
        "field1": "其它应收款/营业收入比例"
    },
    {
        "field1": "应付账款增长率(%)"
    },
    {
        "field1": "预付账款增长率(%)"
    },
    {
        "field1": "长期待摊费用/流动资产合计比例"
    },
    {
        "field1": "资产减值损失"
    },
    {
        "field1": "九、权益类"
    },
    {
        "field1": "资本公积金"
    },
    {
        "field1": "资本公积金占比"
    },
    {
        "field1": "未分配利润"
    }, {
        "field1": "所有者权益增长率(%)"
    },
    {
        "field1": "股东权益合计"
    },
    {
        "field1": "三年资本平均增长率(%)"
    },
    {
        "field1": "十、成本类"
    },
    {
        "field1": "营业周期增长率(%)"
    },
    {
        "field1": "营业成本"
    },
    {
        "field1": "营业安全水平"
    },
    {
        "field1": "营业成本/营业收入增长额比例"
    },
    {
        "field1": "十一、费用类"
    },
    {
        "field1": "销售费用"
    },
    {
        "field1": "管理费用"
    }, {
        "field1": "财务费用"
    }, {
        "field1": "成本费用总额增长率(%)"
    }, {
        "field1": "营业成本增长率(%)"
    }, {
        "field1": "销售费用增长率(%)"
    }, {
        "field1": "财务费用增长率(%)"
    }, {
        "field1": "管理费用增长率(%)"
    },
    {
        "field1": "管理费用/营业收入比例"
    },
    {
        "field1": "销售费用/营业收入比例"
    }, {
        "field1": "成本费用利润率增减率(%)"
    }, {
        "field1": "期间费用利润率增减率(%)"
    },
    {
        "field1": "期间费用"
    }, {
        "field1": "公允价值变动损失"
    }, {
        "field1": "十二、现金类"
    },
    {
        "field1": "经营活动产生的现金流量净额"
    },
    {
        "field1": "投资活动产生的现金流量净额"
    }, {
        "field1": "筹资活动产生的现金流量净额"
    }, {
        "field1": "期末现金及现金等价物余额"
    },
    {
        "field1": "支付的各项税费"
    },
    {
        "field1": "销售商品、提供劳务收到的现金"
    },
    {
        "field1": "购买商品、接受劳务支付的现金"
    },
    {
        "field1": "支付给职工以及为职工支付的现金"
    },
    {
        "field1": "经营净现金流／流动负债"
    }, {
        "field1": "经营净现金流／净利润"
    }, {
        "field1": "经营活动产生的现金流量净额/营业利润比例"
    }, {
        "field1": "销售商品提供劳务产生的现金/营业收入比例"
    },
    {
        "field1": "现金及现金等价物净额变化率(%)"
    },
    {
        "field1": "经营活动产生的现金流量净额变化率(%)"
    },
    {
        "field1": "投资活动产生的现金流量净额变化率(%)"
    },
    {
        "field1": "筹资活动产生的现金流量净额变化率(%)"
    },
    {
        "field1": "销售收现率(%)"
    },
    {
        "field1": "净现金流量/利润比例"
    },


]
let tableData3 = [
    {
        "field1": "净资产收益率（%）",
        "field2": "0.4",
  
    },
    {
        "field1": "盈余现金保障倍数",
        "field2": "1.5",
     
    },
    {
        "field1": "资产负债率（%）",
        "field2": "70",
 
    },
    {
        "field1": "速动比率（%）",
        "field2": "71.9",
     
    },
    {
        "field1": "现金流动负债比（%）",
        "field2": "2.8",
     
    },
    {
        "field1": "带息负债比率（%）",
        "field2": "41",
  
    },
]
let data3 = [
    {
        label: '(A)农、林、牧、渔业',
        children: [
            {
                label: '(A01)农业',
            },
            {
                label: '(A02)林业',
            },
            {
                label: '(A03)畜牧业',
            },
            {
                label: '(A04)渔业',
            },
            {
                label: '(A05)农、林、牧、渔服务业',
            },
        ]
    },
    {
        label: '(B)采矿业',
        children: [
            {
                label: '(B06)煤炭开采和洗选业',
            },
            {
                label: '(B07)石油和天然气开采业',
            },
            {
                label: '(B08)黑色金属矿采选业',
            },
            {
                label: '(B09)有色金属矿采选业',
            },
            {
                label: '(B10)非金属矿采选业',
            },
            {
                label: '(B11)开采辅助活动',
            },
        ]
    },
    {
        label: '(C)制造业',
        children: [{
            label: '(C13)农副食品加工业',
        },
            {
                label: '(C14)食品制造业',
            },
            {
                label: '(C15)酒、饮料和精制茶制造业',
            },
            {
                label: '(C17)纺织业',

            },
            {
                label: '(C18)纺织服装、服饰业',
            },
            {
                label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
            },
            {
                label: '(C20)木材加工和木、竹、藤、棕、草制品业',
            },
            {
                label: '(C21)家具制造业',
            },
            {
                label: '(C22)造纸和纸制品业',
            },
            {
                label: '(C23)印刷和记录媒介复制业',
            },
            {
                label: '(C24)文教、工美、体育和娱乐用品制造业',
            },
            {
                label: '(C25)石油加工、炼焦和核燃料加工业',
            },
            {
                label: '(C26)化学原料和化学制品制造业',
            },
            {
                label: '(C27)医药制造业',
            },
            {
                label: '(C28)化学纤维制造业',
            },
            {
                label: '(C29)橡胶和塑料制品业',
            },
            {
                label: '(C30)非金属矿物制品业',
            },
            {
                label: '(C31)黑色金属冶炼和压延加工业',
            },
            {
                label: '(C32)有色金属冶炼和压延加工业',
            },
            {
                label: '(C33)金属制品业',
            },
            {
                label: '(C34)通用设备制造业',
            },
            {
                label: '(C35)专用设备制造业',
            },
            {
                label: '(C36)汽车制造业',
            },
            {
                label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
            },
            {
                label: '(C38)电气机械和器材制造业',
            },
            {
                label: '(C39)计算机、通信和其他电子设备制造业',
            },
            {
                label: '(C40)仪器仪表制造业',
            },
            {
                label: '(C41)其他制造业',
            },
            {
                label: '(C42)废弃资源综合利用业',
            },
        ]
    },
    {
        label: '(D)电力、热力、燃气及水生产和供应业',
        children: [
            {
                label: '(D44)电力、热力生产和供应业',
            },
            {
                label: '(D45)燃气生产和供应业',
            },
            {
                label: '(D46)水的生产和供应业',
            }]
    },
    {
        label: '(E)建筑业',
        children: [
            {
                label: '(E47)房屋建筑业',
            },
            {
                label: '(E48)土木工程建筑业',
            },
            {
                label: '(E49)建筑安装业',
            },
            {
                label: '(E50)建筑装饰和其他建筑业',
            }]
    },
    {
        label: '(F)批发和零售业',
        children: [{
            label: '(F51)批发业',
        },
            {
                label: '(F52)零售业',
            },]
    },
    {
        label: '(G)交通运输、仓储和邮政业',
        children: [
            {
                label: '(G53)铁路运输业',

            },
            {
                label: '(G54)道路运输业',

            },
            {
                label: '(G55)水上运输业',

            },
            {
                label: '(G56)航空运输业',

            },
            {
                label: '(G58)装卸搬运和运输代理业',
            },
            {
                label: '(G59)仓储业',
            },
            {
                label: '(G60)邮政业',
            }]
    },
    {
        label: '(H)住宿和餐饮业',
        children: [{
            label: '(H61)住宿业',
        }, {
            label: '(H62)餐饮业',
        }]
    },
    {
        label: '(I)信息传输、软件和信息技术服务业',
        children: [
            {
                label: '(I63)电信、广播电视和卫星传输服务',
            },
            {
                label: '(I64)互联网和相关服务',
            },
            {
                label: '(I65)软件和信息技术服务业',
            }]
    },
    {
        label: '(J)金融业',
        children: [
            {
                label: '(J66)货币金融服务',

            },
            {
                label: '(J67)资本市场服务',

            },
            {
                label: '(J68)保险业',

            },
            {
                label: '(J69)其他金融业',

            },
        ]
    }, {
        label: '(K)房地产业',
        children: [{
            label: '(K70)房地产业',
        },]
    }, {
        label: '(L)租赁和商务服务业',
        children: [{
            label: '(L71)租赁业',

        }, {
            label: '(L72)商务服务业',
        }]
    },
    {
        label: '(M)科学研究和技术服务业',
        children: [{
            label: '(M73)研究和试验发展',

        },
            {
                label: '(M74)专业技术服务业',
            },
            {
                label: '(M75)科技推广和应用服务业',

            },
        ]
    },
    {
        label: '(N)水利、环境和公共设施管理业',
        children: [
            {
                label: '(N77)生态保护和环境治理业',
            },
            {
                label: '(N78)公共设施管理业',
            },
        ]
    },
    {
        label: '(O)居民服务、修理和其他服务业',
        children: [
            {
                label: '(O80)机动车、电子产品和日用产品修理业',
            },
        ]
    },
    {
        label: '(P)教育',
        children: [{
            label: '(P82)教育',
        },]
    },
    {
        label: '(Q)卫生和社会工作',
        children: [{
            label: '(Q83)卫生',
        },]
    },
    {
        label: '(R)文化、体育和娱乐业',
        children: [{
            label: '(R85)新闻和出版业',

        },
            {
                label: '(R86)广播、电视、电影和影视录音制作业',
            },
            {
                label: '(R87)文化艺术业',

            },
            {
                label: '(R88)体育',

            },
        ]
    },
    {
        label: '(S)综合',
    },

]
let tableData4 = []
let tableData5 = []
let tableData6 = []
let tableData7 = []
let tableData8 = [
    {
        "field1": "一、主要经济指标",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "营业收入",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "营业利润",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "利润总额",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "净利润",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "未分配利润",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "资产总计",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "负债合计",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "股东权益合计",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "净资产",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "每股收益",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "每股净资产",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "二、盈利能力分析",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "销售毛利率（%）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "营业利润率（%）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "总资产利润率（%）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "净资产收益率",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "存货周转率",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "应收账款周转率（次）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "总资产周转率（次）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "三、偿债能力分析",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "资产负债率（%）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "股东权益比率（%）",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "流动比率",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "速动比率",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "四、成本费用分析",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "营业成本",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "销售费用",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "管理费用",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
    {
        "field1": "财务费用",
        "field2": "11.6",
        "field3": "7.7",
        "field4": "2.8",
        "field5": "-3.3",
        "field6": "-9.5",
        "field7": "-9.5",
    },
]
let data4 =  [
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(10101110101110)新能源设备与服务"
                }
              ],
              "label": "(1010101011)新能源设备与服务"
            },
            {
              "children": [
                {
                  "label": "(10101210101210)综合性石油与天然气企业"
                },
                {
                  "label": "(10101210101211)石油与天然气的勘探与生产"
                },
                {
                  "label": "(10101210101212)石油与天然气的炼制和营销"
                },
                {
                  "label": "(10101210101213)石油与天然气的储存和运输"
                },
                {
                  "label": "(10101210101214)煤与消费用燃料"
                }
              ],
              "label": "(1010101012)石油、天然气与消费用燃料"
            }
          ],
          "label": "(101010)能源"
        }
      ],
      "label": "(010)能源"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(11101011101010)商品化工"
                },
                {
                  "label": "(11101011101011)多种化学制品"
                },
                {
                  "label": "(11101011101012)化肥与农用药剂"
                },
                {
                  "label": "(11101011101013)工业气体"
                },
                {
                  "label": "(11101011101014)特种化学制品"
                }
              ],
              "label": "(1110111010)化学制品"
            },
            {
              "children": [
                {
                  "label": "(11101111101110)建筑材料"
                }
              ],
              "label": "(1110111011)建筑材料"
            },
            {
              "children": [
                {
                  "label": "(11101211101210)金属与玻璃容器"
                },
                {
                  "label": "(11101211101211)纸材料包装"
                }
              ],
              "label": "(1110111012)容器与包装"
            },
            {
              "children": [
                {
                  "label": "(11101311101310)铝"
                },
                {
                  "label": "(11101311101311)多种金属与采矿"
                },
                {
                  "label": "(11101311101312)铜"
                },
                {
                  "label": "(11101311101313)黄金"
                },
                {
                  "label": "(11101311101314)贵重金属与矿石"
                },
                {
                  "label": "(11101311101315)钢铁"
                }
              ],
              "label": "(1110111013)金属与采矿"
            },
            {
              "children": [
                {
                  "label": "(11101411101410)新型功能材料"
                },
                {
                  "label": "(11101411101411)先进结构材料"
                },
                {
                  "label": "(11101411101412)高性能复合材料"
                },
                {
                  "label": "(11101411101413)前沿新材料"
                }
              ],
              "label": "(1110111014)新材料"
            },
            {
              "children": [
                {
                  "label": "(11101511101510)林业产品"
                },
                {
                  "label": "(11101511101511)纸制品"
                }
              ],
              "label": "(1110111015)纸类与林业产品"
            }
          ],
          "label": "(111110)原材料"
        }
      ],
      "label": "(011)原材料"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(12101012101010)航天航空与国防"
                }
              ],
              "label": "(1210121010)航空航天与国防"
            },
            {
              "children": [
                {
                  "label": "(12101112101110)建筑产品"
                }
              ],
              "label": "(1210121011)建筑产品"
            },
            {
              "children": [
                {
                  "label": "(12101212101210)建筑与工程"
                }
              ],
              "label": "(1210121012)建筑与工程"
            },
            {
              "children": [
                {
                  "label": "(12101312101310)电气部件与设备"
                },
                {
                  "label": "(12101312101311)重型电气设备"
                }
              ],
              "label": "(1210121013)电气设备"
            },
            {
              "children": [
                {
                  "label": "(12101512101510)建筑、农用机械与重型卡车"
                },
                {
                  "label": "(12101512101511)工业机械"
                }
              ],
              "label": "(1210121015)机械制造"
            },
            {
              "children": [
                {
                  "label": "(12101612101610)贸易公司与经销商"
                }
              ],
              "label": "(1210121016)贸易公司与经销商"
            }
          ],
          "label": "(121210)资本品"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(12111012111010)商业印刷"
                },
                {
                  "label": "(12111012111011)环境与设施服务"
                },
                {
                  "label": "(12111012111012)办公服务与用品"
                },
                {
                  "label": "(12111012111013)综合支持服务"
                },
                {
                  "label": "(12111012111014)安全和报警服务"
                }
              ],
              "label": "(1211121110)商业服务与商业用品"
            },
            {
              "children": [
                {
                  "label": "(12111112111110)人力资源与就业服务"
                },
                {
                  "label": "(12111112111111)调查和咨询服务"
                }
              ],
              "label": "(1211121111)专业服务"
            }
          ],
          "label": "(121211)商业和专业服务"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(12121012121010)航空货运与物流"
                }
              ],
              "label": "(1212121210)航空货运与物流"
            },
            {
              "children": [
                {
                  "label": "(12121112121110)航空公司"
                }
              ],
              "label": "(1212121211)航空公司"
            },
            {
              "children": [
                {
                  "label": "(12121212121210)海运"
                }
              ],
              "label": "(1212121212)海运"
            },
            {
              "children": [
                {
                  "label": "(12121312121310)铁路"
                },
                {
                  "label": "(12121312121311)陆运"
                }
              ],
              "label": "(1212121213)公路与铁路"
            },
            {
              "children": [
                {
                  "label": "(12121412121410)机场服务"
                },
                {
                  "label": "(12121412121412)海港与服务"
                }
              ],
              "label": "(1212121214)交通基本设施"
            }
          ],
          "label": "(121212)运输"
        }
      ],
      "label": "(012)工业"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(13101013101010)机动车零配件与设备"
                },
                {
                  "label": "(13101013101011)轮胎与橡胶"
                }
              ],
              "label": "(1310131010)汽车零配件"
            },
            {
              "children": [
                {
                  "label": "(13101113101110)汽车制造商"
                },
                {
                  "label": "(13101113101111)摩托车制造商"
                }
              ],
              "label": "(1310131011)汽车"
            }
          ],
          "label": "(131310)汽车与汽车零部件"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(13111013111010)消费电子产品"
                },
                {
                  "label": "(13111013111011)家庭装饰品"
                },
                {
                  "label": "(13111013111012)家用电器"
                },
                {
                  "label": "(13111013111013)家用器具与特殊消费品"
                }
              ],
              "label": "(1311131110)家庭耐用消费品"
            },
            {
              "children": [
                {
                  "label": "(13111113111110)消闲用品"
                }
              ],
              "label": "(1311131111)休闲设备与用品"
            },
            {
              "children": [
                {
                  "label": "(13111213111210)服装与配饰"
                },
                {
                  "label": "(13111213111211)奢侈品"
                },
                {
                  "label": "(13111213111212)鞋类"
                },
                {
                  "label": "(13111213111213)纺织品"
                }
              ],
              "label": "(1311131112)纺织品、服装与奢侈品"
            }
          ],
          "label": "(131311)耐用消费品与服装"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(13121013121010)酒店、度假村与豪华游轮"
                },
                {
                  "label": "(13121013121011)消闲设施"
                },
                {
                  "label": "(13121013121012)餐馆"
                }
              ],
              "label": "(1312131210)酒店、餐馆与休闲"
            },
            {
              "children": [
                {
                  "label": "(13121113121110)教育服务"
                },
                {
                  "label": "(13121113121111)特殊消费者服务"
                }
              ],
              "label": "(1312131211) 综合消费者服务"
            }
          ],
          "label": "(131312)消费者服务"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(13131013131010)广告"
                },
                {
                  "label": "(13131013131011)电影与娱乐"
                },
                {
                  "label": "(13131013131012)出版"
                }
              ],
              "label": "(1313131310)媒体"
            }
          ],
          "label": "(131313)媒体"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(13141013141010)经销商"
                }
              ],
              "label": "(1314131410)经销商"
            },
            {
              "children": [
                {
                  "label": "(13141113141111)互联网零售"
                }
              ],
              "label": "(1314131411)互联网与售货目录零售"
            },
            {
              "children": [
                {
                  "label": "(13141213141210)百货商店"
                },
                {
                  "label": "(13141213141211)综合货品商店"
                }
              ],
              "label": "(1314131412)多元化零售"
            },
            {
              "children": [
                {
                  "label": "(13141313141310)服装零售"
                },
                {
                  "label": "(13141313141311)电脑与电子产品零售"
                },
                {
                  "label": "(13141313141312)家庭装潢零售"
                },
                {
                  "label": "(13141313141313)专卖店"
                },
                {
                  "label": "(13141313141314)汽车零售"
                }
              ],
              "label": "(1314131413)专营零售"
            }
          ],
          "label": "(131314)零售业"
        }
      ],
      "label": "(013)非日常生活消费品"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(14101014101010)药品零售"
                },
                {
                  "label": "(14101014101011)食品分销商"
                },
                {
                  "label": "(14101014101012)食品零售"
                },
                {
                  "label": "(14101014101013)大卖场与超市"
                }
              ],
              "label": "(1410141010)食品与主要用品零售"
            }
          ],
          "label": "(141410)食品与主要用品零售"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(14111014111011)白酒酿造商"
                },
                {
                  "label": "(14111014111012)软饮料生产商"
                },
                {
                  "label": "(14111014111013)其他酿酒商"
                }
              ],
              "label": "(1411141110)饮料"
            },
            {
              "children": [
                {
                  "label": "(14111114111110)农产品"
                },
                {
                  "label": "(14111114111111)包装食品与肉类"
                }
              ],
              "label": "(1411141111)食品"
            }
          ],
          "label": "(141411)食品、饮料与烟草"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(14121014121010)居家用品"
                }
              ],
              "label": "(1412141210)居家用品"
            },
            {
              "children": [
                {
                  "label": "(14121114121110)个人用品"
                }
              ],
              "label": "(1412141211)个人用品"
            }
          ],
          "label": "(141412)家庭与个人用品"
        }
      ],
      "label": "(014)日常消费品"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(15101015101010)医疗保健设备"
                },
                {
                  "label": "(15101015101011)医疗保健用品"
                }
              ],
              "label": "(1510151010)医疗保健设备与用品"
            },
            {
              "children": [
                {
                  "label": "(15101115101110)保健护理产品经销商"
                },
                {
                  "label": "(15101115101111)保健护理服务"
                },
                {
                  "label": "(15101115101112)保健护理机构"
                }
              ],
              "label": "(1510151011)医疗保健提供商与服务"
            },
            {
              "children": [
                {
                  "label": "(15101215101210)医疗保健技术"
                }
              ],
              "label": "(1510151012)医疗保健技术"
            }
          ],
          "label": "(151510)医疗保健设备与服务"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(15111015111010)生物科技"
                }
              ],
              "label": "(1511151110)生物科技"
            },
            {
              "children": [
                {
                  "label": "(15111115111110)化学原料药"
                },
                {
                  "label": "(15111115111111)化学制剂"
                },
                {
                  "label": "(15111115111112)中药"
                },
                {
                  "label": "(15111115111113)兽药"
                }
              ],
              "label": "(1511151111)制药"
            },
            {
              "children": [
                {
                  "label": "(15111215111210)生命科学工具和服务"
                }
              ],
              "label": "(1511151112)生命科学工具和服务"
            }
          ],
          "label": "(151511)制药、生物科技和生命科学"
        }
      ],
      "label": "(015)医疗保健"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(16101016101010)银行"
                },
                {
                  "label": "(16101016101011)信用合作社"
                }
              ],
              "label": "(1610161010)银行业存款类金融机构"
            },
            {
              "children": [
                {
                  "label": "(16101116101112)贷款公司"
                },
                {
                  "label": "(16101116101113)担保公司"
                },
                {
                  "label": "(16101116101114)金融租赁"
                }
              ],
              "label": "(1610161011)银行业非存款类金融机构"
            }
          ],
          "label": "(161610)银行业"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(16111016111010)证券公司"
                },
                {
                  "label": "(16111016111012)期货公司"
                },
                {
                  "label": "(16111016111013)私募基金管理人"
                },
                {
                  "label": "(16111016111014)投资咨询公司"
                }
              ],
              "label": "(1611161110)证券期货业"
            }
          ],
          "label": "(161611)证券期货业"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(16121016121010)保险业"
                }
              ],
              "label": "(1612161210)保险业"
            }
          ],
          "label": "(161612)保险业"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(16131016131010)其他金融"
                }
              ],
              "label": "(1613161310)其他金融"
            }
          ],
          "label": "(161613)其他金融"
        }
      ],
      "label": "(016)金融"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(17101017101010)互联网软件与服务"
                },
                {
                  "label": "(17101017101011)云计算及其他云端服务"
                }
              ],
              "label": "(1710171010)互联网软件与服务"
            },
            {
              "children": [
                {
                  "label": "(17101117101110)信息科技咨询和系统集成服务"
                },
                {
                  "label": "(17101117101111)物联网技术与服务"
                },
                {
                  "label": "(17101117101112)数据处理与外包服务"
                }
              ],
              "label": "(1710171011)信息技术服务"
            },
            {
              "children": [
                {
                  "label": "(17101217101210)应用软件"
                },
                {
                  "label": "(17101217101211)系统软件"
                },
                {
                  "label": "(17101217101212)家庭娱乐软件"
                }
              ],
              "label": "(1710171012)软件"
            }
          ],
          "label": "(171710)软件与服务"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(17111017111010)电脑硬件"
                },
                {
                  "label": "(17111017111011)电脑存储与外围设备"
                }
              ],
              "label": "(1711171110)电脑与外围设备"
            },
            {
              "children": [
                {
                  "label": "(17111117111110)分析检测用电子设备与仪器及其他"
                },
                {
                  "label": "(17111117111111)智能电子识别设备"
                },
                {
                  "label": "(17111117111112)其他电子元器件"
                },
                {
                  "label": "(17111117111113)电子制造服务"
                },
                {
                  "label": "(17111117111114)技术产品经销商"
                }
              ],
              "label": "(1711171111)电子设备、仪器和元件"
            },
            {
              "children": [
                {
                  "label": "(17111217111210)办公电子设备"
                }
              ],
              "label": "(1711171112)办公电子设备"
            }
          ],
          "label": "(171711)技术硬件与设备"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(17121017121010)半导体设备"
                },
                {
                  "label": "(17121017121011)半导体产品"
                }
              ],
              "label": "(1712171210)半导体产品与设备"
            }
          ],
          "label": "(171712)半导体产品与设备"
        }
      ],
      "label": "(017)信息技术"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(18101018101010)非传统电信运营商"
                },
                {
                  "label": "(18101018101011)综合电信业务"
                }
              ],
              "label": "(1810181010)综合电信业务"
            },
            {
              "children": [
                {
                  "label": "(18101118101110)无线电信业务"
                }
              ],
              "label": "(1810181011)无线电信业务"
            }
          ],
          "label": "(181810)电信业务"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(18111018111010)通信设备"
                },
                {
                  "label": "(18111018111011)通信技术服务"
                }
              ],
              "label": "(1811181110)通信设备及服务"
            }
          ],
          "label": "(181811)通信设备及服务"
        },
        {
          "children": [
            {
              "children": [
                {
                  "label": "(18121018121011)有线和卫星电视"
                }
              ],
              "label": "(1812181210)广播、有线和卫星电视"
            }
          ],
          "label": "(181812)广播、有线和卫星电视"
        }
      ],
      "label": "(018)电信业务"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(19101019101010)电力公用事业"
                }
              ],
              "label": "(1910191010)电力公用事业"
            },
            {
              "children": [
                {
                  "label": "(19101119101110)燃气公用事业"
                }
              ],
              "label": "(1910191011)燃气公用事业"
            },
            {
              "children": [
                {
                  "label": "(19101219101210)复合型公用事业"
                }
              ],
              "label": "(1910191012)复合型公用事业"
            },
            {
              "children": [
                {
                  "label": "(19101319101310)水公用事业"
                }
              ],
              "label": "(1910191013)水公用事业"
            },
            {
              "children": [
                {
                  "label": "(19101419101410)独立电力生产商与能源贸易商"
                }
              ],
              "label": "(1910191014)独立电力生产商与能源贸易商"
            },
            {
              "children": [
                {
                  "label": "(19101519101510)热力公用事业"
                }
              ],
              "label": "(1910191015)热力公用事业"
            }
          ],
          "label": "(191910)公用事业"
        }
      ],
      "label": "(019)公用事业"
    },
    {
      "children": [
        {
          "children": [
            {
              "children": [
                {
                  "label": "(20101020101010)多样化房地产活动"
                },
                {
                  "label": "(20101020101011)房地产经营公司"
                },
                {
                  "label": "(20101020101012)房地产开发"
                },
                {
                  "label": "(20101020101013)房地产服务"
                }
              ],
              "label": "(2010201010)房地产管理和开发"
            }
          ],
          "label": "(202010)房地产"
        }
      ],
      "label": "(020)房地产"
    }
  ]

let data5 = [
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1111110)煤炭开采和洗选辅助活动"
                                    }
                                ],
                                "label": "(11111)煤炭开采和洗选辅助活动"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1121120)石油和天然气开采辅助活动"
                                    }
                                ],
                                "label": "(11112)石油和天然气开采辅助活动"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1111110)煤炭开采和洗选辅助活动"
                                    }
                                ],
                                "label": "(11111)稻谷种植"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1121120)石油和天然气开采辅助活动"
                                    }
                                ],
                                "label": "(11112)小麦种植"
                            },
                            {
                                "label": "(11113)玉米种植"
                            },
                            {
                                "label": "(11119)其他谷物种植"
                            }
                        ],
                        "label": "(111)谷物种植"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1201200)其他采矿业"
                                    }
                                ],
                                "label": "(12120)其他采矿业"
                            },
                            {
                                "label": "(12122)油料种植"
                            },
                            {
                                "label": "(12123)薯类种植"
                            }
                        ],
                        "label": "(112)豆类、油料和薯类种植"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1311310)谷物磨制"
                                    }
                                ],
                                "label": "(13131)谷物磨制"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1321320)饲料加工"
                                    }
                                ],
                                "label": "(13132)饲料加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1331331)食用植物油加工"
                                    }
                                ],
                                "label": "(13133)植物油加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1341340)制糖业"
                                    }
                                ],
                                "label": "(13134)制糖业"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1351351)牲畜屠宰"
                                    },
                                    {
                                        "label": "(1351352)禽类屠宰"
                                    },
                                    {
                                        "label": "(1351353)肉制品及副产品加工"
                                    }
                                ],
                                "label": "(13135)屠宰及肉类加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1361361)水产品冷冻加工"
                                    },
                                    {
                                        "label": "(1361363)水产饲料制造"
                                    },
                                    {
                                        "label": "(1361369)其他水产品加工"
                                    }
                                ],
                                "label": "(13136)水产品加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1371371)蔬菜加工"
                                    },
                                    {
                                        "label": "(1371372)水果和坚果加工"
                                    }
                                ],
                                "label": "(13137)蔬菜、水果和坚果加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1391391)淀粉及淀粉制品制造"
                                    },
                                    {
                                        "label": "(1391392)豆制品制造"
                                    },
                                    {
                                        "label": "(1391393)蛋品加工"
                                    },
                                    {
                                        "label": "(1391399)其他未列明农副食品加工"
                                    }
                                ],
                                "label": "(13139)其他农副食品加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1311310)谷物磨制"
                                    }
                                ],
                                "label": "(13131)棉花种植"
                            }
                        ],
                        "label": "(113)棉、麻、糖、烟草种植"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1411411)糕点、面包制造"
                                    },
                                    {
                                        "label": "(1411419)饼干及其他焙烤食品制造"
                                    }
                                ],
                                "label": "(14141)焙烤食品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1421421)糖果、巧克力制造"
                                    }
                                ],
                                "label": "(14142)糖果、巧克力及蜜饯制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1431431)米、面制品制造"
                                    },
                                    {
                                        "label": "(1431432)速冻食品制造"
                                    },
                                    {
                                        "label": "(1431439)方便面及其他方便食品制造"
                                    }
                                ],
                                "label": "(14143)方便食品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1441440)乳制品制造"
                                    }
                                ],
                                "label": "(14144)乳制品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1451453)蔬菜、水果罐头制造"
                                    }
                                ],
                                "label": "(14145)罐头食品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1461462)酱油、食醋及类似制品制造"
                                    },
                                    {
                                        "label": "(1461469)其他调味品、发酵制品制造"
                                    }
                                ],
                                "label": "(14146)调味品、发酵制品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1491491)营养食品制造"
                                    },
                                    {
                                        "label": "(1491492)保健食品制造"
                                    },
                                    {
                                        "label": "(1491495)食品及饲料添加剂制造"
                                    },
                                    {
                                        "label": "(1491499)其他未列明食品制造"
                                    }
                                ],
                                "label": "(14149)其他食品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1411411)糕点、面包制造"
                                    },
                                    {
                                        "label": "(1411419)饼干及其他焙烤食品制造"
                                    }
                                ],
                                "label": "(14141)蔬菜种植"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1421421)糖果、巧克力制造"
                                    }
                                ],
                                "label": "(14142)食用菌种植"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1431431)米、面制品制造"
                                    },
                                    {
                                        "label": "(1431432)速冻食品制造"
                                    },
                                    {
                                        "label": "(1431439)方便面及其他方便食品制造"
                                    }
                                ],
                                "label": "(14143)花卉种植"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1491491)营养食品制造"
                                    },
                                    {
                                        "label": "(1491492)保健食品制造"
                                    },
                                    {
                                        "label": "(1491495)食品及饲料添加剂制造"
                                    },
                                    {
                                        "label": "(1491499)其他未列明食品制造"
                                    }
                                ],
                                "label": "(14149)其他园艺作物种植"
                            }
                        ],
                        "label": "(114)蔬菜、食用菌及园艺作物种植"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1511511)酒精制造"
                                    },
                                    {
                                        "label": "(1511512)白酒制造"
                                    },
                                    {
                                        "label": "(1511515)葡萄酒制造"
                                    },
                                    {
                                        "label": "(1511519)其他酒制造"
                                    }
                                ],
                                "label": "(15151)酒的制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1521522)瓶（罐）装饮用水制造"
                                    },
                                    {
                                        "label": "(1521523)果菜汁及果菜汁饮料制造"
                                    },
                                    {
                                        "label": "(1521524)含乳饮料和植物蛋白饮料制造"
                                    },
                                    {
                                        "label": "(1521525)固体饮料制造"
                                    },
                                    {
                                        "label": "(1521529)茶饮料及其他饮料制造"
                                    }
                                ],
                                "label": "(15152)饮料制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1531530)精制茶加工"
                                    }
                                ],
                                "label": "(15153)精制茶加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1511511)酒精制造"
                                    },
                                    {
                                        "label": "(1511512)白酒制造"
                                    },
                                    {
                                        "label": "(1511515)葡萄酒制造"
                                    },
                                    {
                                        "label": "(1511519)其他酒制造"
                                    }
                                ],
                                "label": "(15151)仁果类和核果类水果种植"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1531530)精制茶加工"
                                    }
                                ],
                                "label": "(15153)柑橘类种植"
                            },
                            {
                                "label": "(15154)香蕉等亚热带水果种植"
                            },
                            {
                                "label": "(15159)其他水果种植"
                            }
                        ],
                        "label": "(115)水果种植"
                    },
                    {
                        "children": [
                            {
                                "label": "(16169)茶及其他饮料作物种植"
                            }
                        ],
                        "label": "(116)坚果、含油果、香料和饮料作物种植"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1711711)棉纺纱加工"
                                    },
                                    {
                                        "label": "(1711712)棉织造加工"
                                    }
                                ],
                                "label": "(17171)棉纺织及印染精加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1721721)毛条和毛纱线加工"
                                    },
                                    {
                                        "label": "(1721723)毛染整精加工"
                                    }
                                ],
                                "label": "(17172)毛纺织及染整精加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1741742)绢纺和丝织加工"
                                    }
                                ],
                                "label": "(17174)丝绢纺织及印染精加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1751751)化纤织造加工"
                                    },
                                    {
                                        "label": "(1751752)化纤织物染整精加工"
                                    }
                                ],
                                "label": "(17175)化纤织造及印染精加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1761763)针织或钩针编织品制造"
                                    }
                                ],
                                "label": "(17176)针织或钩针编织物及其制品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1771771)床上用品制造"
                                    },
                                    {
                                        "label": "(1771773)窗帘、布艺类产品制造"
                                    }
                                ],
                                "label": "(17177)家用纺织制成品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1781781)非织造布制造"
                                    },
                                    {
                                        "label": "(1781782)绳、索、缆制造"
                                    },
                                    {
                                        "label": "(1781784)篷、帆布制造"
                                    },
                                    {
                                        "label": "(1781789)其他非家用纺织制成品制造"
                                    }
                                ],
                                "label": "(17178)非家用纺织制成品制造"
                            },
                            {
                                "label": "(17170)中药材种植"
                            }
                        ],
                        "label": "(117)中药材种植"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(1911910)皮革鞣制加工"
                                    }
                                ],
                                "label": "(19191)皮革鞣制加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1921921)皮革服装制造"
                                    },
                                    {
                                        "label": "(1921922)皮箱、包（袋）制造"
                                    },
                                    {
                                        "label": "(1921929)其他皮革制品制造"
                                    }
                                ],
                                "label": "(19192)皮革制品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1931932)毛皮服装加工"
                                    }
                                ],
                                "label": "(19193)毛皮鞣制及制品加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1941942)羽毛（绒）制品加工"
                                    }
                                ],
                                "label": "(19194)羽毛(绒)加工及制品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(1951952)皮鞋制造"
                                    },
                                    {
                                        "label": "(1951953)塑料鞋制造"
                                    },
                                    {
                                        "label": "(1951954)橡胶鞋制造"
                                    },
                                    {
                                        "label": "(1951959)其他制鞋业"
                                    }
                                ],
                                "label": "(19195)制鞋业"
                            },
                            {
                                "label": "(19190)其他农业"
                            }
                        ],
                        "label": "(119)其他农业"
                    }
                ],
                "label": "(A1)农业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(2112110)木质家具制造"
                                    }
                                ],
                                "label": "(21211)木质家具制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(2122120)竹、藤家具制造"
                                    }
                                ],
                                "label": "(21212)竹、藤家具制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(2132130)金属家具制造"
                                    }
                                ],
                                "label": "(21213)金属家具制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(2192190)其他家具制造"
                                    }
                                ],
                                "label": "(21219)其他家具制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(2122120)竹、藤家具制造"
                                    }
                                ],
                                "label": "(21212)林木育苗"
                            }
                        ],
                        "label": "(221)林木育种和育苗"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(2312311)书、报刊印刷"
                                    },
                                    {
                                        "label": "(2312312)本册印制"
                                    },
                                    {
                                        "label": "(2312319)包装装潢及其他印刷"
                                    }
                                ],
                                "label": "(23231)印刷"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(2322320)装订及印刷相关服务"
                                    }
                                ],
                                "label": "(23232)装订及印刷相关服务"
                            },
                            {
                                "label": "(23230)森林经营和管护"
                            }
                        ],
                        "label": "(223)森林经营和管护"
                    }
                ],
                "label": "(A2)林业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(3133130)黑色金属铸造"
                                    }
                                ],
                                "label": "(31313)黑色金属铸造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3143140)钢压延加工"
                                    }
                                ],
                                "label": "(31314)钢压延加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3153150)铁合金冶炼"
                                    }
                                ],
                                "label": "(31315)铁合金冶炼"
                            },
                            {
                                "label": "(31311)牛的饲养"
                            },
                            {
                                "label": "(31312)马的饲养"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3133130)黑色金属铸造"
                                    }
                                ],
                                "label": "(31313)猪的饲养"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3143140)钢压延加工"
                                    }
                                ],
                                "label": "(31314)羊的饲养"
                            }
                        ],
                        "label": "(331)牲畜饲养"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(3213213)镍钴冶炼"
                                    },
                                    {
                                        "label": "(3213219)其他常用有色金属冶炼"
                                    }
                                ],
                                "label": "(32321)常用有色金属冶炼"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3233232)稀土金属冶炼"
                                    },
                                    {
                                        "label": "(3233239)其他稀有金属冶炼"
                                    }
                                ],
                                "label": "(32323)稀有稀土金属冶炼"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3243240)有色金属合金制造"
                                    }
                                ],
                                "label": "(32324)有色金属合金制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3253250)有色金属铸造"
                                    }
                                ],
                                "label": "(32325)有色金属铸造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3263261)铜压延加工"
                                    },
                                    {
                                        "label": "(3263262)铝压延加工"
                                    },
                                    {
                                        "label": "(3263264)稀有稀土金属压延加工"
                                    },
                                    {
                                        "label": "(3263269)其他有色金属压延加工"
                                    }
                                ],
                                "label": "(32326)有色金属压延加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3213213)镍钴冶炼"
                                    },
                                    {
                                        "label": "(3213219)其他常用有色金属冶炼"
                                    }
                                ],
                                "label": "(32321)鸡的饲养"
                            },
                            {
                                "label": "(32322)鸭的饲养"
                            }
                        ],
                        "label": "(332)家禽饲养"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(3913911)计算机整机制造"
                                    },
                                    {
                                        "label": "(3913912)计算机零部件制造"
                                    },
                                    {
                                        "label": "(3913913)计算机外围设备制造"
                                    },
                                    {
                                        "label": "(3913919)其他计算机制造"
                                    }
                                ],
                                "label": "(39391)计算机制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3923921)通信系统设备制造"
                                    },
                                    {
                                        "label": "(3923922)通信终端设备制造"
                                    }
                                ],
                                "label": "(39392)通信设备制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3933931)广播电视节目制作及发射设备制造"
                                    },
                                    {
                                        "label": "(3933932)广播电视接收设备及器材制造"
                                    },
                                    {
                                        "label": "(3933939)应用电视设备及其他广播电视设备制造"
                                    }
                                ],
                                "label": "(39393)广播电视设备制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3943940)雷达及配套设备制造"
                                    }
                                ],
                                "label": "(39394)雷达及配套设备制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3953952)音响设备制造"
                                    },
                                    {
                                        "label": "(3953953)影视录放设备制造"
                                    }
                                ],
                                "label": "(39395)视听设备制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3963962)半导体分立器件制造"
                                    },
                                    {
                                        "label": "(3963963)集成电路制造"
                                    },
                                    {
                                        "label": "(3963969)光电子器件及其他电子器件制造"
                                    }
                                ],
                                "label": "(39396)电子器件制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3973971)电子元件及组件制造"
                                    },
                                    {
                                        "label": "(3973972)印制电路板制造"
                                    }
                                ],
                                "label": "(39397)电子元件制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(3993990)其他电子设备制造"
                                    }
                                ],
                                "label": "(39399)其他电子设备制造"
                            },
                            {
                                "label": "(39390)其他畜牧业"
                            }
                        ],
                        "label": "(339)其他畜牧业"
                    }
                ],
                "label": "(A3)畜牧业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(4114119)其他日用杂品制造"
                                    }
                                ],
                                "label": "(41411)日用杂品制造"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(4134130)核辐射加工"
                                    }
                                ],
                                "label": "(41413)核辐射加工"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(4194190)其他未列明制造业"
                                    }
                                ],
                                "label": "(41419)其他未列明制造业"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(4114119)其他日用杂品制造"
                                    }
                                ],
                                "label": "(41411)海水养殖"
                            },
                            {
                                "label": "(41412)内陆养殖"
                            }
                        ],
                        "label": "(441)水产养殖"
                    }
                ],
                "label": "(A4)渔业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(5115111)谷物、豆及薯类批发"
                                    },
                                    {
                                        "label": "(5115113)饲料批发"
                                    }
                                ],
                                "label": "(51511)农、林、牧产品批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5125123)果品、蔬菜批发"
                                    },
                                    {
                                        "label": "(5125124)肉、禽、蛋、奶及水产品批发"
                                    },
                                    {
                                        "label": "(5125126)营养和保健品批发"
                                    },
                                    {
                                        "label": "(5125127)酒、饮料及茶叶批发"
                                    },
                                    {
                                        "label": "(5125129)其他食品批发"
                                    }
                                ],
                                "label": "(51512)食品、饮料及烟草制品批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5135131)纺织品、针织品及原料批发"
                                    },
                                    {
                                        "label": "(5135132)服装批发"
                                    },
                                    {
                                        "label": "(5135134)化妆品及卫生用品批发"
                                    },
                                    {
                                        "label": "(5135135)厨房、卫生间用具及日用杂货批发"
                                    },
                                    {
                                        "label": "(5135136)灯具、装饰物品批发"
                                    },
                                    {
                                        "label": "(5135137)家用电器批发"
                                    },
                                    {
                                        "label": "(5135139)其他家庭用品批发"
                                    }
                                ],
                                "label": "(51513)纺织、服装及家庭用品批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5145141)文具用品批发"
                                    },
                                    {
                                        "label": "(5145143)图书批发"
                                    },
                                    {
                                        "label": "(5145146)首饰、工艺品及收藏品批发"
                                    },
                                    {
                                        "label": "(5145149)其他文化用品批发"
                                    }
                                ],
                                "label": "(51514)文化、体育用品及器材批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5155151)西药批发"
                                    },
                                    {
                                        "label": "(5155152)中药批发"
                                    },
                                    {
                                        "label": "(5155153)医疗用品及器材批发"
                                    }
                                ],
                                "label": "(51515)医药及医疗器材批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5165161)煤炭及制品批发"
                                    },
                                    {
                                        "label": "(5165162)石油及制品批发"
                                    },
                                    {
                                        "label": "(5165163)非金属矿及制品批发"
                                    },
                                    {
                                        "label": "(5165164)金属及金属矿批发"
                                    },
                                    {
                                        "label": "(5165165)建材批发"
                                    },
                                    {
                                        "label": "(5165166)化肥批发"
                                    },
                                    {
                                        "label": "(5165167)农药批发"
                                    },
                                    {
                                        "label": "(5165169)其他化工产品批发"
                                    }
                                ],
                                "label": "(51516)矿产品、建材及化工产品批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5175172)汽车批发"
                                    },
                                    {
                                        "label": "(5175173)汽车零配件批发"
                                    },
                                    {
                                        "label": "(5175175)五金产品批发"
                                    },
                                    {
                                        "label": "(5175176)电气设备批发"
                                    },
                                    {
                                        "label": "(5175177)计算机、软件及辅助设备批发"
                                    },
                                    {
                                        "label": "(5175178)通讯及广播电视设备批发"
                                    },
                                    {
                                        "label": "(5175179)其他机械设备及电子产品批发"
                                    }
                                ],
                                "label": "(51517)机械设备、五金产品及电子产品批发"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5185181)贸易代理"
                                    }
                                ],
                                "label": "(51518)贸易经纪与代理"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5195199)其他未列明批发业"
                                    }
                                ],
                                "label": "(51519)其他批发业"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5135131)纺织品、针织品及原料批发"
                                    },
                                    {
                                        "label": "(5135132)服装批发"
                                    },
                                    {
                                        "label": "(5135134)化妆品及卫生用品批发"
                                    },
                                    {
                                        "label": "(5135135)厨房、卫生间用具及日用杂货批发"
                                    },
                                    {
                                        "label": "(5135136)灯具、装饰物品批发"
                                    },
                                    {
                                        "label": "(5135137)家用电器批发"
                                    },
                                    {
                                        "label": "(5135139)其他家庭用品批发"
                                    }
                                ],
                                "label": "(51513)农产品初加工服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5195199)其他未列明批发业"
                                    }
                                ],
                                "label": "(51519)其他农业服务"
                            }
                        ],
                        "label": "(551)农业服务业"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(5215211)百货零售"
                                    },
                                    {
                                        "label": "(5215212)超级市场零售"
                                    },
                                    {
                                        "label": "(5215219)其他综合零售"
                                    }
                                ],
                                "label": "(52521)综合零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5225223)果品、蔬菜零售"
                                    },
                                    {
                                        "label": "(5225225)营养和保健品零售"
                                    },
                                    {
                                        "label": "(5225226)酒、饮料及茶叶零售"
                                    },
                                    {
                                        "label": "(5225229)其他食品零售"
                                    }
                                ],
                                "label": "(52522)食品、饮料及烟草制品专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5235231)纺织品及针织品零售"
                                    },
                                    {
                                        "label": "(5235234)化妆品及卫生用品零售"
                                    },
                                    {
                                        "label": "(5235235)钟表、眼镜零售"
                                    },
                                    {
                                        "label": "(5235237)厨房用具及日用杂品零售"
                                    }
                                ],
                                "label": "(52523)纺织、服装及日用品专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5245242)体育用品及器材零售"
                                    },
                                    {
                                        "label": "(5245243)图书、报刊零售"
                                    },
                                    {
                                        "label": "(5245245)珠宝首饰零售"
                                    },
                                    {
                                        "label": "(5245246)工艺美术品及收藏品零售"
                                    }
                                ],
                                "label": "(52524)文化、体育用品及器材专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5255251)药品零售"
                                    },
                                    {
                                        "label": "(5255252)医疗用品及器材零售"
                                    }
                                ],
                                "label": "(52525)医药及医疗器材专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5265261)汽车零售"
                                    },
                                    {
                                        "label": "(5265262)汽车零配件零售"
                                    },
                                    {
                                        "label": "(5265264)机动车燃料零售"
                                    }
                                ],
                                "label": "(52526)汽车、摩托车、燃料及零配件专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5275271)家用视听设备零售"
                                    },
                                    {
                                        "label": "(5275272)日用家电设备零售"
                                    },
                                    {
                                        "label": "(5275273)计算机、软件及辅助设备零售"
                                    },
                                    {
                                        "label": "(5275274)通信设备零售"
                                    },
                                    {
                                        "label": "(5275279)其他电子产品零售"
                                    }
                                ],
                                "label": "(52527)家用电器及电子产品专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5285283)家具零售"
                                    }
                                ],
                                "label": "(52528)五金、家具及室内装饰材料专门零售"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5295294)互联网零售"
                                    },
                                    {
                                        "label": "(5295299)其他未列明零售业"
                                    }
                                ],
                                "label": "(52529)货摊、无店铺及其他零售业"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(5215211)百货零售"
                                    },
                                    {
                                        "label": "(5215212)超级市场零售"
                                    },
                                    {
                                        "label": "(5215219)其他综合零售"
                                    }
                                ],
                                "label": "(52521)林业有害生物防治服务"
                            }
                        ],
                        "label": "(552)林业服务业"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(5325320)铁路货物运输"
                                    }
                                ],
                                "label": "(53532)铁路货物运输"
                            },
                            {
                                "label": "(53530)畜牧服务业"
                            }
                        ],
                        "label": "(553)畜牧服务业"
                    }
                ],
                "label": "(A5)农、林、牧、渔服务业"
            }
        ],
        "label": "（A)农、林、牧、渔业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(6116110)旅游饭店"
                                    }
                                ],
                                "label": "(61611)旅游饭店"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(6126120)一般旅馆"
                                    }
                                ],
                                "label": "(61612)一般旅馆"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(6196190)其他住宿业"
                                    }
                                ],
                                "label": "(61619)其他住宿业"
                            },
                            {
                                "label": "(61610)烟煤和无烟煤开采洗选"
                            }
                        ],
                        "label": "(661)烟煤和无烟煤开采洗选"
                    }
                ],
                "label": "(B6)煤炭开采和洗选业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(7217212)投资与资产管理"
                                    },
                                    {
                                        "label": "(7217213)单位后勤管理服务"
                                    },
                                    {
                                        "label": "(7217219)其他企业管理服务"
                                    }
                                ],
                                "label": "(72721)企业管理服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7227221)律师及相关法律服务"
                                    },
                                    {
                                        "label": "(7227229)其他法律服务"
                                    }
                                ],
                                "label": "(72722)法律服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7237231)会计、审计及税务服务"
                                    },
                                    {
                                        "label": "(7237232)市场调查"
                                    },
                                    {
                                        "label": "(7237233)社会经济咨询"
                                    },
                                    {
                                        "label": "(7237239)其他专业咨询"
                                    }
                                ],
                                "label": "(72723)咨询与调查"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7247240)广告业"
                                    }
                                ],
                                "label": "(72724)广告业"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7257250)知识产权服务"
                                    }
                                ],
                                "label": "(72725)知识产权服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7267262)职业中介服务"
                                    },
                                    {
                                        "label": "(7267263)劳务派遣服务"
                                    },
                                    {
                                        "label": "(7267269)其他人力资源服务"
                                    }
                                ],
                                "label": "(72726)人力资源服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7277271)旅行社服务"
                                    },
                                    {
                                        "label": "(7277272)旅游管理服务"
                                    },
                                    {
                                        "label": "(7277279)其他旅行社相关服务"
                                    }
                                ],
                                "label": "(72727)旅行社及相关服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7287281)安全服务"
                                    },
                                    {
                                        "label": "(7287282)安全系统监控服务"
                                    },
                                    {
                                        "label": "(7287289)其他安全保护服务"
                                    }
                                ],
                                "label": "(72728)安全保护服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(7297291)市场管理"
                                    },
                                    {
                                        "label": "(7297292)会议及展览服务"
                                    },
                                    {
                                        "label": "(7297294)办公服务"
                                    },
                                    {
                                        "label": "(7297295)信用服务"
                                    },
                                    {
                                        "label": "(7297296)担保服务"
                                    },
                                    {
                                        "label": "(7297299)其他未列明商务服务业"
                                    }
                                ],
                                "label": "(72729)其他商务服务业"
                            },
                            {
                                "label": "(72720)天然气开采"
                            }
                        ],
                        "label": "(772)天然气开采"
                    }
                ],
                "label": "(B7)石油和天然气开采业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(8118119)其他清洁服务"
                                    }
                                ],
                                "label": "(81811)清洁服务"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(8198190)其他未列明服务业"
                                    }
                                ],
                                "label": "(81819)其他未列明服务业"
                            },
                            {
                                "label": "(81810)铁矿采选"
                            }
                        ],
                        "label": "(881)铁矿采选"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "label": "(8218210)学前教育"
                                    }
                                ],
                                "label": "(82821)学前教育"
                            },
                            {
                                "children": [
                                    {
                                        "label": "(8298291)职业技能培训"
                                    },
                                    {
                                        "label": "(8298292)体校及体育培训"
                                    },
                                    {
                                        "label": "(8298293)文化艺术培训"
                                    },
                                    {
                                        "label": "(8298294)教育辅助服务"
                                    },
                                    {
                                        "label": "(8298299)其他未列明教育"
                                    }
                                ],
                                "label": "(82829)技能培训、教育辅助及其他教育"
                            },
                            {
                                "label": "(82820)锰矿、铬矿采选"
                            }
                        ],
                        "label": "(882)锰矿、铬矿采选"
                    }
                ],
                "label": "(B8)黑色金属矿采选业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(92921)金矿采选"
                            }
                        ],
                        "label": "(992)贵金属矿采选"
                    }
                ],
                "label": "(B9)有色金属矿采选业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1011011)石灰石、石膏开采"
                            },
                            {
                                "label": "(1011012)建筑装饰用石开采"
                            }
                        ],
                        "label": "(10101)土砂石开采"
                    },
                    {
                        "children": [
                            {
                                "label": "(1091099)其他未列明非金属矿采选"
                            }
                        ],
                        "label": "(10109)石棉及其他非金属矿采选"
                    }
                ],
                "label": "(B10)非金属矿采选业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1111110)煤炭开采和洗选辅助活动"
                            }
                        ],
                        "label": "(11111)煤炭开采和洗选辅助活动"
                    },
                    {
                        "children": [
                            {
                                "label": "(1121120)石油和天然气开采辅助活动"
                            }
                        ],
                        "label": "(11112)石油和天然气开采辅助活动"
                    },
                    {
                        "children": [
                            {
                                "label": "(1111110)煤炭开采和洗选辅助活动"
                            }
                        ],
                        "label": "(11111)稻谷种植"
                    },
                    {
                        "children": [
                            {
                                "label": "(1121120)石油和天然气开采辅助活动"
                            }
                        ],
                        "label": "(11112)小麦种植"
                    },
                    {
                        "label": "(11113)玉米种植"
                    },
                    {
                        "label": "(11119)其他谷物种植"
                    }
                ],
                "label": "(B11)开采辅助活动"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1201200)其他采矿业"
                            }
                        ],
                        "label": "(12120)其他采矿业"
                    },
                    {
                        "label": "(12122)油料种植"
                    },
                    {
                        "label": "(12123)薯类种植"
                    }
                ],
                "label": "(B12)其他采矿业"
            }
        ],
        "label": "（B)采矿业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1311310)谷物磨制"
                            }
                        ],
                        "label": "(13131)谷物磨制"
                    },
                    {
                        "children": [
                            {
                                "label": "(1321320)饲料加工"
                            }
                        ],
                        "label": "(13132)饲料加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1331331)食用植物油加工"
                            }
                        ],
                        "label": "(13133)植物油加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1341340)制糖业"
                            }
                        ],
                        "label": "(13134)制糖业"
                    },
                    {
                        "children": [
                            {
                                "label": "(1351351)牲畜屠宰"
                            },
                            {
                                "label": "(1351352)禽类屠宰"
                            },
                            {
                                "label": "(1351353)肉制品及副产品加工"
                            }
                        ],
                        "label": "(13135)屠宰及肉类加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1361361)水产品冷冻加工"
                            },
                            {
                                "label": "(1361363)水产饲料制造"
                            },
                            {
                                "label": "(1361369)其他水产品加工"
                            }
                        ],
                        "label": "(13136)水产品加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1371371)蔬菜加工"
                            },
                            {
                                "label": "(1371372)水果和坚果加工"
                            }
                        ],
                        "label": "(13137)蔬菜、水果和坚果加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1391391)淀粉及淀粉制品制造"
                            },
                            {
                                "label": "(1391392)豆制品制造"
                            },
                            {
                                "label": "(1391393)蛋品加工"
                            },
                            {
                                "label": "(1391399)其他未列明农副食品加工"
                            }
                        ],
                        "label": "(13139)其他农副食品加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1311310)谷物磨制"
                            }
                        ],
                        "label": "(13131)棉花种植"
                    }
                ],
                "label": "(C13)农副食品加工业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1411411)糕点、面包制造"
                            },
                            {
                                "label": "(1411419)饼干及其他焙烤食品制造"
                            }
                        ],
                        "label": "(14141)焙烤食品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1421421)糖果、巧克力制造"
                            }
                        ],
                        "label": "(14142)糖果、巧克力及蜜饯制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1431431)米、面制品制造"
                            },
                            {
                                "label": "(1431432)速冻食品制造"
                            },
                            {
                                "label": "(1431439)方便面及其他方便食品制造"
                            }
                        ],
                        "label": "(14143)方便食品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1441440)乳制品制造"
                            }
                        ],
                        "label": "(14144)乳制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1451453)蔬菜、水果罐头制造"
                            }
                        ],
                        "label": "(14145)罐头食品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1461462)酱油、食醋及类似制品制造"
                            },
                            {
                                "label": "(1461469)其他调味品、发酵制品制造"
                            }
                        ],
                        "label": "(14146)调味品、发酵制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1491491)营养食品制造"
                            },
                            {
                                "label": "(1491492)保健食品制造"
                            },
                            {
                                "label": "(1491495)食品及饲料添加剂制造"
                            },
                            {
                                "label": "(1491499)其他未列明食品制造"
                            }
                        ],
                        "label": "(14149)其他食品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1411411)糕点、面包制造"
                            },
                            {
                                "label": "(1411419)饼干及其他焙烤食品制造"
                            }
                        ],
                        "label": "(14141)蔬菜种植"
                    },
                    {
                        "children": [
                            {
                                "label": "(1421421)糖果、巧克力制造"
                            }
                        ],
                        "label": "(14142)食用菌种植"
                    },
                    {
                        "children": [
                            {
                                "label": "(1431431)米、面制品制造"
                            },
                            {
                                "label": "(1431432)速冻食品制造"
                            },
                            {
                                "label": "(1431439)方便面及其他方便食品制造"
                            }
                        ],
                        "label": "(14143)花卉种植"
                    },
                    {
                        "children": [
                            {
                                "label": "(1491491)营养食品制造"
                            },
                            {
                                "label": "(1491492)保健食品制造"
                            },
                            {
                                "label": "(1491495)食品及饲料添加剂制造"
                            },
                            {
                                "label": "(1491499)其他未列明食品制造"
                            }
                        ],
                        "label": "(14149)其他园艺作物种植"
                    }
                ],
                "label": "(C14)食品制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1511511)酒精制造"
                            },
                            {
                                "label": "(1511512)白酒制造"
                            },
                            {
                                "label": "(1511515)葡萄酒制造"
                            },
                            {
                                "label": "(1511519)其他酒制造"
                            }
                        ],
                        "label": "(15151)酒的制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1521522)瓶（罐）装饮用水制造"
                            },
                            {
                                "label": "(1521523)果菜汁及果菜汁饮料制造"
                            },
                            {
                                "label": "(1521524)含乳饮料和植物蛋白饮料制造"
                            },
                            {
                                "label": "(1521525)固体饮料制造"
                            },
                            {
                                "label": "(1521529)茶饮料及其他饮料制造"
                            }
                        ],
                        "label": "(15152)饮料制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1531530)精制茶加工"
                            }
                        ],
                        "label": "(15153)精制茶加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1511511)酒精制造"
                            },
                            {
                                "label": "(1511512)白酒制造"
                            },
                            {
                                "label": "(1511515)葡萄酒制造"
                            },
                            {
                                "label": "(1511519)其他酒制造"
                            }
                        ],
                        "label": "(15151)仁果类和核果类水果种植"
                    },
                    {
                        "children": [
                            {
                                "label": "(1531530)精制茶加工"
                            }
                        ],
                        "label": "(15153)柑橘类种植"
                    },
                    {
                        "label": "(15154)香蕉等亚热带水果种植"
                    },
                    {
                        "label": "(15159)其他水果种植"
                    }
                ],
                "label": "(C15)酒、饮料和精制茶制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1711711)棉纺纱加工"
                            },
                            {
                                "label": "(1711712)棉织造加工"
                            }
                        ],
                        "label": "(17171)棉纺织及印染精加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1721721)毛条和毛纱线加工"
                            },
                            {
                                "label": "(1721723)毛染整精加工"
                            }
                        ],
                        "label": "(17172)毛纺织及染整精加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1741742)绢纺和丝织加工"
                            }
                        ],
                        "label": "(17174)丝绢纺织及印染精加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1751751)化纤织造加工"
                            },
                            {
                                "label": "(1751752)化纤织物染整精加工"
                            }
                        ],
                        "label": "(17175)化纤织造及印染精加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1761763)针织或钩针编织品制造"
                            }
                        ],
                        "label": "(17176)针织或钩针编织物及其制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1771771)床上用品制造"
                            },
                            {
                                "label": "(1771773)窗帘、布艺类产品制造"
                            }
                        ],
                        "label": "(17177)家用纺织制成品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1781781)非织造布制造"
                            },
                            {
                                "label": "(1781782)绳、索、缆制造"
                            },
                            {
                                "label": "(1781784)篷、帆布制造"
                            },
                            {
                                "label": "(1781789)其他非家用纺织制成品制造"
                            }
                        ],
                        "label": "(17178)非家用纺织制成品制造"
                    },
                    {
                        "label": "(17170)中药材种植"
                    }
                ],
                "label": "(C17)纺织业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1811810)机织服装制造"
                            }
                        ],
                        "label": "(18181)机织服装制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1821820)针织或钩针编织服装制造"
                            }
                        ],
                        "label": "(18182)针织或钩针编织服装制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1831830)服饰制造"
                            }
                        ],
                        "label": "(18183)服饰制造"
                    }
                ],
                "label": "(C18)纺织服装、服饰业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(1911910)皮革鞣制加工"
                            }
                        ],
                        "label": "(19191)皮革鞣制加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1921921)皮革服装制造"
                            },
                            {
                                "label": "(1921922)皮箱、包（袋）制造"
                            },
                            {
                                "label": "(1921929)其他皮革制品制造"
                            }
                        ],
                        "label": "(19192)皮革制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1931932)毛皮服装加工"
                            }
                        ],
                        "label": "(19193)毛皮鞣制及制品加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(1941942)羽毛（绒）制品加工"
                            }
                        ],
                        "label": "(19194)羽毛(绒)加工及制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(1951952)皮鞋制造"
                            },
                            {
                                "label": "(1951953)塑料鞋制造"
                            },
                            {
                                "label": "(1951954)橡胶鞋制造"
                            },
                            {
                                "label": "(1951959)其他制鞋业"
                            }
                        ],
                        "label": "(19195)制鞋业"
                    },
                    {
                        "label": "(19190)其他农业"
                    }
                ],
                "label": "(C19)皮革、毛皮、羽毛及其制品和制鞋业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2012011)锯材加工"
                            },
                            {
                                "label": "(2012012)木片加工"
                            },
                            {
                                "label": "(2012019)其他木材加工"
                            }
                        ],
                        "label": "(20201)木材加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(2022021)胶合板制造"
                            },
                            {
                                "label": "(2022022)纤维板制造"
                            },
                            {
                                "label": "(2022023)刨花板制造"
                            }
                        ],
                        "label": "(20202)人造板制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2032031)建筑用木料及木材组件加工"
                            },
                            {
                                "label": "(2032032)木门窗、楼梯制造"
                            },
                            {
                                "label": "(2032033)地板制造"
                            },
                            {
                                "label": "(2032034)木制容器制造"
                            },
                            {
                                "label": "(2032039)软木制品及其他木制品制造"
                            }
                        ],
                        "label": "(20203)木制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2042041)竹制品制造"
                            }
                        ],
                        "label": "(20204)竹、藤、棕、草等制品制造"
                    }
                ],
                "label": "(C20)木材加工和木、竹、藤、棕、草制品业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2112110)木质家具制造"
                            }
                        ],
                        "label": "(21211)木质家具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2122120)竹、藤家具制造"
                            }
                        ],
                        "label": "(21212)竹、藤家具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2132130)金属家具制造"
                            }
                        ],
                        "label": "(21213)金属家具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2192190)其他家具制造"
                            }
                        ],
                        "label": "(21219)其他家具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2122120)竹、藤家具制造"
                            }
                        ],
                        "label": "(21212)林木育苗"
                    }
                ],
                "label": "(C21)家具制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2222221)机制纸及纸板制造"
                            },
                            {
                                "label": "(2222223)加工纸制造"
                            }
                        ],
                        "label": "(22222)造纸"
                    },
                    {
                        "children": [
                            {
                                "label": "(2232231)纸和纸板容器制造"
                            },
                            {
                                "label": "(2232239)其他纸制品制造"
                            }
                        ],
                        "label": "(22223)纸制品制造"
                    }
                ],
                "label": "(C22)造纸和纸制品业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2312311)书、报刊印刷"
                            },
                            {
                                "label": "(2312312)本册印制"
                            },
                            {
                                "label": "(2312319)包装装潢及其他印刷"
                            }
                        ],
                        "label": "(23231)印刷"
                    },
                    {
                        "children": [
                            {
                                "label": "(2322320)装订及印刷相关服务"
                            }
                        ],
                        "label": "(23232)装订及印刷相关服务"
                    },
                    {
                        "label": "(23230)森林经营和管护"
                    }
                ],
                "label": "(C23)印刷和记录媒介复制业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2412413)教学用模型及教具制造"
                            },
                            {
                                "label": "(2412419)其他文教办公用品制造"
                            }
                        ],
                        "label": "(24241)文教办公用品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2422422)西乐器制造"
                            },
                            {
                                "label": "(2422423)电子乐器制造"
                            }
                        ],
                        "label": "(24242)乐器制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2432432)金属工艺品制造"
                            },
                            {
                                "label": "(2432436)抽纱刺绣工艺品制造"
                            },
                            {
                                "label": "(2432437)地毯、挂毯制造"
                            },
                            {
                                "label": "(2432438)珠宝首饰及有关物品制造"
                            },
                            {
                                "label": "(2432439)其他工艺美术品制造"
                            }
                        ],
                        "label": "(24243)工艺美术品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2442442)体育器材及配件制造"
                            },
                            {
                                "label": "(2442443)训练健身器材制造"
                            },
                            {
                                "label": "(2442444)运动防护用具制造"
                            },
                            {
                                "label": "(2442449)其他体育用品制造"
                            }
                        ],
                        "label": "(24244)体育用品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2452450)玩具制造"
                            }
                        ],
                        "label": "(24245)玩具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2462461)露天游乐场所游乐设备制造"
                            },
                            {
                                "label": "(2462462)游艺用品及室内游艺器材制造"
                            },
                            {
                                "label": "(2462469)其他娱乐用品制造"
                            }
                        ],
                        "label": "(24246)游艺器材及娱乐用品制造"
                    }
                ],
                "label": "(C24)文教、工美、体育和娱乐用品制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2512511)原油加工及石油制品制造"
                            }
                        ],
                        "label": "(25251)精炼石油产品制造"
                    }
                ],
                "label": "(C25)石油加工、炼焦和核燃料加工业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2612611)无机酸制造"
                            },
                            {
                                "label": "(2612613)无机盐制造"
                            },
                            {
                                "label": "(2612614)有机化学原料制造"
                            },
                            {
                                "label": "(2612619)其他基础化学原料制造"
                            }
                        ],
                        "label": "(26261)基础化学原料制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2622624)复混肥料制造"
                            },
                            {
                                "label": "(2622625)有机肥料及微生物肥料制造"
                            },
                            {
                                "label": "(2622629)其他肥料制造"
                            }
                        ],
                        "label": "(26262)肥料制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2632631)化学农药制造"
                            },
                            {
                                "label": "(2632632)生物化学农药及微生物农药制造"
                            }
                        ],
                        "label": "(26263)农药制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2642641)涂料制造"
                            },
                            {
                                "label": "(2642642)油墨及类似产品制造"
                            },
                            {
                                "label": "(2642644)染料制造"
                            },
                            {
                                "label": "(2642645)密封用填料及类似品制造"
                            }
                        ],
                        "label": "(26264)涂料、油墨、颜料及类似产品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2652651)初级形态塑料及合成树脂制造"
                            },
                            {
                                "label": "(2652652)合成橡胶制造"
                            },
                            {
                                "label": "(2652653)合成纤维单（聚合）体制造"
                            },
                            {
                                "label": "(2652659)其他合成材料制造"
                            }
                        ],
                        "label": "(26265)合成材料制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2662661)化学试剂和助剂制造"
                            },
                            {
                                "label": "(2662662)专项化学用品制造"
                            },
                            {
                                "label": "(2662663)林产化学产品制造"
                            },
                            {
                                "label": "(2662664)信息化学品制造"
                            },
                            {
                                "label": "(2662665)环境污染处理专用药剂材料制造"
                            },
                            {
                                "label": "(2662669)其他专用化学产品制造"
                            }
                        ],
                        "label": "(26266)专用化学产品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2672671)炸药及火工产品制造"
                            }
                        ],
                        "label": "(26267)炸药、火工及焰火产品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2682681)肥皂及合成洗涤剂制造"
                            },
                            {
                                "label": "(2682682)化妆品制造"
                            },
                            {
                                "label": "(2682684)香料、香精制造"
                            },
                            {
                                "label": "(2682689)其他日用化学产品制造"
                            }
                        ],
                        "label": "(26268)日用化学产品制造"
                    }
                ],
                "label": "(C26)化学原料和化学制品制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2712710)化学药品原料药制造"
                            }
                        ],
                        "label": "(27271)化学药品原料药制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2722720)化学药品制剂制造"
                            }
                        ],
                        "label": "(27272)化学药品制剂制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2732730)中药饮片加工"
                            }
                        ],
                        "label": "(27273)中药饮片加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(2742740)中成药生产"
                            }
                        ],
                        "label": "(27274)中成药生产"
                    },
                    {
                        "children": [
                            {
                                "label": "(2752750)兽用药品制造"
                            }
                        ],
                        "label": "(27275)兽用药品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2762760)生物药品制造"
                            }
                        ],
                        "label": "(27276)生物药品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2772770)卫生材料及医药用品制造"
                            }
                        ],
                        "label": "(27277)卫生材料及医药用品制造"
                    }
                ],
                "label": "(C27)医药制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2812812)人造纤维（纤维素纤维）制造"
                            }
                        ],
                        "label": "(28281)纤维素纤维原料及纤维制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(2822822)涤纶纤维制造"
                            },
                            {
                                "label": "(2822825)丙纶纤维制造"
                            },
                            {
                                "label": "(2822829)其他合成纤维制造"
                            }
                        ],
                        "label": "(28282)合成纤维制造"
                    }
                ],
                "label": "(C28)化学纤维制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(2912911)轮胎制造"
                            },
                            {
                                "label": "(2912912)橡胶板、管、带制造"
                            },
                            {
                                "label": "(2912913)橡胶零件制造"
                            },
                            {
                                "label": "(2912919)其他橡胶制品制造"
                            }
                        ],
                        "label": "(29291)橡胶制品业"
                    },
                    {
                        "children": [
                            {
                                "label": "(2922921)塑料薄膜制造"
                            },
                            {
                                "label": "(2922922)塑料板、管、型材制造"
                            },
                            {
                                "label": "(2922923)塑料丝、绳及编织品制造"
                            },
                            {
                                "label": "(2922924)泡沫塑料制造"
                            },
                            {
                                "label": "(2922925)塑料人造革、合成革制造"
                            },
                            {
                                "label": "(2922926)塑料包装箱及容器制造"
                            },
                            {
                                "label": "(2922927)日用塑料制品制造"
                            },
                            {
                                "label": "(2922928)塑料零件制造"
                            },
                            {
                                "label": "(2922929)其他塑料制品制造"
                            }
                        ],
                        "label": "(29292)塑料制品业"
                    }
                ],
                "label": "(C29)橡胶和塑料制品业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3013011)水泥制造"
                            },
                            {
                                "label": "(3013012)石灰和石膏制造"
                            }
                        ],
                        "label": "(30301)水泥、石灰和石膏制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3023021)水泥制品制造"
                            },
                            {
                                "label": "(3023022)砼结构构件制造"
                            },
                            {
                                "label": "(3023024)轻质建筑材料制造"
                            },
                            {
                                "label": "(3023029)其他水泥类似制品制造"
                            }
                        ],
                        "label": "(30302)石膏、水泥制品及类似制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3033031)粘土砖瓦及建筑砌块制造"
                            },
                            {
                                "label": "(3033032)建筑陶瓷制品制造"
                            },
                            {
                                "label": "(3033033)建筑用石加工"
                            },
                            {
                                "label": "(3033034)防水建筑材料制造"
                            },
                            {
                                "label": "(3033035)隔热和隔音材料制造"
                            },
                            {
                                "label": "(3033039)其他建筑材料制造"
                            }
                        ],
                        "label": "(30303)砖瓦、石材等建筑材料制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3043049)其他玻璃制造"
                            }
                        ],
                        "label": "(30304)玻璃制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3053051)技术玻璃制品制造"
                            },
                            {
                                "label": "(3053052)光学玻璃制造"
                            },
                            {
                                "label": "(3053054)日用玻璃制品制造"
                            },
                            {
                                "label": "(3053059)其他玻璃制品制造"
                            }
                        ],
                        "label": "(30305)玻璃制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3063061)玻璃纤维及制品制造"
                            },
                            {
                                "label": "(3063062)玻璃纤维增强塑料制品制造"
                            }
                        ],
                        "label": "(30306)玻璃纤维和玻璃纤维增强塑料制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3073072)特种陶瓷制品制造"
                            },
                            {
                                "label": "(3073073)日用陶瓷制品制造"
                            },
                            {
                                "label": "(3073079)园林、陈设艺术及其他陶瓷制品制造"
                            }
                        ],
                        "label": "(30307)陶瓷制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3083082)云母制品制造"
                            },
                            {
                                "label": "(3083089)耐火陶瓷制品及其他耐火材料制造"
                            }
                        ],
                        "label": "(30308)耐火材料制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3093091)石墨及碳素制品制造"
                            },
                            {
                                "label": "(3093099)其他非金属矿物制品制造"
                            }
                        ],
                        "label": "(30309)石墨及其他非金属矿物制品制造"
                    }
                ],
                "label": "(C30)非金属矿物制品业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3133130)黑色金属铸造"
                            }
                        ],
                        "label": "(31313)黑色金属铸造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3143140)钢压延加工"
                            }
                        ],
                        "label": "(31314)钢压延加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(3153150)铁合金冶炼"
                            }
                        ],
                        "label": "(31315)铁合金冶炼"
                    },
                    {
                        "label": "(31311)牛的饲养"
                    },
                    {
                        "label": "(31312)马的饲养"
                    },
                    {
                        "children": [
                            {
                                "label": "(3133130)黑色金属铸造"
                            }
                        ],
                        "label": "(31313)猪的饲养"
                    },
                    {
                        "children": [
                            {
                                "label": "(3143140)钢压延加工"
                            }
                        ],
                        "label": "(31314)羊的饲养"
                    }
                ],
                "label": "(C31)黑色金属冶炼和压延加工业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3213213)镍钴冶炼"
                            },
                            {
                                "label": "(3213219)其他常用有色金属冶炼"
                            }
                        ],
                        "label": "(32321)常用有色金属冶炼"
                    },
                    {
                        "children": [
                            {
                                "label": "(3233232)稀土金属冶炼"
                            },
                            {
                                "label": "(3233239)其他稀有金属冶炼"
                            }
                        ],
                        "label": "(32323)稀有稀土金属冶炼"
                    },
                    {
                        "children": [
                            {
                                "label": "(3243240)有色金属合金制造"
                            }
                        ],
                        "label": "(32324)有色金属合金制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3253250)有色金属铸造"
                            }
                        ],
                        "label": "(32325)有色金属铸造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3263261)铜压延加工"
                            },
                            {
                                "label": "(3263262)铝压延加工"
                            },
                            {
                                "label": "(3263264)稀有稀土金属压延加工"
                            },
                            {
                                "label": "(3263269)其他有色金属压延加工"
                            }
                        ],
                        "label": "(32326)有色金属压延加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(3213213)镍钴冶炼"
                            },
                            {
                                "label": "(3213219)其他常用有色金属冶炼"
                            }
                        ],
                        "label": "(32321)鸡的饲养"
                    },
                    {
                        "label": "(32322)鸭的饲养"
                    }
                ],
                "label": "(C32)有色金属冶炼和压延加工业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3313311)金属结构制造"
                            },
                            {
                                "label": "(3313312)金属门窗制造"
                            }
                        ],
                        "label": "(33331)结构性金属制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3323321)切削工具制造"
                            },
                            {
                                "label": "(3323324)刀剪及类似日用金属工具制造"
                            },
                            {
                                "label": "(3323329)其他金属工具制造"
                            }
                        ],
                        "label": "(33332)金属工具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3333331)集装箱制造"
                            },
                            {
                                "label": "(3333332)金属压力容器制造"
                            },
                            {
                                "label": "(3333333)金属包装容器制造"
                            }
                        ],
                        "label": "(33333)集装箱及金属包装容器制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3343340)金属丝绳及其制品制造"
                            }
                        ],
                        "label": "(33334)金属丝绳及其制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3353351)建筑、家具用金属配件制造"
                            },
                            {
                                "label": "(3353352)建筑装饰及水暖管道零件制造"
                            },
                            {
                                "label": "(3353353)安全、消防用金属制品制造"
                            },
                            {
                                "label": "(3353359)其他建筑、安全用金属制品制造"
                            }
                        ],
                        "label": "(33335)建筑、安全用金属制品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3363360)金属表面处理及热处理加工"
                            }
                        ],
                        "label": "(33336)金属表面处理及热处理加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(3383381)金属制厨房用器具制造"
                            },
                            {
                                "label": "(3383383)金属制卫生器具制造"
                            },
                            {
                                "label": "(3383389)其他金属制日用品制造"
                            }
                        ],
                        "label": "(33338)金属制日用品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3393391)锻件及粉末冶金制品制造"
                            },
                            {
                                "label": "(3393392)交通及公共管理用金属标牌制造"
                            },
                            {
                                "label": "(3393399)其他未列明金属制品制造"
                            }
                        ],
                        "label": "(33339)其他金属制品制造"
                    }
                ],
                "label": "(C33)金属制品业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3413411)锅炉及辅助设备制造"
                            },
                            {
                                "label": "(3413412)内燃机及配件制造"
                            },
                            {
                                "label": "(3413413)汽轮机及辅机制造"
                            },
                            {
                                "label": "(3413415)风能原动设备制造"
                            },
                            {
                                "label": "(3413419)其他原动设备制造"
                            }
                        ],
                        "label": "(34341)锅炉及原动设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3423421)金属切削机床制造"
                            },
                            {
                                "label": "(3423422)金属成形机床制造"
                            },
                            {
                                "label": "(3423423)铸造机械制造"
                            },
                            {
                                "label": "(3423424)金属切割及焊接设备制造"
                            },
                            {
                                "label": "(3423425)机床附件制造"
                            },
                            {
                                "label": "(3423429)其他金属加工机械制造"
                            }
                        ],
                        "label": "(34342)金属加工机械制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3433431)轻小型起重设备制造"
                            },
                            {
                                "label": "(3433432)起重机制造"
                            },
                            {
                                "label": "(3433433)生产专用车辆制造"
                            },
                            {
                                "label": "(3433434)连续搬运设备制造"
                            },
                            {
                                "label": "(3433435)电梯、自动扶梯及升降机制造"
                            },
                            {
                                "label": "(3433439)其他物料搬运设备制造"
                            }
                        ],
                        "label": "(34343)物料搬运设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3443441)泵及真空设备制造"
                            },
                            {
                                "label": "(3443442)气体压缩机械制造"
                            },
                            {
                                "label": "(3443443)阀门和旋塞制造"
                            },
                            {
                                "label": "(3443444)液压和气压动力机械及元件制造"
                            }
                        ],
                        "label": "(34344)泵、阀门、压缩机及类似机械制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3453451)轴承制造"
                            },
                            {
                                "label": "(3453452)齿轮及齿轮减、变速箱制造"
                            },
                            {
                                "label": "(3453459)其他传动部件制造"
                            }
                        ],
                        "label": "(34345)轴承、齿轮和传动部件制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3463461)烘炉、熔炉及电炉制造"
                            },
                            {
                                "label": "(3463462)风机、风扇制造"
                            },
                            {
                                "label": "(3463463)气体、液体分离及纯净设备制造"
                            },
                            {
                                "label": "(3463464)制冷、空调设备制造"
                            },
                            {
                                "label": "(3463467)衡器制造"
                            },
                            {
                                "label": "(3463468)包装专用设备制造"
                            }
                        ],
                        "label": "(34346)烘炉、风机、衡器、包装等设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3473475)计算器及货币专用设备制造"
                            },
                            {
                                "label": "(3473479)其他文化、办公用机械制造"
                            }
                        ],
                        "label": "(34347)文化、办公用机械制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3483481)金属密封件制造"
                            },
                            {
                                "label": "(3483482)紧固件制造"
                            },
                            {
                                "label": "(3483483)弹簧制造"
                            },
                            {
                                "label": "(3483484)机械零部件加工"
                            },
                            {
                                "label": "(3483489)其他通用零部件制造"
                            }
                        ],
                        "label": "(34348)通用零部件制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3493490)其他通用设备制造业"
                            }
                        ],
                        "label": "(34349)其他通用设备制造业"
                    }
                ],
                "label": "(C34)通用设备制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3513511)矿山机械制造"
                            },
                            {
                                "label": "(3513512)石油钻采专用设备制造"
                            },
                            {
                                "label": "(3513513)建筑工程用机械制造"
                            },
                            {
                                "label": "(3513514)海洋工程专用设备制造"
                            },
                            {
                                "label": "(3513515)建筑材料生产专用机械制造"
                            },
                            {
                                "label": "(3513516)冶金专用设备制造"
                            }
                        ],
                        "label": "(35351)采矿、冶金、建筑专用设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3523521)炼油、化工生产专用设备制造"
                            },
                            {
                                "label": "(3523522)橡胶加工专用设备制造"
                            },
                            {
                                "label": "(3523523)塑料加工专用设备制造"
                            },
                            {
                                "label": "(3523525)模具制造"
                            },
                            {
                                "label": "(3523529)其他非金属加工专用设备制造"
                            }
                        ],
                        "label": "(35352)化工、木材、非金属加工专用设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3533531)食品、酒、饮料及茶生产专用设备制造"
                            },
                            {
                                "label": "(3533532)农副食品加工专用设备制造"
                            },
                            {
                                "label": "(3533533)烟草生产专用设备制造"
                            }
                        ],
                        "label": "(35353)食品、饮料、烟草及饲料生产专用设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3543541)制浆和造纸专用设备制造"
                            },
                            {
                                "label": "(3543542)印刷专用设备制造"
                            },
                            {
                                "label": "(3543543)日用化工专用设备制造"
                            },
                            {
                                "label": "(3543544)制药专用设备制造"
                            },
                            {
                                "label": "(3543546)玻璃、陶瓷和搪瓷制品生产专用设备制造"
                            },
                            {
                                "label": "(3543549)其他日用品生产专用设备制造"
                            }
                        ],
                        "label": "(35354)印刷、制药、日化及日用品生产专用设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3553551)纺织专用设备制造"
                            },
                            {
                                "label": "(3553553)缝制机械制造"
                            }
                        ],
                        "label": "(35355)纺织、服装和皮革加工专用设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3563561)电工机械专用设备制造"
                            },
                            {
                                "label": "(3563562)电子工业专用设备制造"
                            }
                        ],
                        "label": "(35356)电子和电工机械专用设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3573571)拖拉机制造"
                            },
                            {
                                "label": "(3573572)机械化农业及园艺机具制造"
                            },
                            {
                                "label": "(3573574)畜牧机械制造"
                            },
                            {
                                "label": "(3573575)渔业机械制造"
                            },
                            {
                                "label": "(3573576)农林牧渔机械配件制造"
                            },
                            {
                                "label": "(3573579)其他农、林、牧、渔业机械制造"
                            }
                        ],
                        "label": "(35357)农、林、牧、渔专用机械制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3583581)医疗诊断、监护及治疗设备制造"
                            },
                            {
                                "label": "(3583582)口腔科用设备及器具制造"
                            },
                            {
                                "label": "(3583583)医疗实验室及医用消毒设备和器具制造"
                            },
                            {
                                "label": "(3583584)医疗、外科及兽医用器械制造"
                            },
                            {
                                "label": "(3583585)机械治疗及病房护理设备制造"
                            },
                            {
                                "label": "(3583586)假肢、人工器官及植（介）入器械制造"
                            },
                            {
                                "label": "(3583589)其他医疗设备及器械制造"
                            }
                        ],
                        "label": "(35358)医疗仪器设备及器械制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3593591)环境保护专用设备制造"
                            },
                            {
                                "label": "(3593592)地质勘查专用设备制造"
                            },
                            {
                                "label": "(3593593)邮政专用机械及器材制造"
                            },
                            {
                                "label": "(3593594)商业、饮食、服务专用设备制造"
                            },
                            {
                                "label": "(3593595)社会公共安全设备及器材制造"
                            },
                            {
                                "label": "(3593596)交通安全、管制及类似专用设备制造"
                            },
                            {
                                "label": "(3593597)水资源专用机械制造"
                            },
                            {
                                "label": "(3593599)其他专用设备制造"
                            }
                        ],
                        "label": "(35359)环保、社会公共服务及其他专用设备制造"
                    }
                ],
                "label": "(C35)专用设备制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3623620)改装汽车制造"
                            }
                        ],
                        "label": "(36362)改装汽车制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3653650)汽车车身、挂车制造"
                            }
                        ],
                        "label": "(36365)汽车车身、挂车制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3663660)汽车零部件及配件制造"
                            }
                        ],
                        "label": "(36366)汽车零部件及配件制造"
                    }
                ],
                "label": "(C36)汽车制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3713711)铁路机车车辆及动车组制造"
                            },
                            {
                                "label": "(3713713)铁路机车车辆配件制造"
                            },
                            {
                                "label": "(3713714)铁路专用设备及器材、配件制造"
                            }
                        ],
                        "label": "(37371)铁路运输设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3723720)城市轨道交通设备制造"
                            }
                        ],
                        "label": "(37372)城市轨道交通设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3733732)非金属船舶制造"
                            },
                            {
                                "label": "(3733733)娱乐船和运动船制造"
                            },
                            {
                                "label": "(3733734)船用配套设备制造"
                            },
                            {
                                "label": "(3733739)航标器材及其他相关装置制造"
                            }
                        ],
                        "label": "(37373)船舶及相关装置制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3743743)航空、航天相关设备制造"
                            },
                            {
                                "label": "(3743749)其他航空航天器制造"
                            }
                        ],
                        "label": "(37374)航空、航天器及设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3753751)摩托车整车制造"
                            },
                            {
                                "label": "(3753752)摩托车零部件及配件制造"
                            }
                        ],
                        "label": "(37375)摩托车制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3763761)脚踏自行车及残疾人座车制造"
                            },
                            {
                                "label": "(3763762)助动自行车制造"
                            }
                        ],
                        "label": "(37376)自行车制造"
                    }
                ],
                "label": "(C37)铁路、船舶、航空航天和其他运输设备制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3813811)发电机及发电机组制造"
                            },
                            {
                                "label": "(3813812)电动机制造"
                            },
                            {
                                "label": "(3813819)微电机及其他电机制造"
                            }
                        ],
                        "label": "(38381)电机制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3823821)变压器、整流器和电感器制造"
                            },
                            {
                                "label": "(3823822)电容器及其配套设备制造"
                            },
                            {
                                "label": "(3823823)配电开关控制设备制造"
                            },
                            {
                                "label": "(3823824)电力电子元器件制造"
                            },
                            {
                                "label": "(3823825)光伏设备及元器件制造"
                            },
                            {
                                "label": "(3823829)其他输配电及控制设备制造"
                            }
                        ],
                        "label": "(38382)输配电及控制设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3833831)电线、电缆制造"
                            },
                            {
                                "label": "(3833832)光纤、光缆制造"
                            },
                            {
                                "label": "(3833833)绝缘制品制造"
                            },
                            {
                                "label": "(3833839)其他电工器材制造"
                            }
                        ],
                        "label": "(38383)电线、电缆、光缆及电工器材制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3843841)锂离子电池制造"
                            },
                            {
                                "label": "(3843842)镍氢电池制造"
                            },
                            {
                                "label": "(3843849)其他电池制造"
                            }
                        ],
                        "label": "(38384)电池制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3853851)家用制冷电器具制造"
                            },
                            {
                                "label": "(3853852)家用空气调节器制造"
                            },
                            {
                                "label": "(3853853)家用通风电器具制造"
                            },
                            {
                                "label": "(3853854)家用厨房电器具制造"
                            },
                            {
                                "label": "(3853855)家用清洁卫生电器具制造"
                            },
                            {
                                "label": "(3853856)家用美容、保健电器具制造"
                            },
                            {
                                "label": "(3853857)家用电力器具专用配件制造"
                            },
                            {
                                "label": "(3853859)其他家用电力器具制造"
                            }
                        ],
                        "label": "(38385)家用电力器具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3863861)燃气、太阳能及类似能源家用器具制造"
                            }
                        ],
                        "label": "(38386)非电力家用器具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3873871)电光源制造"
                            },
                            {
                                "label": "(3873872)照明灯具制造"
                            },
                            {
                                "label": "(3873879)灯用电器附件及其他照明器具制造"
                            }
                        ],
                        "label": "(38387)照明器具制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3893891)电气信号设备装置制造"
                            },
                            {
                                "label": "(3893899)其他未列明电气机械及器材制造"
                            }
                        ],
                        "label": "(38389)其他电气机械及器材制造"
                    }
                ],
                "label": "(C38)电气机械和器材制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(3913911)计算机整机制造"
                            },
                            {
                                "label": "(3913912)计算机零部件制造"
                            },
                            {
                                "label": "(3913913)计算机外围设备制造"
                            },
                            {
                                "label": "(3913919)其他计算机制造"
                            }
                        ],
                        "label": "(39391)计算机制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3923921)通信系统设备制造"
                            },
                            {
                                "label": "(3923922)通信终端设备制造"
                            }
                        ],
                        "label": "(39392)通信设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3933931)广播电视节目制作及发射设备制造"
                            },
                            {
                                "label": "(3933932)广播电视接收设备及器材制造"
                            },
                            {
                                "label": "(3933939)应用电视设备及其他广播电视设备制造"
                            }
                        ],
                        "label": "(39393)广播电视设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3943940)雷达及配套设备制造"
                            }
                        ],
                        "label": "(39394)雷达及配套设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3953952)音响设备制造"
                            },
                            {
                                "label": "(3953953)影视录放设备制造"
                            }
                        ],
                        "label": "(39395)视听设备制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3963962)半导体分立器件制造"
                            },
                            {
                                "label": "(3963963)集成电路制造"
                            },
                            {
                                "label": "(3963969)光电子器件及其他电子器件制造"
                            }
                        ],
                        "label": "(39396)电子器件制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3973971)电子元件及组件制造"
                            },
                            {
                                "label": "(3973972)印制电路板制造"
                            }
                        ],
                        "label": "(39397)电子元件制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(3993990)其他电子设备制造"
                            }
                        ],
                        "label": "(39399)其他电子设备制造"
                    },
                    {
                        "label": "(39390)其他畜牧业"
                    }
                ],
                "label": "(C39)计算机、通信和其他电子设备制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4014011)工业自动控制系统装置制造"
                            },
                            {
                                "label": "(4014012)电工仪器仪表制造"
                            },
                            {
                                "label": "(4014013)绘图、计算及测量仪器制造"
                            },
                            {
                                "label": "(4014014)实验分析仪器制造"
                            },
                            {
                                "label": "(4014015)试验机制造"
                            },
                            {
                                "label": "(4014019)供应用仪表及其他通用仪器制造"
                            }
                        ],
                        "label": "(40401)通用仪器仪表制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(4024021)环境监测专用仪器仪表制造"
                            },
                            {
                                "label": "(4024022)运输设备及生产用计数仪表制造"
                            },
                            {
                                "label": "(4024023)导航、气象及海洋专用仪器制造"
                            },
                            {
                                "label": "(4024024)农林牧渔专用仪器仪表制造"
                            },
                            {
                                "label": "(4024025)地质勘探和地震专用仪器制造"
                            },
                            {
                                "label": "(4024026)教学专用仪器制造"
                            },
                            {
                                "label": "(4024027)核子及核辐射测量仪器制造"
                            },
                            {
                                "label": "(4024028)电子测量仪器制造"
                            },
                            {
                                "label": "(4024029)其他专用仪器制造"
                            }
                        ],
                        "label": "(40402)专用仪器仪表制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(4034030)钟表与计时仪器制造"
                            }
                        ],
                        "label": "(40403)钟表与计时仪器制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(4044041)光学仪器制造"
                            },
                            {
                                "label": "(4044042)眼镜制造"
                            }
                        ],
                        "label": "(40404)光学仪器及眼镜制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(4094090)其他仪器仪表制造业"
                            }
                        ],
                        "label": "(40409)其他仪器仪表制造业"
                    }
                ],
                "label": "(C40)仪器仪表制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4114119)其他日用杂品制造"
                            }
                        ],
                        "label": "(41411)日用杂品制造"
                    },
                    {
                        "children": [
                            {
                                "label": "(4134130)核辐射加工"
                            }
                        ],
                        "label": "(41413)核辐射加工"
                    },
                    {
                        "children": [
                            {
                                "label": "(4194190)其他未列明制造业"
                            }
                        ],
                        "label": "(41419)其他未列明制造业"
                    },
                    {
                        "children": [
                            {
                                "label": "(4114119)其他日用杂品制造"
                            }
                        ],
                        "label": "(41411)海水养殖"
                    },
                    {
                        "label": "(41412)内陆养殖"
                    }
                ],
                "label": "(C41)其他制造业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4214210)金属废料和碎屑加工处理"
                            }
                        ],
                        "label": "(42421)金属废料和碎屑加工处理"
                    },
                    {
                        "children": [
                            {
                                "label": "(4224220)非金属废料和碎屑加工处理"
                            }
                        ],
                        "label": "(42422)非金属废料和碎屑加工处理"
                    }
                ],
                "label": "(C42)废弃资源综合利用业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4314310)金属制品修理"
                            }
                        ],
                        "label": "(43431)金属制品修理"
                    },
                    {
                        "children": [
                            {
                                "label": "(4324320)通用设备修理"
                            }
                        ],
                        "label": "(43432)通用设备修理"
                    },
                    {
                        "children": [
                            {
                                "label": "(4334330)专用设备修理"
                            }
                        ],
                        "label": "(43433)专用设备修理"
                    },
                    {
                        "children": [
                            {
                                "label": "(4344342)船舶修理"
                            },
                            {
                                "label": "(4344343)航空航天器修理"
                            }
                        ],
                        "label": "(43434)铁路、船舶、航空航天等运输设备修理"
                    },
                    {
                        "children": [
                            {
                                "label": "(4394390)其他机械和设备修理业"
                            }
                        ],
                        "label": "(43439)其他机械和设备修理业"
                    }
                ],
                "label": "(C43)金属制品、机械和设备修理业"
            }
        ],
        "label": "（C)制造业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4414412)水力发电"
                            },
                            {
                                "label": "(4414414)风力发电"
                            },
                            {
                                "label": "(4414415)太阳能发电"
                            },
                            {
                                "label": "(4414419)其他电力生产"
                            }
                        ],
                        "label": "(44441)电力生产"
                    },
                    {
                        "children": [
                            {
                                "label": "(4434430)热力生产和供应"
                            }
                        ],
                        "label": "(44443)热力生产和供应"
                    }
                ],
                "label": "(D44)电力、热力生产和供应业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4504500)燃气生产和供应业"
                            }
                        ],
                        "label": "(45450)燃气生产和供应业"
                    }
                ],
                "label": "(D45)燃气生产和供应业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4614610)自来水生产和供应"
                            }
                        ],
                        "label": "(46461)自来水生产和供应"
                    },
                    {
                        "children": [
                            {
                                "label": "(4624620)污水处理及其再生利用"
                            }
                        ],
                        "label": "(46462)污水处理及其再生利用"
                    },
                    {
                        "children": [
                            {
                                "label": "(4694690)其他水的处理、利用与分配"
                            }
                        ],
                        "label": "(46469)其他水的处理、利用与分配"
                    }
                ],
                "label": "(D46)水的生产和供应业"
            }
        ],
        "label": "（D)电力、热力、燃气及水生产和供应业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4704700)房屋建筑业"
                            }
                        ],
                        "label": "(47470)房屋建筑业"
                    }
                ],
                "label": "(E47)房屋建筑业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4814812)公路工程建筑"
                            },
                            {
                                "label": "(4814813)市政道路工程建筑"
                            },
                            {
                                "label": "(4814819)其他道路、隧道和桥梁工程建筑"
                            }
                        ],
                        "label": "(48481)铁路、道路、隧道和桥梁工程建筑"
                    },
                    {
                        "children": [
                            {
                                "label": "(4824821)水源及供水设施工程建筑"
                            },
                            {
                                "label": "(4824822)河湖治理及防洪设施工程建筑"
                            }
                        ],
                        "label": "(48482)水利和内河港口工程建筑"
                    },
                    {
                        "children": [
                            {
                                "label": "(4844840)工矿工程建筑"
                            }
                        ],
                        "label": "(48484)工矿工程建筑"
                    },
                    {
                        "children": [
                            {
                                "label": "(4854851)架线及设备工程建筑"
                            },
                            {
                                "label": "(4854852)管道工程建筑"
                            }
                        ],
                        "label": "(48485)架线和管道工程建筑"
                    },
                    {
                        "children": [
                            {
                                "label": "(4894890)其他土木工程建筑"
                            }
                        ],
                        "label": "(48489)其他土木工程建筑"
                    }
                ],
                "label": "(E48)土木工程建筑业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(4914910)电气安装"
                            }
                        ],
                        "label": "(49491)电气安装"
                    },
                    {
                        "children": [
                            {
                                "label": "(4924920)管道和设备安装"
                            }
                        ],
                        "label": "(49492)管道和设备安装"
                    },
                    {
                        "children": [
                            {
                                "label": "(4994990)其他建筑安装业"
                            }
                        ],
                        "label": "(49499)其他建筑安装业"
                    }
                ],
                "label": "(E49)建筑安装业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5015010)建筑装饰业"
                            }
                        ],
                        "label": "(50501)建筑装饰业"
                    },
                    {
                        "children": [
                            {
                                "label": "(5035030)提供施工设备服务"
                            }
                        ],
                        "label": "(50503)提供施工设备服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(5095090)其他未列明建筑业"
                            }
                        ],
                        "label": "(50509)其他未列明建筑业"
                    }
                ],
                "label": "(E50)建筑装饰和其他建筑业"
            }
        ],
        "label": "（E)建筑业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5115111)谷物、豆及薯类批发"
                            },
                            {
                                "label": "(5115113)饲料批发"
                            }
                        ],
                        "label": "(51511)农、林、牧产品批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5125123)果品、蔬菜批发"
                            },
                            {
                                "label": "(5125124)肉、禽、蛋、奶及水产品批发"
                            },
                            {
                                "label": "(5125126)营养和保健品批发"
                            },
                            {
                                "label": "(5125127)酒、饮料及茶叶批发"
                            },
                            {
                                "label": "(5125129)其他食品批发"
                            }
                        ],
                        "label": "(51512)食品、饮料及烟草制品批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5135131)纺织品、针织品及原料批发"
                            },
                            {
                                "label": "(5135132)服装批发"
                            },
                            {
                                "label": "(5135134)化妆品及卫生用品批发"
                            },
                            {
                                "label": "(5135135)厨房、卫生间用具及日用杂货批发"
                            },
                            {
                                "label": "(5135136)灯具、装饰物品批发"
                            },
                            {
                                "label": "(5135137)家用电器批发"
                            },
                            {
                                "label": "(5135139)其他家庭用品批发"
                            }
                        ],
                        "label": "(51513)纺织、服装及家庭用品批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5145141)文具用品批发"
                            },
                            {
                                "label": "(5145143)图书批发"
                            },
                            {
                                "label": "(5145146)首饰、工艺品及收藏品批发"
                            },
                            {
                                "label": "(5145149)其他文化用品批发"
                            }
                        ],
                        "label": "(51514)文化、体育用品及器材批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5155151)西药批发"
                            },
                            {
                                "label": "(5155152)中药批发"
                            },
                            {
                                "label": "(5155153)医疗用品及器材批发"
                            }
                        ],
                        "label": "(51515)医药及医疗器材批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5165161)煤炭及制品批发"
                            },
                            {
                                "label": "(5165162)石油及制品批发"
                            },
                            {
                                "label": "(5165163)非金属矿及制品批发"
                            },
                            {
                                "label": "(5165164)金属及金属矿批发"
                            },
                            {
                                "label": "(5165165)建材批发"
                            },
                            {
                                "label": "(5165166)化肥批发"
                            },
                            {
                                "label": "(5165167)农药批发"
                            },
                            {
                                "label": "(5165169)其他化工产品批发"
                            }
                        ],
                        "label": "(51516)矿产品、建材及化工产品批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5175172)汽车批发"
                            },
                            {
                                "label": "(5175173)汽车零配件批发"
                            },
                            {
                                "label": "(5175175)五金产品批发"
                            },
                            {
                                "label": "(5175176)电气设备批发"
                            },
                            {
                                "label": "(5175177)计算机、软件及辅助设备批发"
                            },
                            {
                                "label": "(5175178)通讯及广播电视设备批发"
                            },
                            {
                                "label": "(5175179)其他机械设备及电子产品批发"
                            }
                        ],
                        "label": "(51517)机械设备、五金产品及电子产品批发"
                    },
                    {
                        "children": [
                            {
                                "label": "(5185181)贸易代理"
                            }
                        ],
                        "label": "(51518)贸易经纪与代理"
                    },
                    {
                        "children": [
                            {
                                "label": "(5195199)其他未列明批发业"
                            }
                        ],
                        "label": "(51519)其他批发业"
                    },
                    {
                        "children": [
                            {
                                "label": "(5135131)纺织品、针织品及原料批发"
                            },
                            {
                                "label": "(5135132)服装批发"
                            },
                            {
                                "label": "(5135134)化妆品及卫生用品批发"
                            },
                            {
                                "label": "(5135135)厨房、卫生间用具及日用杂货批发"
                            },
                            {
                                "label": "(5135136)灯具、装饰物品批发"
                            },
                            {
                                "label": "(5135137)家用电器批发"
                            },
                            {
                                "label": "(5135139)其他家庭用品批发"
                            }
                        ],
                        "label": "(51513)农产品初加工服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(5195199)其他未列明批发业"
                            }
                        ],
                        "label": "(51519)其他农业服务"
                    }
                ],
                "label": "(F51)批发业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5215211)百货零售"
                            },
                            {
                                "label": "(5215212)超级市场零售"
                            },
                            {
                                "label": "(5215219)其他综合零售"
                            }
                        ],
                        "label": "(52521)综合零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5225223)果品、蔬菜零售"
                            },
                            {
                                "label": "(5225225)营养和保健品零售"
                            },
                            {
                                "label": "(5225226)酒、饮料及茶叶零售"
                            },
                            {
                                "label": "(5225229)其他食品零售"
                            }
                        ],
                        "label": "(52522)食品、饮料及烟草制品专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5235231)纺织品及针织品零售"
                            },
                            {
                                "label": "(5235234)化妆品及卫生用品零售"
                            },
                            {
                                "label": "(5235235)钟表、眼镜零售"
                            },
                            {
                                "label": "(5235237)厨房用具及日用杂品零售"
                            }
                        ],
                        "label": "(52523)纺织、服装及日用品专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5245242)体育用品及器材零售"
                            },
                            {
                                "label": "(5245243)图书、报刊零售"
                            },
                            {
                                "label": "(5245245)珠宝首饰零售"
                            },
                            {
                                "label": "(5245246)工艺美术品及收藏品零售"
                            }
                        ],
                        "label": "(52524)文化、体育用品及器材专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5255251)药品零售"
                            },
                            {
                                "label": "(5255252)医疗用品及器材零售"
                            }
                        ],
                        "label": "(52525)医药及医疗器材专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5265261)汽车零售"
                            },
                            {
                                "label": "(5265262)汽车零配件零售"
                            },
                            {
                                "label": "(5265264)机动车燃料零售"
                            }
                        ],
                        "label": "(52526)汽车、摩托车、燃料及零配件专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5275271)家用视听设备零售"
                            },
                            {
                                "label": "(5275272)日用家电设备零售"
                            },
                            {
                                "label": "(5275273)计算机、软件及辅助设备零售"
                            },
                            {
                                "label": "(5275274)通信设备零售"
                            },
                            {
                                "label": "(5275279)其他电子产品零售"
                            }
                        ],
                        "label": "(52527)家用电器及电子产品专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5285283)家具零售"
                            }
                        ],
                        "label": "(52528)五金、家具及室内装饰材料专门零售"
                    },
                    {
                        "children": [
                            {
                                "label": "(5295294)互联网零售"
                            },
                            {
                                "label": "(5295299)其他未列明零售业"
                            }
                        ],
                        "label": "(52529)货摊、无店铺及其他零售业"
                    },
                    {
                        "children": [
                            {
                                "label": "(5215211)百货零售"
                            },
                            {
                                "label": "(5215212)超级市场零售"
                            },
                            {
                                "label": "(5215219)其他综合零售"
                            }
                        ],
                        "label": "(52521)林业有害生物防治服务"
                    }
                ],
                "label": "(F52)零售业"
            }
        ],
        "label": "（F)批发和零售业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5325320)铁路货物运输"
                            }
                        ],
                        "label": "(53532)铁路货物运输"
                    },
                    {
                        "label": "(53530)畜牧服务业"
                    }
                ],
                "label": "(G53)铁路运输业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5425420)公路旅客运输"
                            }
                        ],
                        "label": "(54542)公路旅客运输"
                    },
                    {
                        "children": [
                            {
                                "label": "(5435430)道路货物运输"
                            }
                        ],
                        "label": "(54543)道路货物运输"
                    },
                    {
                        "children": [
                            {
                                "label": "(5445442)公路管理与养护"
                            },
                            {
                                "label": "(5445449)其他道路运输辅助活动"
                            }
                        ],
                        "label": "(54544)道路运输辅助活动"
                    }
                ],
                "label": "(G54)道路运输业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5515512)内河旅客运输"
                            },
                            {
                                "label": "(5515513)客运轮渡运输"
                            }
                        ],
                        "label": "(55551)水上旅客运输"
                    },
                    {
                        "children": [
                            {
                                "label": "(5525521)远洋货物运输"
                            },
                            {
                                "label": "(5525522)沿海货物运输"
                            },
                            {
                                "label": "(5525523)内河货物运输"
                            }
                        ],
                        "label": "(55552)水上货物运输"
                    },
                    {
                        "children": [
                            {
                                "label": "(5535532)货运港口"
                            },
                            {
                                "label": "(5535539)其他水上运输辅助活动"
                            }
                        ],
                        "label": "(55553)水上运输辅助活动"
                    }
                ],
                "label": "(G55)水上运输业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5625620)通用航空服务"
                            }
                        ],
                        "label": "(56562)通用航空服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(5635639)其他航空运输辅助活动"
                            }
                        ],
                        "label": "(56563)航空运输辅助活动"
                    }
                ],
                "label": "(G56)航空运输业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5705700)管道运输业"
                            }
                        ],
                        "label": "(57570)管道运输业"
                    }
                ],
                "label": "(G57)管道运输业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5815810)装卸搬运"
                            }
                        ],
                        "label": "(58581)装卸搬运"
                    },
                    {
                        "children": [
                            {
                                "label": "(5825821)货物运输代理"
                            },
                            {
                                "label": "(5825822)旅客票务代理"
                            }
                        ],
                        "label": "(58582)运输代理业"
                    }
                ],
                "label": "(G58)装卸搬运和运输代理业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(5995990)其他仓储业"
                            }
                        ],
                        "label": "(59599)其他仓储业"
                    }
                ],
                "label": "(G59)仓储业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6026020)快递服务"
                            }
                        ],
                        "label": "(60602)快递服务"
                    }
                ],
                "label": "(G60)邮政业"
            }
        ],
        "label": "（G)交通运输、仓储和邮政业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6116110)旅游饭店"
                            }
                        ],
                        "label": "(61611)旅游饭店"
                    },
                    {
                        "children": [
                            {
                                "label": "(6126120)一般旅馆"
                            }
                        ],
                        "label": "(61612)一般旅馆"
                    },
                    {
                        "children": [
                            {
                                "label": "(6196190)其他住宿业"
                            }
                        ],
                        "label": "(61619)其他住宿业"
                    },
                    {
                        "label": "(61610)烟煤和无烟煤开采洗选"
                    }
                ],
                "label": "(H61)住宿业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6216210)正餐服务"
                            }
                        ],
                        "label": "(62621)正餐服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6226220)快餐服务"
                            }
                        ],
                        "label": "(62622)快餐服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6236239)其他饮料及冷饮服务"
                            }
                        ],
                        "label": "(62623)饮料及冷饮服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6296299)其他未列明餐饮业"
                            }
                        ],
                        "label": "(62629)其他餐饮业"
                    }
                ],
                "label": "(H62)餐饮业"
            }
        ],
        "label": "（H)住宿和餐饮业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6316312)移动电信服务"
                            },
                            {
                                "label": "(6316319)其他电信服务"
                            }
                        ],
                        "label": "(63631)电信"
                    },
                    {
                        "children": [
                            {
                                "label": "(6326321)有线广播电视传输服务"
                            }
                        ],
                        "label": "(63632)广播电视传输服务"
                    }
                ],
                "label": "(I63)电信、广播电视和卫星传输服务"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6416410)互联网接入及相关服务"
                            }
                        ],
                        "label": "(64641)互联网接入及相关服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6426420)互联网信息服务"
                            }
                        ],
                        "label": "(64642)互联网信息服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6496490)其他互联网服务"
                            }
                        ],
                        "label": "(64649)其他互联网服务"
                    }
                ],
                "label": "(I64)互联网和相关服务"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6516510)软件开发"
                            }
                        ],
                        "label": "(65651)软件开发"
                    },
                    {
                        "children": [
                            {
                                "label": "(6526520)信息系统集成服务"
                            }
                        ],
                        "label": "(65652)信息系统集成服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6536530)信息技术咨询服务"
                            }
                        ],
                        "label": "(65653)信息技术咨询服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6546540)数据处理和存储服务"
                            }
                        ],
                        "label": "(65654)数据处理和存储服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6556550)集成电路设计"
                            }
                        ],
                        "label": "(65655)集成电路设计"
                    },
                    {
                        "children": [
                            {
                                "label": "(6596591)数字内容服务"
                            },
                            {
                                "label": "(6596592)呼叫中心"
                            },
                            {
                                "label": "(6596599)其他未列明信息技术服务业"
                            }
                        ],
                        "label": "(65659)其他信息技术服务业"
                    }
                ],
                "label": "(I65)软件和信息技术服务业"
            }
        ],
        "label": "（I)信息传输、软件和信息技术服务业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6626620)货币银行服务"
                            }
                        ],
                        "label": "(66662)货币银行服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6636631)金融租赁服务"
                            },
                            {
                                "label": "(6636639)其他非货币银行服务"
                            }
                        ],
                        "label": "(66663)非货币银行服务"
                    }
                ],
                "label": "(J66)货币金融服务"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6716712)证券经纪交易服务"
                            },
                            {
                                "label": "(6716713)基金管理服务"
                            }
                        ],
                        "label": "(67671)证券市场服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6726729)其他期货市场服务"
                            }
                        ],
                        "label": "(67672)期货市场服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6746740)资本投资服务"
                            }
                        ],
                        "label": "(67674)资本投资服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6796790)其他资本市场服务"
                            }
                        ],
                        "label": "(67679)其他资本市场服务"
                    }
                ],
                "label": "(J67)资本市场服务"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6826820)财产保险"
                            }
                        ],
                        "label": "(68682)财产保险"
                    },
                    {
                        "children": [
                            {
                                "label": "(6856850)保险经纪与代理服务"
                            }
                        ],
                        "label": "(68685)保险经纪与代理服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6896891)风险和损失评估"
                            }
                        ],
                        "label": "(68689)其他保险活动"
                    }
                ],
                "label": "(J68)保险业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(6926920)控股公司服务"
                            }
                        ],
                        "label": "(69692)控股公司服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6936930)非金融机构支付服务"
                            }
                        ],
                        "label": "(69693)非金融机构支付服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6946940)金融信息服务"
                            }
                        ],
                        "label": "(69694)金融信息服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(6996990)其他未列明金融业"
                            }
                        ],
                        "label": "(69699)其他未列明金融业"
                    }
                ],
                "label": "(J69)其他金融业"
            }
        ],
        "label": "（J)金融业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7027020)物业管理"
                            }
                        ],
                        "label": "(70702)物业管理"
                    },
                    {
                        "children": [
                            {
                                "label": "(7037030)房地产中介服务"
                            }
                        ],
                        "label": "(70703)房地产中介服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7047040)自有房地产经营活动"
                            }
                        ],
                        "label": "(70704)自有房地产经营活动"
                    }
                ],
                "label": "(K70)房地产业"
            }
        ],
        "label": "（K)房地产业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7117111)汽车租赁"
                            },
                            {
                                "label": "(7117113)建筑工程机械与设备租赁"
                            },
                            {
                                "label": "(7117114)计算机及通讯设备租赁"
                            },
                            {
                                "label": "(7117119)其他机械与设备租赁"
                            }
                        ],
                        "label": "(71711)机械设备租赁"
                    }
                ],
                "label": "(L71)租赁业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7217212)投资与资产管理"
                            },
                            {
                                "label": "(7217213)单位后勤管理服务"
                            },
                            {
                                "label": "(7217219)其他企业管理服务"
                            }
                        ],
                        "label": "(72721)企业管理服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7227221)律师及相关法律服务"
                            },
                            {
                                "label": "(7227229)其他法律服务"
                            }
                        ],
                        "label": "(72722)法律服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7237231)会计、审计及税务服务"
                            },
                            {
                                "label": "(7237232)市场调查"
                            },
                            {
                                "label": "(7237233)社会经济咨询"
                            },
                            {
                                "label": "(7237239)其他专业咨询"
                            }
                        ],
                        "label": "(72723)咨询与调查"
                    },
                    {
                        "children": [
                            {
                                "label": "(7247240)广告业"
                            }
                        ],
                        "label": "(72724)广告业"
                    },
                    {
                        "children": [
                            {
                                "label": "(7257250)知识产权服务"
                            }
                        ],
                        "label": "(72725)知识产权服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7267262)职业中介服务"
                            },
                            {
                                "label": "(7267263)劳务派遣服务"
                            },
                            {
                                "label": "(7267269)其他人力资源服务"
                            }
                        ],
                        "label": "(72726)人力资源服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7277271)旅行社服务"
                            },
                            {
                                "label": "(7277272)旅游管理服务"
                            },
                            {
                                "label": "(7277279)其他旅行社相关服务"
                            }
                        ],
                        "label": "(72727)旅行社及相关服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7287281)安全服务"
                            },
                            {
                                "label": "(7287282)安全系统监控服务"
                            },
                            {
                                "label": "(7287289)其他安全保护服务"
                            }
                        ],
                        "label": "(72728)安全保护服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7297291)市场管理"
                            },
                            {
                                "label": "(7297292)会议及展览服务"
                            },
                            {
                                "label": "(7297294)办公服务"
                            },
                            {
                                "label": "(7297295)信用服务"
                            },
                            {
                                "label": "(7297296)担保服务"
                            },
                            {
                                "label": "(7297299)其他未列明商务服务业"
                            }
                        ],
                        "label": "(72729)其他商务服务业"
                    },
                    {
                        "label": "(72720)天然气开采"
                    }
                ],
                "label": "(L72)商务服务业"
            }
        ],
        "label": "（L)租赁和商务服务业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7317310)自然科学研究和试验发展"
                            }
                        ],
                        "label": "(73731)自然科学研究和试验发展"
                    },
                    {
                        "children": [
                            {
                                "label": "(7327320)工程和技术研究和试验发展"
                            }
                        ],
                        "label": "(73732)工程和技术研究和试验发展"
                    },
                    {
                        "children": [
                            {
                                "label": "(7347340)医学研究和试验发展"
                            }
                        ],
                        "label": "(73734)医学研究和试验发展"
                    }
                ],
                "label": "(M73)研究和试验发展"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7417410)气象服务"
                            }
                        ],
                        "label": "(74741)气象服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7427420)地震服务"
                            }
                        ],
                        "label": "(74742)地震服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7437430)海洋服务"
                            }
                        ],
                        "label": "(74743)海洋服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7447440)测绘服务"
                            }
                        ],
                        "label": "(74744)测绘服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7457450)质检技术服务"
                            }
                        ],
                        "label": "(74745)质检技术服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7467461)环境保护监测"
                            },
                            {
                                "label": "(7467462)生态监测"
                            }
                        ],
                        "label": "(74746)环境与生态监测"
                    },
                    {
                        "children": [
                            {
                                "label": "(7477471)能源矿产地质勘查"
                            },
                            {
                                "label": "(7477472)固体矿产地质勘查"
                            },
                            {
                                "label": "(7477475)地质勘查技术服务"
                            }
                        ],
                        "label": "(74747)地质勘查"
                    },
                    {
                        "children": [
                            {
                                "label": "(7487481)工程管理服务"
                            },
                            {
                                "label": "(7487482)工程勘察设计"
                            },
                            {
                                "label": "(7487483)规划管理"
                            }
                        ],
                        "label": "(74748)工程技术"
                    },
                    {
                        "children": [
                            {
                                "label": "(7497491)专业化设计服务"
                            },
                            {
                                "label": "(7497492)摄影扩印服务"
                            },
                            {
                                "label": "(7497499)其他未列明专业技术服务业"
                            }
                        ],
                        "label": "(74749)其他专业技术服务业"
                    }
                ],
                "label": "(M74)专业技术服务业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7517511)农业技术推广服务"
                            },
                            {
                                "label": "(7517512)生物技术推广服务"
                            },
                            {
                                "label": "(7517513)新材料技术推广服务"
                            },
                            {
                                "label": "(7517514)节能技术推广服务"
                            },
                            {
                                "label": "(7517519)其他技术推广服务"
                            }
                        ],
                        "label": "(75751)技术推广服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7527520)科技中介服务"
                            }
                        ],
                        "label": "(75752)科技中介服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7597590)其他科技推广和应用服务业"
                            }
                        ],
                        "label": "(75759)其他科技推广和应用服务业"
                    }
                ],
                "label": "(M75)科技推广和应用服务业"
            }
        ],
        "label": "（M)科学研究和技术服务业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7617610)防洪除涝设施管理"
                            }
                        ],
                        "label": "(76761)防洪除涝设施管理"
                    },
                    {
                        "children": [
                            {
                                "label": "(7627620)水资源管理"
                            }
                        ],
                        "label": "(76762)水资源管理"
                    }
                ],
                "label": "(N76)水利管理业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7717719)其他自然保护"
                            }
                        ],
                        "label": "(77771)生态保护"
                    },
                    {
                        "children": [
                            {
                                "label": "(7727721)水污染治理"
                            },
                            {
                                "label": "(7727722)大气污染治理"
                            },
                            {
                                "label": "(7727723)固体废物治理"
                            },
                            {
                                "label": "(7727724)危险废物治理"
                            },
                            {
                                "label": "(7727729)其他污染治理"
                            }
                        ],
                        "label": "(77772)环境治理业"
                    }
                ],
                "label": "(N77)生态保护和环境治理业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7827820)环境卫生管理"
                            }
                        ],
                        "label": "(78782)环境卫生管理"
                    },
                    {
                        "children": [
                            {
                                "label": "(7837830)城乡市容管理"
                            }
                        ],
                        "label": "(78783)城乡市容管理"
                    },
                    {
                        "children": [
                            {
                                "label": "(7857852)游览景区管理"
                            }
                        ],
                        "label": "(78785)公园和游览景区管理"
                    }
                ],
                "label": "(N78)公共设施管理业"
            }
        ],
        "label": "（N)水利、环境和公共设施管理业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(7917910)家庭服务"
                            }
                        ],
                        "label": "(79791)家庭服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7947940)理发及美容服务"
                            }
                        ],
                        "label": "(79794)理发及美容服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7977970)婚姻服务"
                            }
                        ],
                        "label": "(79797)婚姻服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(7997990)其他居民服务业"
                            }
                        ],
                        "label": "(79799)其他居民服务业"
                    }
                ],
                "label": "(O79)居民服务业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8018011)汽车修理与维护"
                            }
                        ],
                        "label": "(80801)汽车、摩托车修理与维护"
                    },
                    {
                        "children": [
                            {
                                "label": "(8028022)通讯设备修理"
                            }
                        ],
                        "label": "(80802)计算机和办公设备维修"
                    }
                ],
                "label": "(O80)机动车、电子产品和日用产品修理业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8118119)其他清洁服务"
                            }
                        ],
                        "label": "(81811)清洁服务"
                    },
                    {
                        "children": [
                            {
                                "label": "(8198190)其他未列明服务业"
                            }
                        ],
                        "label": "(81819)其他未列明服务业"
                    },
                    {
                        "label": "(81810)铁矿采选"
                    }
                ],
                "label": "(O81)其他服务业"
            }
        ],
        "label": "（O)居民服务、修理和其他服务业"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8218210)学前教育"
                            }
                        ],
                        "label": "(82821)学前教育"
                    },
                    {
                        "children": [
                            {
                                "label": "(8298291)职业技能培训"
                            },
                            {
                                "label": "(8298292)体校及体育培训"
                            },
                            {
                                "label": "(8298293)文化艺术培训"
                            },
                            {
                                "label": "(8298294)教育辅助服务"
                            },
                            {
                                "label": "(8298299)其他未列明教育"
                            }
                        ],
                        "label": "(82829)技能培训、教育辅助及其他教育"
                    },
                    {
                        "label": "(82820)锰矿、铬矿采选"
                    }
                ],
                "label": "(P82)教育"
            }
        ],
        "label": "（P)教育"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8318311)综合医院"
                            },
                            {
                                "label": "(8318315)专科医院"
                            }
                        ],
                        "label": "(83831)医院"
                    },
                    {
                        "children": [
                            {
                                "label": "(8328321)社区卫生服务中心（站）"
                            }
                        ],
                        "label": "(83832)社区医疗与卫生院"
                    },
                    {
                        "children": [
                            {
                                "label": "(8338330)门诊部（所）"
                            }
                        ],
                        "label": "(83833)门诊部（所）"
                    },
                    {
                        "children": [
                            {
                                "label": "(8358350)妇幼保健院（所、站）"
                            }
                        ],
                        "label": "(83835)妇幼保健院（所、站）"
                    },
                    {
                        "children": [
                            {
                                "label": "(8378370)疾病预防控制中心"
                            }
                        ],
                        "label": "(83837)疾病预防控制中心"
                    },
                    {
                        "children": [
                            {
                                "label": "(8398390)其他卫生活动"
                            }
                        ],
                        "label": "(83839)其他卫生活动"
                    }
                ],
                "label": "(Q83)卫生"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8418412)护理机构服务"
                            },
                            {
                                "label": "(8418414)老年人、残疾人养护服务"
                            }
                        ],
                        "label": "(84841)提供住宿社会工作"
                    }
                ],
                "label": "(Q84)社会工作"
            }
        ],
        "label": "（Q)卫生和社会工作"
    },
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8528521)图书出版"
                            },
                            {
                                "label": "(8528523)期刊出版"
                            },
                            {
                                "label": "(8528529)其他出版业"
                            }
                        ],
                        "label": "(85852)出版业"
                    }
                ],
                "label": "(R85)新闻和出版业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8628620)电视"
                            }
                        ],
                        "label": "(86862)电视"
                    },
                    {
                        "children": [
                            {
                                "label": "(8638630)电影和影视节目制作"
                            }
                        ],
                        "label": "(86863)电影和影视节目制作"
                    },
                    {
                        "children": [
                            {
                                "label": "(8648640)电影和影视节目发行"
                            }
                        ],
                        "label": "(86864)电影和影视节目发行"
                    },
                    {
                        "children": [
                            {
                                "label": "(8658650)电影放映"
                            }
                        ],
                        "label": "(86865)电影放映"
                    },
                    {
                        "children": [
                            {
                                "label": "(8668660)录音制作"
                            }
                        ],
                        "label": "(86866)录音制作"
                    }
                ],
                "label": "(R86)广播、电视、电影和影视录音制作业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8718710)文艺创作与表演"
                            }
                        ],
                        "label": "(87871)文艺创作与表演"
                    },
                    {
                        "children": [
                            {
                                "label": "(8728720)艺术表演场馆"
                            }
                        ],
                        "label": "(87872)艺术表演场馆"
                    },
                    {
                        "children": [
                            {
                                "label": "(8748740)文物及非物质文化遗产保护"
                            }
                        ],
                        "label": "(87874)文物及非物质文化遗产保护"
                    },
                    {
                        "children": [
                            {
                                "label": "(8778770)群众文化活动"
                            }
                        ],
                        "label": "(87877)群众文化活动"
                    },
                    {
                        "children": [
                            {
                                "label": "(8798790)其他文化艺术业"
                            }
                        ],
                        "label": "(87879)其他文化艺术业"
                    }
                ],
                "label": "(R87)文化艺术业"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8818810)体育组织"
                            }
                        ],
                        "label": "(88881)体育组织"
                    },
                    {
                        "children": [
                            {
                                "label": "(8828820)体育场馆"
                            }
                        ],
                        "label": "(88882)体育场馆"
                    },
                    {
                        "children": [
                            {
                                "label": "(8838830)休闲健身活动"
                            }
                        ],
                        "label": "(88883)休闲健身活动"
                    },
                    {
                        "children": [
                            {
                                "label": "(8898890)其他体育"
                            }
                        ],
                        "label": "(88889)其他体育"
                    }
                ],
                "label": "(R88)体育"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "label": "(8918911)歌舞厅娱乐活动"
                            }
                        ],
                        "label": "(89891)室内娱乐活动"
                    },
                    {
                        "children": [
                            {
                                "label": "(8928920)游乐园"
                            }
                        ],
                        "label": "(89892)游乐园"
                    },
                    {
                        "children": [
                            {
                                "label": "(8938930)彩票活动"
                            }
                        ],
                        "label": "(89893)彩票活动"
                    },
                    {
                        "children": [
                            {
                                "label": "(8948941)文化娱乐经纪人"
                            }
                        ],
                        "label": "(89894)文化、娱乐、体育经纪代理"
                    },
                    {
                        "children": [
                            {
                                "label": "(8998990)其他娱乐业"
                            }
                        ],
                        "label": "(89899)其他娱乐业"
                    }
                ],
                "label": "(R89)娱乐业"
            }
        ],
        "label": "（R)文化、体育和娱乐业"
    }
]


export {
    data1,
    data2,
    data3,
    data4,
    data5,
    tableData1,
    tableData2,
    tableData3,
    tableData4,
    tableData5,
    tableData6,
    tableData7,
    tableData8,
}