

let chartData1 = {
    columns: ['时间', '数量'],
    rows: [
        { '时间': '资产重组', '数量': 390 },
        { '时间': '股权投资','数量': 180 },
        { '时间': '应收账款造假','数量': 180 },
        { '时间': '存货造假','数量': 180 },
        { '时间': '在建工程','数量': 180 },
        { '时间': '不良资产','数量': 180 },
    ]
}
let chartData2 = {
    columns: ['时间', '数量'],
    rows: [
        { '时间': '现金流量', '数量': 400 },
        { '时间': '货币资金', '数量': 170 },
        { '时间': '毛利率', '数量': 180 },
        { '时间': '营业收入', '数量': 180 },
        { '时间': '关联交易', '数量': 180 },
        { '时间': '短期投资', '数量': 180 },
    ]
}
let chartData3 = {
    columns: ['时间', '数量'],
    rows: [
        { '时间': '在建工程', '数量': 500 },
        { '时间': '存货', '数量': 300 },
        { '时间': '预收账款', '数量': 180 },
        { '时间': '预付账款', '数量': 180 },
        { '时间': '固定资产', '数量': 180 },
        { '时间': '长期投资', '数量': 180 },
    ]
}
let chartData4 = {
    columns: ['时间', '数量'],
    rows: [
        { '时间': '无形资产', '数量': 500 },
        { '时间': '营业成本', '数量': 300 },
        { '时间': '营业收入', '数量': 180 },
        { '时间': '待摊费用', '数量': 180 },
        { '时间': '经营现金流', '数量': 180 },
        { '时间': '固定资产', '数量': 180 },
    ]
}
let chartData5 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '资产重组调节利润', '本期': 180, '同期': 390, '下单率': 0.78 },
        { '日期': '股权投资调节利润', '本期': 360, '同期': 500, '下单率': 0.78 },
        { '日期': '应收账款造假', '本期': 190, '同期': 420, '下单率': 0.78 },
        { '日期': '存货造假', '本期': 250, '同期': 440, '下单率': 0.78 },
        { '日期': '营业收入造假', '本期': 780, '同期': 190, '下单率': 0.78 },
        { '日期': '关联交易', '本期': 451, '同期': 250, '下单率': 0.323 },
        { '日期': '费用资本化', '本期': 390, '同期': 780, '下单率': 0.49 },
        { '日期': '经营活动现金流', '本期': 500, '同期': 451, '下单率': 0.76 },
        { '日期': '高估资产', '本期': 420, '同期':  180, '下单率': 0.26 },
        { '日期': '低估负债', '本期': 440, '同期': 360, '下单率': 0.32 },
    ]
}

let chartData6 = {
    columns: ['日期', '本年', '上年'],
    rows: [
        { '日期': '商业服务', '本年': 10, '上年': 32, '下单率': 0.78 },
        { '日期': 'it硬件', '本年': 250, '上年': 440, '下单率': 0.78 },
        { '日期': '零售与消费品', '本年': 780, '上年': 190, '下单率': 0.78 },
        { '日期': '工业产品', '本年': 451, '上年': 250, '下单率': 0.323 },
        { '日期': '媒体', '本年': 390, '上年': 780, '下单率': 0.49 },
        { '日期': '软件开发', '本年': 500, '上年': 451, '下单率': 0.76 },
        { '日期': '通讯', '本年': 620, '上年': 280, '下单率': 0.26 },
        { '日期': '房地产', '本年': 40, '上年': 30, '下单率': 0.32 },
    ]
}
let tableData = [
    { "no": 1, "field1": "商业服务(咨询、广告、IT外包等)", "field2": 1, "field3": "13.14%", "field4": "销售收入、销售成本" },
    { "no": 2, "field1": "|T硬件", "field2": 2, "field3": "41.13%", "field4": "营运资金变动、研发成本" },
    { "no": 3, "field1": "零售与消费品", "field2": 3, "field3": "52.36%", "field4": "营运资金变动、销售成本" },
    { "no": 4, "field1": "工业产品(原材料、重型机械等)", "field2": 4, "field3": "11.84%", "field4": "固定资产、折旧摊销费用、" },
    { "no": 5, "field1": "房地产", "field2": 5, "field3": "16.95%", "field4": "开发成本、出租开发产品折旧摊销" },
    { "no": 6, "field1": "媒体(有线电视、出版业等)", "field2": 6, "field3": "18.93%", "field4": "销售收入、自由现金流" },
    { "no": 7, "field1": "软件开发", "field2": 7, "field3": "46.49%", "field4": "销售收入、销售成本、衍" },
    { "no": 8, "field1": "农林牧副渔", "field2": 8, "field3": "31.10%", "field4": "营运资金变动、销售成本" },
    { "no": 9, "field1": "建筑业", "field2": 9, "field3": "24.06%", "field4": "销售收入、销售成本" },
    { "no": 10, "field1": "零售与消费品", "field2": 10, "field3": "25.04%", "field4": "营运资金变动、销售成本" }
]

let tableData1 = [
    {"no": 1 ,"field1":" 物业管理 ","field2": 	1 ,"field3":" 50  ","field4":" 8.36%  "}, 
    {"no": 2 ,"field1":" |T硬件 	","field2": 2 ,"field3":" 51  ","field4":" 8.49%  "},
    {"no": 3 ,"field1":" 零售与消费品    	","field2": 3 ,"field3":" 130 ","field4":"  20.03%    "},
    {"no": 4 ,"field1":" 综合 	","field2": 4 ,"field3":" 141 ","field4":"  21.01%    "},
    {"no": 5 ,"field1":" 房地产中介服务    	","field2": 5 ,"field3":" 153 ","field4":"  23.49%    "},  
    {"no": 6 ,"field1":" 媒体  (有线电视、出版业等) ","field2":	  	6 ,"field3":" 10  ","field4":" 2.93%  "},
    {"no": 7 ,"field1":" 软件开发 ","field2": 7 ,"field3":" 15  ","field4":" 2.40%  "},
    {"no": 8 ,"field1":" 金融信息服务    	","field2": 8 ,"field3":" 63  ","field4":" 10.28% "},
    {"no": 9 ,"field1":" 商业贸易 ","field2": 9 ,"field3":" 30  ","field4":" 5.59%  "},
    {"no": 10,"field1":"  财产保险 ","field2": 10,"field3":"  18 ","field4":"  3.60% "},
]
export {
    chartData1,
    chartData2,
    chartData3,
    chartData4,
    chartData5,
    chartData6,
    tableData,
    tableData1,
}
