let tableData = [{
    "id": 1,
    "level": 1,
    "field1": "1000",
    "field2": "中国船舶重工集团有限公司",
    "children": [{
            "id": 1001,
            "level": 2,
            "field1": "1001",
            "field2": "中国船舶重工集团有限公司",
            "children": [{
                "id": 1001001,
                "level": 3,
                "field1": "100100001",
                "field2": "大连船舶投资控股有限公司",
                "field3": "国标行业",
                "field4": "中型企业",
                "children": [{
                        "id": 100100101,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000101",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务风险报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "张伟",
                        "field11": "96分",
                        "field12": "",
                    },
                    {
                        "id":100100102,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000102",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务识假报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "张大鹏",
                        "field11": "92分",
                        "field12": "",
                    },
                    {
                        "id": 100100103,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000103",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务分析报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "王扬",
                        "field11": "94分",
                        "field12": "",
                    },
                    {
                        "id": 100100104,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000104",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务诊断报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "刘娜",
                        "field11": "93分",
                        "field12": "",
                    },
                ,
                ],
                "children": [{
                        "id": 100100101,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000101",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务风险报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "张伟",
                        "field11": "96分",
                        "field12": "",
                    },
                    {
                        "id":100100102,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000102",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务识假报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "张大鹏",
                        "field11": "92分",
                        "field12": "",
                    },
                    {
                        "id": 100100103,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000103",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务分析报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "王扬",
                        "field11": "94分",
                        "field12": "",
                    },
                    {
                        "id": 100100104,
                        "level": 4,
                        "auditStatus": 1,
                        "field1": "10010000104",
                        "field2": "大连船舶投资控股有限公司",
                        "field3": "国标行业",
                        "field4": "中型企业",
                        "field5": "审批岗客户经理",
                        "field6": "新增授信客户",
                        "field7": "财务诊断报告",
                        "field8": "1",
                        "field9": "2019年1月",
                        "field10": "刘娜",
                        "field11": "93分",
                        "field12": "",
                    },
                ,
                ],
            }]
        },
    
        {
            "id": 1004,
            "level": 3,
            "field1": "1002",
            "field2": "中国船舶集团重工有限公司",
            "children": [{
                "id": 1004001,
                "level": 3,
                "field1": "100400001",
                "field2": "大连船舶重工集团有限公司",
                "field3": "国标行业",
                "field4": "大型企业",
            "children": [
                {
                    "id": 100400401,
                    "level": 4,
                    "auditStatus": 1,
                    "field1": "10040000101",
                    "field2": "大连船舶重工集团有限公司",
                    "field3": "国标行业",
                    "field4": "大型企业",
                    "field5": "审批岗客户经理",
                    "field6": "新增授信客户",
                    "field7": "风险合规审查报告",
                    "field8": "1",
                    "field9": "2019年1月",
                    "field10": "张文希",
                    "field11": "91分",
                    "field12": "",
           
            },
            {
                "id": 100400402,
                "level": 4,
                "auditStatus": 1,
                "field1": "10040000102",
                "field2": "大连船舶重工集团有限公司",
                "field3": "国标行业",
                "field4": "大型企业",
                "field5": "审批岗客户经理",
                "field6": "新增授信客户",
                "field7": "信贷业务尽职调查报告",
                "field8": "1",
                "field9": "2019年1月",
                "field10": "张文希",
                "field11": "91分",
                "field12": "",
       
        },
           ]}]
        },
    ]

}]


let gridData = [{
        "field1": "净利润为正，扣除非经常性损益后的净利润为负",
        "field2": "公司可能存在通过投资收益、资产减值损失、营业外收入、营业外支出等非经常性项目来进行利润调节。",
        "field3": "净利润 资产减值损失 投资收益 营业外收入 营业外支出 其他收益 汇兑收益 公允价值变动收益",
    },
    {
        "field1": "投资收益激增",
        "field2": "公司当期可能存在通过投资收益来进行利润调节的情况，比如进行子公司处置、购买大量交易性金融资产、或者从子公司获得大量分红的情况。",
        "field3": "投资收益 长期股权投资",
    },
    {
        "field1": "营业收入下降，且营业收入下降率远低于销售费用下降率",
        "field2": "公司销售费用的核算可能存在虚减的不合理和不真实的情况。",
        "field3": "销售费用",
    },
    {
        "field1": "在建工程激增",
        "field2": "公司可能存在虚增在建工程来虚构资产的现象；或将应该费用化成本不合理的计入在建工程。",
        "field3": "在建工程 固定资产",
    },
    {
        "field1": "营业收入增长，但销售费用下降",
        "field2": "公司销售费用的核算可能存在虚减的不合理和不真实的情况；或者公司的营业收入可能存在虚增的情况。",
        "field3": "营业收入 销售费用",
    }
]

let gridData2 = [{
        "field1": "营业成本",
        "field2": "43,004.09",
        "field3": "59,097.34",
        "field4": "37.42",
        "field5": "——    "
    },
    {
        "field1": "占收入比(%)",
        "field2": "12.03",
        "field3": "19.14",
        "field4": "——",
        "field5": "7.11  "
    },
    {
        "field1": "存货",
        "field2": "57,702.71",
        "field3": "102,230.74",
        "field4": "77.17",
        "field5": "——    "
    },
    {
        "field1": "占收入比(%)",
        "field2": "16.14",
        "field3": "33.11",
        "field4": "——",
        "field5": "16.96 "
    },
    {
        "field1": "应收账款",
        "field2": "414,744.01",
        "field3": "503,515.35",
        "field4": "21.4",
        "field5": "——    "
    },
    {
        "field1": "占收入比(%)",
        "field2": "116.04",
        "field3": "163.06",
        "field4": "——",
        "field5": "47.02 "
    },
    {
        "field1": "经营活动现金流出",
        "field2": "528,819.16",
        "field3": "712,019.16",
        "field4": "34.64",
        "field5": "——    "
    },
    {
        "field1": "占收入比(%)",
        "field2": "147.95",
        "field3": "230.58",
        "field4": "——",
        "field5": "82.62 "
    },
    {
        "field1": "非流动负债",
        "field2": "158,279.33",
        "field3": "424,368.9",
        "field4": "168.11",
        "field5": "——    "
    },
    {
        "field1": "占资产比(%)",
        "field2": "9.03",
        "field3": "19.25",
        "field4": "——",
        "field5": "10.23 "
    },
]

let gridData3 = [{
        "field1": "经营活动现金净流量",
        "field2": "-201,376.3",
        "field3": "-371,880.37",
        "field4": "-84.67",
        "field5": "——    "
    },
    {
        "field1": "现金及现金等价物净增加额)",
        "field2": "25,490.76",
        "field3": "-83,132.57",
        "field4": "-426.13",
        "field5": "7.11  "
    },
]
let gridData4 = [{
        "field": "1",
        "field1": "净资产收益率",
        "field2": "净资产收益率近三年小幅持续下行；2018较上年减少0.67个百分点；近三年平均每年减少0.44个百分点。",
        "field3": "净资产收益率下降，表明公司盈利能力和运用资本的能力降低，可能收入下降或者成本费用上升。",
        "field4": "低风险",
    },
    {
        "field": "2",
        "field1": "总资产收益率",
        "field2": "总资产收益率近三年小幅持续下行；2018较上年减少0.19个百分点；近三年平均每年减少0.15个百分点。",
        "field3": "总资产收益率下降，表明公司的投入产出比下降，盈利能力变差，可能（1）收入下降或者成本费用上升；（2）新增资产的盈利能力很差。",
        "field4": "低风险",

    },
    {
        "field": "3",
        "field1": "经营现金流量与销售收入比",
        "field2": "经营现金流量与销售收入比近三年小幅持续下行，2018年较上年减少0.0035 ，降幅1%；近三年平均每年减少0.04 。",
        "field3": "经营现金净流量占销售收入的比率降低，说明公司营业收入中收现部分减少，影响盈利的质量和现金能力。",
        "field4": "低风险",

    },
]
let gridData5 = [{
        "field1": "固定资产周转率",
        "field2": "2.34",
        "field3": "0.8155",
        "field4": "固定资产周转率远高于行业平均水平，则固定资产周转天数远低于行业平均水平，可能存在公司营业收入虚增。",
        "field5": "固定资产周转率远高于行业平均水平，则固定资产周转天数远低于行业平均水平，可能存在公司营业收入虚增。	高风险",
    },
    {
        "field1": "资产负债率",
        "field2": "0.6553",
        "field3": "0.4810",
        "field4": "负债占资产比率高于行业平均水平，存在一定财务风险。",
        "field5": "中风险",
    },
    {
        "field1": "营业利润率",
        "field2": "0.1071",
        "field3": "0.2398",
        "field4": "营业利润率低于行业平均水平，表明公司经营业务的盈利能力相对较差，需要关注经营风险。",
        "field5": "中风险",
    },
    {
        "field1": "净资产收益率",
        "field2": "0.0343",
        "field3": "0.0639",
        "field4": "净资产收益率低于行业平均水平，表明公司盈利能力和运用资本的能力相对较差，可能收入下降或者成本费用上升，需要关注经营风险。",
        "field5": "中风险",
    },
    {
        "field1": "总资产收益率",
        "field2": "0.0118",
        "field3": "0.0329",
        "field4": "总资产收益率低于行业平均水平，表明公司的投入产出比下降，盈利能力相对较差，可能营业收入下降或者成本费用上升，或者新增资产的盈利能力相对较差，需要关注经营风险。",
        "field5": "中风险",
    }
]
let gridData6 = [{
        "field1": "在建工程激增",
        "field2": "公司可能存在虚增在建工程来虚构资产的现象；或将应该费用化成本不合理的计入在建工程。",
        "field3": "在建工程 固定资产",
    },
    {
        "field1": "营业收入增长，但销售费用下降",
        "field2": "公司销售费用的核算可能存在虚减的不合理和不真实的情况；或者公司的营业收入可能存在虚增的情况。",
        "field3": "营业收入 销售费用",
    },

]
let gridData7 = [{
        "field1": "销售收入",
        "field2": "3,833,468.97",
        "field3": "0",
        "field4": "5,382,058.75",
        "field5": "40.4",
        "field6": "5,963,542.03",
        "field7": "10.8"
    },
    {
        "field1": "应收账款",
        "field2": "717,747.73",
        "field3": "0",
        "field4": "950,077.53",
        "field5": "32.37",
        "field6": "1,891,031.77",
        "field7": "99.04"
    },
    {
        "field1": "实现利润",
        "field2": "694,856.10",
        "field3": "0",
        "field4": "897,551.78",
        "field5": "29.17",
        "field6": "1,279,908.03",
        "field7": "42.6"
    },
    {
        "field1": "营业利润",
        "field2": "694,856.10",
        "field3": "0",
        "field4": "881,827.50",
        "field5": "27.74",
        "field6": "1,287,779.82",
        "field7": "46.04"
    },
    {
        "field1": "净利润",
        "field2": "498,709.13",
        "field3": "0",
        "field4": "616,811.83",
        "field5": "23.68",
        "field6": "880,657.10",
        "field7": "42.78"
    },
    {
        "field1": "资产净利率",
        "field2": "0.03",
        "field3": "0",
        "field4": "0.03",
        "field5": "-0.34",
        "field6": "-426.13",
        "0.03": "-4.51"
    },
]
let gridData8 = [{
        "field1": "应收账款",
        "field2": "213,403",
        "field3": "30.88",
        "field4": "414,744.01",
        "field5": "94.35",
        "field6": "503,515.35",
        "field7": "21.4"
    },
    {
        "field1": "营业利润",
        "field2": "213,403",
        "field3": "10.20",
        "field4": "173,072.19",
        "field5": "-18.06",
        "field6": "145,407.49",
        "field7": "-15.98"
    },
    {
        "field1": "应收账款/主营业务收入",
        "field2": "0.68",
        "field3": "37.4",
        "field4": "1.16",
        "field5": "71.66",
        "field6": "1.63",
        "field7": "40.52"
    },
    {
        "field1": "主营业务成本/主营业务收入",
        "field2": "0.08",
        "field3": "-85.83",
        "field4": "0.12",
        "field5": "47.61",
        "field6": "0.19",
        "field7": "59.1"
    },
]
let gridData9 = [{
        "field1": "存货",
        "field2": "45,909.33",
        "field3": "435.5",
        "field4": "57,702.71",
        "field5": "25.69",
        "field6": "102,230.74",
        "field7": "77.17"
    },
    {
        "field1": "存货/主营业务收入",
        "field2": "0.15",
        "field3": "-60.51",
        "field4": "0.16",
        "field5": "11",
        "field6": "0.33",
        "field7": "105.14"
    },
    {
        "field1": "主营业务成本/主营业务收入",
        "field2": "0.08",
        "field3": "-85.83",
        "field4": "0.12",
        "field5": "47.61",
        "field6": "0.19",
        "field7": "59.1"
    },
    {
        "field1": "营业利润",
        "field2": "211,211.46",
        "field3": "53,870.73",
        "field4": "173,072.19",
        "field5": "-18.06",
        "field6": "145,407.49",
        "field7": "-15.98"
    },
]
let gridData10 = [{
        "field1": "应收帐款/营业收入",
        "field2": "0.5",
        "field3": "0.49",
        "field4": "0.68",
        "field5": "1.16",
        "field6": "1.63"
    },
    {
        "field1": "应付帐款/营业收入",
        "field2": "0.07",
        "field3": "0.07",
        "field4": "0.09",
        "field5": "0.07",
        "field6": "0.09"
    },
    {
        "field1": "营业利润/营业收入",
        "field2": "-0.2",
        "field3": "0.02",
        "field4": "0.67",
        "field5": "0.48",
        "field6": "0.47"
    },
    {
        "field1": "应收帐款增加额/营业收入",
        "field2": "0.5",
        "field3": "-0.04",
        "field4": "0.64",
        "field5": "0.56",
        "field6": "0.29"
    },
]
let gridData11 = [{
        "field1": "预付账款",
        "field2": "633.67",
        "field3": "393.25",
        "field4": "32,697.49",
        "field5": "31,545.53",
        "field6": "34,074.19"
    },
    {
        "field1": "营业成本",
        "field2": "14,666.14",
        "field3": "13,391.22",
        "field4": "25,713.77",
        "field5": "43,004.09",
        "field6": "59,097.34"
    },
    {
        "field1": "营业收入",
        "field2": "24,781.87",
        "field3": "23,282.94",
        "field4": "315,680.79",
        "field5": "357,421.65",
        "field6": "308,796.88"
    },
    {
        "field1": "毛利",
        "field2": "10,115.73",
        "field3": "9,891.72",
        "field4": "315,680.79",
        "field5": "314,417.56",
        "field6": "308,796.88"
    },

]
let gridData12 = [{
        "field1": "应收账款",
        "field2": "12,345.99",
        "field3": "11,455.55",
        "field4": "213,403",
        "field5": "414,744.01",
        "field6": "503,515.35"
    },
    {
        "field1": "营业收入",
        "field2": "24,781.87",
        "field3": "23,282.94",
        "field4": "315,680.79",
        "field5": "357,421.65",
        "field6": "308,796.88"
    },
    {
        "field1": "营业利润",
        "field2": "-5,037.98",
        "field3": "391.34",
        "field4": "211,211.46",
        "field5": "173,072.19",
        "field6": "145,407.49"
    }
]
let gridData21 = [{
        "field1": "营运资本",
        "field2": "-3,324.93",
        "field3": "—— ",
        "field4": "2,159.04",
        "field5": "-164.94%",
        "field6": "471.08",
        "field7": "-78.18%"
    },
    {
        "field1": "非流动负债",
        "field2": "12,000.00",
        "field3": "—— ",
        "field4": "8,000.00",
        "field5": "-33.33%",
        "field6": "4,000.00",
        "field7": "-50.00%"
    },
    {
        "field1": "所有者权益",
        "field2": "51,357.37",
        "field3": "—— ",
        "field4": "57,299.10",
        "field5": "11.57%",
        "field6": "54,262.27",
        "field7": " -5.30%"
    },
    {
        "field1": "非流动资产",
        "field2": "66,682.30",
        "field3": "—— ",
        "field4": "63,140.06",
        "field5": "-5.31%",
        "field6": "-8.47%",
        "field7": "-8.47%"
    }
]
let gridData22 = [{
        "field1": "应收账款",
        "field2": "723.47",
        "field3": "—— ",
        "field4": "2,633.00",
        "field5": "263.94%",
        "field6": "5,270.82",
        "field7": "100.18%"
    },
    {
        "field1": "预付款项",
        "field2": "0.00",
        "field3": "—— ",
        "field4": "0.00",
        "field5": "—— ",
        "field6": "1,065.08",
        "field7": "—— "
    },
    {
        "field1": "其他应收款",
        "field2": "16.75",
        "field3": "—— ",
        "field4": "32.80",
        "field5": "95.85%",
        "field6": "870.58",
        "field7": "100.18%"
    },
    {
        "field1": "存货",
        "field2": "17,597.02",
        "field3": "—— ",
        "field4": "23,381.43",
        "field5": "32.87%",
        "field6": "19,224.45",
        "field7": "—— "
    },
    {
        "field1": "一年内到期的非流动资产",
        "field2": "0.00",
        "field3": "—— ",
        "field4": "0.00",
        "field5": "—— ",
        "field6": "0.00",
        "field7": "-17.78%"
    },
    {
        "field1": "合计",
        "field2": "18,337.24",
        "field3": "—— ",
        "field4": "26,047.23",
        "field5": "42.05%",
        "field6": "26,430.93",
        "field7": "1.47%"
    },
]
let gridData23 = [{
        "field1": "应付账款",
        "field2": "178.87",
        "field3": "—— ",
        "field4": "736.56",
        "field5": "311.78%",
        "field6": "1,214.72",
        "field7": "64.92%"
    },
    {
        "field1": "预收账款",
        "field2": "0.00",
        "field3": "—— ",
        "field4": "347.03",
        "field5": "—— ",
        "field6": "299.91",
        "field7": "-13.58%"
    },
    {
        "field1": "应付职工薪酬",
        "field2": "87.63",
        "field3": "—— ",
        "field4": "31.93",
        "field5": "-63.57%",
        "field6": "156.03",
        "field7": "388.74%"
    },
    {
        "field1": "应交税费",
        "field2": "122.30",
        "field3": "—— ",
        "field4": "552.77",
        "field5": "351.98%",
        "field6": "463.57",
        "field7": "-16.14%"
    },
    {
        "field1": "应付利息",
        "field2": "0.00",
        "field3": "—— ",
        "field4": "0.00",
        "field5": "—— ",
        "field6": "0.00",
        "field7": "—— "
    },
    {
        "field1": "其他应付款",
        "field2": "39.95",
        "field3": "—— ",
        "field4": "969.26",
        "field5": "2326.45%",
        "field6": "164.36",
        "field7": "-83.04%"
    },
    {
        "field1": "一年内到期的非流动负债",
        "field2": "0.00",
        "field3": "—— ",
        "field4": "0.00",
        "field5": "",
        "field6": "0.00",
        "field7": "—— "
    },
    {
        "field1": "合计",
        "field2": "428.74",
        "field3": "—— ",
        "field4": "2,637.54",
        "field5": "515.18%",
        "field6": "2,298.59",
        "field7": "-12.85%"
    },
]
let gridData24 = [{
        "field1": "短期借款",
        "field2": "17,210.00",
        "field3": "18.39%",
        "field4": "21,240.00",
        "field5": "23.78%",
        "field6": "24,240.00",
        "field7": "28.57%"
    },
    {
        "field1": "交易性有息负债",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "应付利息",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "一年内到期的非流动负债",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "长期借款",
        "field2": "12,000.00",
        "field3": "12.82%",
        "field4": "8,000.00",
        "field5": "8.96%",
        "field6": "4,000.00",
        "field7": "4.71%"
    },
    {
        "field1": "应付债券",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "有息负债",
        "field2": "29,210.00",
        "field3": "31.21%",
        "field4": "29,240.00",
        "field5": "32.74%",
        "field6": "28,240.00",
        "field7": "33.29%"
    },
    {
        "field1": "负债总额",
        "field2": "42,221.68",
        "field3": "45.12%",
        "field4": "32,011.86",
        "field5": "35.84%",
        "field6": "30,577.37",
        "field7": "36.04%"
    },
    {
        "field1": "负债及权益总额",
        "field2": "93,579.06	100%",
        "field3": "100%",
        "field4": "89,310.96",
        "field5": "100%",
        "field6": "84,839.64",
        "field7": "100%"
    },
]
let gridData25 = [{
        "field1": "金融投资",
        "field2": "29,530.00",
        "field3": "31.56%",
        "field4": "29,530.00",
        "field5": "33.06%",
        "field6": "29,765.73",
        "field7": "35.08%"
    },
    {
        "field1": "长期经营性资产投资",
        "field2": "37,152.30",
        "field3": "39.70%",
        "field4": "33,610.06",
        "field5": "37.63%",
        "field6": "33.03%",
        "field7": "33.03%"
    },
    {
        "field1": "投资总额",
        "field2": "66,682.30",
        "field3": "71.26%",
        "field4": "63,140.06",
        "field5": "70.70%",
        "field6": "57,791.19",
        "field7": "68.12%"
    },
    {
        "field1": "资产合计",
        "field2": "93,579.06",
        "field3": "89,310.96",
        "field4": "100.00%",
        "field5": "100.00%",
        "field6": "84,839.64",
        "field7": "100.00"
    },
]
let gridData26 = [{
        "field1": "金融产品投资",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "长期股权投资",
        "field2": "29,530.00",
        "field3": "100.00%",
        "field4": "29,530.00",
        "field5": "100.00%",
        "field6": "29,765.73",
        "field7": "100.00%"
    },
    {
        "field1": "投资性房地产",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "金融投资",
        "field2": "29,530.00",
        "field3": "100.00%",
        "field4": "29,530.00",
        "field5": "100.00%",
        "field6": "29,765.73",
        "field7": "100.00%"
    },
]
let gridData27 = [{
        "field1": "净利润",
        "field2": "4,779.29",
        "field3": "——",
        "field4": "6,001.46",
        "field5": "25.57%",
        "field6": "4,756.71",
        "field7": "-20.74%"
    },
    {
        "field1": "EBIT",
        "field2": "7,245.17",
        "field3": "——",
        "field4": "8,801.14",
        "field5": "21.48%",
        "field6": "7,366.30",
        "field7": "-16.30%"
    },
    {
        "field1": "投资收益",
        "field2": "492.08",
        "field3": "——",
        "field4": "173.57",
        "field5": "64.73%",
        "field6": "409.30",
        "field7": "135.81%"
    },
    {
        "field1": "经营性资产总额",
        "field2": "64,049.06",
        "field3": "——",
        "field4": "59,780.96",
        "field5": "64.73%",
        "field6": "55,073.91",
        "field7": "-7.87%"
    },
    {
        "field1": "经营性资产报酬率",
        "field2": "——",
        "field3": "——",
        "field4": "13.93%",
        "field5": "——",
        "field6": "12.11",
        "field7": "-1.82%"
    },
]
let gridData28 = [{
        "field1": "应收票据",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "9.00",
        "field5": "0.34%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "应收账款",
        "field2": "723.47",
        "field3": "97.74%",
        "field4": "9.00",
        "field5": "98.44%",
        "field6": "5,270.82",
        "field7": "73.14%"
    },
    {
        "field1": "预付款项",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "1,065.08",
        "field7": "14.78%"
    },
    {
        "field1": "应收利息",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "应收股利",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%"
    },
    {
        "field1": "其他应收款",
        "field2": "16.75",
        "field3": "2.26%",
        "field4": "32.80",
        "field5": "1.23%",
        "field6": "870.58",
        "field7": "12.08%"
    },
    {
        "field1": "其他应收款",
        "field2": "740.22",
        "field3": "100%",
        "field4": "2,674.80",
        "field5": "100.00%",
        "field6": "7,206.48",
        "field7": "100%"
    },
]
let gridData29 = [{
        "field1": "应收利息",
        "field2": "204.42",
        "field3": "0",
        "field4": "216.93",
        "field5": "94.35",
        "field6": "0",
        "field7": "-100"
    },
    {
        "field1": "应收账款",
        "field2": "213,403",
        "field3": "62.88",
        "field4": "414,744.01",
        "field5": "94.35",
        "field6": "503,515.35",
        "field7": "21.4"
    },
    {
        "field1": "其他应收款",
        "field2": "9,537.26",
        "field3": "55.49",
        "field4": "9,783.32",
        "field5": "2.58",
        "field6": "55,948.41",
        "field7": "471.88"
    },
    {
        "field1": "预付款项",
        "field2": "32,697.49",
        "field3": "14.71",
        "field4": "31,545.53",
        "field5": "-3.52",
        "field6": "34,074.19",
        "field7": "8.02"
    },
    {
        "field1": "存货",
        "field2": "45,909.33",
        "field3": "5.5",
        "field4": "57,702.71",
        "field5": "25.69",
        "field6": "102,230.74",
        "field7": "77.17"
    },
    {
        "field1": "其他流动资产",
        "field2": "266,565.77",
        "field3": "9.98",
        "field4": "57,702.71",
        "field5": "-27.78",
        "field6": "74,316.60",
        "field7": "-61.39"
    },
]
let gridData30 = [{
        "field1": "应付账款",
        "field2": "27,295.48",
        "field3": "11.95",
        "field4": "24,036.77",
        "field5": "-11.94",
        "field6": "-11.94",
        "field7": "18.22"
    },
    {
        "field1": "预收款项",
        "field2": "6,519.48",
        "field3": "17.51",
        "field4": "7,897.67",
        "field5": "21.14",
        "field6": "14,647.03",
        "field7": "432.83"
    },
    {
        "field1": "应付职工薪酬",
        "field2": "1,407.74",
        "field3": "35.49",
        "field4": "1,751.21",
        "field5": "24.4",
        "field6": "14,647.03",
        "field7": "-9.64"
    },
    {
        "field1": "应付股利",
        "field2": "27,069.71",
        "field3": "0",
        "field4": "18,413.51",
        "field5": "-31.98",
        "field6": "27,928.38",
        "field7": "-20.46"
    },
    {
        "field1": "应交税费",
        "field2": "52,271.13",
        "field3": "17.07",
        "field4": "28,955.01",
        "field5": "-44.61",
        "field6": "26,431.21",
        "field7": "-3.55"
    },
    {
        "field1": "其他应付款",
        "field2": "10,638.65",
        "field3": "76.81",
        "field4": "8,892.29",
        "field5": "-16.42",
        "field6": "16,260.71",
        "field7": "197.24"
    },
    {
        "field1": "应付利息",
        "field2": "1,612.51",
        "field3": "0",
        "field4": "0",
        "field5": "162.6",
        "field6": "16,260.71",
        "field7": "284.01"
    },
    {
        "field1": "一年内到期的非流动负债",
        "field2": "0",
        "field3": "0",
        "field4": "21,000",
        "field5": "0",
        "field6": "119,900",
        "field7": "284.01"
    },
]
let gridData31 = [{
        "field1": "净资产收益率(%)",
        "field2": "16.79",
        "field3": "10.08",
        "field4": "16.05",
        "field5": "12.40",
        "field6": "3.10"
    },
    {
        "field1": "总资产报酬率(%)",
        "field2": "4.89",
        "field3": "2.56",
        "field4": "3.92",
        "field5": "9.00",
        "field6": "2.00"
    },
    {
        "field1": "资本保值增值率(%)",
        "field2": "——",
        "field3": "108.04",
        "field4": "115.69",
        "field5": "111.30",
        "field6": "102.10"
    },
    {
        "field1": "盈余现金保障倍数(倍)",
        "field2": "8.49",
        "field3": "0.26",
        "field4": "1.29",
        "field5": "7.70",
        "field6": "1.60"
    },
    {
        "field1": "成本费用利润率(%)",
        "field2": "3.51",
        "field3": "3.16",
        "field4": "4.37",
        "field5": "8.90",
        "field6": "2.50"
    },
]
let gridData32 = [{
        "field1": "总资产周转率(次)",
        "field2": "1.43",
        "field3": "0.84",
        "field4": "0.94",
        "field5": "1.80",
        "field6": "0.80"
    },
    {
        "field1": "流动资产周转率(次)",
        "field2": "1.94",
        "field3": "1.12",
        "field4": "1.19",
        "field5": "2.30",
        "field6": "1.00"
    },
    {
        "field1": "存货周转率(次)",
        "field2": "3.59",
        "field3": "1.95",
        "field4": "1.95",
        "field5": "14.60",
        "field6": "3.20"
    },
    {
        "field1": "应收账款周转率(次)",
        "field2": "11.22",
        "field3": "6.11",
        "field4": "7.12",
        "field5": "18.80",
        "field6": "9.50"
    },
    {
        "field1": "不良资产比率(%)",
        "field2": "0.20",
        "field3": "0.13",
        "field4": "0.03",
        "field5": "0.60",
        "field6": "5.50"
    },
]
let gridData33 = [{
        "field1": "资产负债率(%)",
        "field2": "79.84",
        "field3": "79.90",
        "field4": "79.91",
        "field5": "54.00",
        "field6": "64.00"
    },
    {
        "field1": "已获利息倍数(倍)",
        "field2": "——",
        "field3": "——",
        "field4": "——",
        "field5": "5.60",
        "field6": "2.30"
    },
    {
        "field1": "速动比率(%)",
        "field2": "58.93",
        "field3": "49.90",
        "field4": "50.64",
        "field5": "138.60",
        "field6": "79.90"
    },
    {
        "field1": "现金流动负债比率(%)",
        "field2": "22.82",
        "field3": "0.74",
        "field4": "5.58",
        "field5": "14.70",
        "field6": "3.80"
    },
]
let gridData34 = [{
        "field1": "销售(营业)收入增长率(%)",
        "field2": "——",
        "field3": "22.11",
        "field4": "25.44",
        "field5": "21.80",
        "field6": "5.90"
    },
    {
        "field1": "资本积累率(%)",
        "field2": "——",
        "field3": "8.04",
        "field4": "15.69",
        "field5": "29.10",
        "field6": "5.40"
    },
    {
        "field1": "三年资本平均增长率(%)",
        "field2": "——",
        "field3": "——",
        "field4": "7.72",
        "field5": "——",
        "field6": "——"
    },
    {
        "field1": "三年销售平均增长率(%)",
        "field2": "——",
        "field3": "——",
        "field4": "15.27",
        "field5": "——",
        "field6": "——"
    },
]
let gridData35 = [{
        "field1": "营业毛利率(%)",
        "field2": "29.63",
        "field3": "35.41",
        "field4": "22.40 ",
        "field5": "15.30",
        "field6": "10.00",
        "field7": "2.60",
        "field8": "-4.80"
    },
    {
        "field1": "成本费用利润率(%)",
        "field2": "14.29",
        "field3": "24.26",
        "field4": "12.20 ",
        "field5": "8.50",
        "field6": "4.80",
        "field7": "1.00",
        "field8": "-5.10"
    },
    {
        "field1": "营业收入增长率(%)",
        "field2": "14.91",
        "field3": "0.00",
        "field4": "12.20 ",
        "field5": "19.60",
        "field6": "15.00",
        "field7": "1.70",
        "field8": "-9.90"
    },
    {
        "field1": "营业利润增长率(%)",
        "field2": "-26.41",
        "field3": "0.00",
        "field4": "12.20",
        "field5": "18.90",
        "field6": "13.90",
        "field7": "0.40",
        "field8": "-8.60"
    },
]
let gridData36 = [{
        "field1": "成本费用利润率",
        "field2": "14.29",
        "field3": "24.26",
        "field4": "12.20",
        "field5": "8.50",
        "field6": "4.80",
        "field7": "1.00",
        "field8": "4.80"
    },

]
let gridData37 = [{
        "field1": "不良资产比率(%)",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.30",
        "field5": "1.40",
        "field6": "3.40",
        "field7": "6.30",
        "field8": "13.90"
    },
    {
        "field1": "总资产增长率(%)",
        "field2": "8.73",
        "field3": "10.64",
        "field4": "12.20",
        "field5": "8.50",
        "field6": "4.80",
        "field7": "-3.70 ",
        "field8": "-11.80 "
    },
    {
        "field1": "资产现金回收率(%)",
        "field2": "-0.92",
        "field3": "0.87",
        "field4": "12.20",
        "field5": "8.50",
        "field6": "4.80",
        "field7": "-0.21",
        "field8": "-0.74"
    },
    {
        "field1": "总资产报酬率(%)",
        "field2": "1.06",
        "field3": "1.48",
        "field4": "0.78",
        "field5": "0.78",
        "field6": "0.38",
        "field7": "0.04",
        "field8": "-0.45"
    },

]
let gridData38 = [
    {
        "field1": "带息负债比率(%)",
        "field2": "26.39",
        "field3": "38.35",
        "field4": "25.70",
        "field5": "37.20 ",
        "field6": "52.30",
        "field7": "71.60",
        "field8": "84.60",
    },
    {
        "field1": "净资产收益率(%)",
        "field2": "1.18",
        "field3": "1.87",
        "field4": "1.13",
        "field5": "0.83",
        "field6": "0.52",
        "field7": "0.05",
        "field8": "-0.69",
    },
    {
        "field1": "资本收益率(%)",
        "field2": "1.88 ",
        "field3": "1.88 ",
        "field4": "1.22 ",
        "field5": "0.89",
        "field6": "0.58",
        "field7": "0.08",
        "field8": "-0.43",
    },
    {
        "field1": "资产负债率(%)",
        "field2": "35.32 ",
        "field3": "39.11",
        "field4": "44.70 ",
        "field5": "55.20",
        "field6": "65.20",
        "field7": "80.70",
        "field8": "92.70",
    }
]
let gridData39 = [
    {
        "field1": "资产负债率(%)",
        "field2": "35.32",
        "field3": "39.11",
        "field4": "44.70",
        "field5": "55.20",
        "field6": "65.20",
        "field7": "80.70",
        "field8": "92.70",
    },
    {
        "field1": "已获利息倍数(倍)",
        "field2": "35.73",
        "field3": "35.37",
        "field4": "5.90",
        "field5": "4.50",
        "field6": "3.20",
        "field7": "0.70",
        "field8": "-1.70",
    },
    {
        "field1": "速动比率(%)",
        "field2": "206.96",
        "field3": "253.33",
        "field4": "134.80",
        "field5": "98.00",
        "field6": "75.00",
        "field7": "57.50",
        "field8": "36.60",
    },
    {
        "field1": "现金流动负债比率(%)",
        "field2": "-2.74",
        "field3": "3.22",
        "field4": "2.27",
        "field5": "1.70",
        "field6": "0.91",
        "field7": "-0.23",
        "field8": "-0.78",
    },
    {
        "field1": "带息负债比率(%)",
        "field2": "26.39",
        "field3": "38.35",
        "field4": "25.70",
        "field5": "37.20 ",
        "field6": "52.30",
        "field7": "71.60",
        "field8": "84.60",
    }
]
let gridData40 = [
    {
        "field1": "净资产收益率(%)",
        "field2": "1.18",
        "field3": "1.87",
        "field4": "1.13",
        "field5": "0.83",
        "field6": "0.52",
        "field7": "0.05",
        "field8": "-0.69",
    },
    {
        "field1": "总资产报酬率(%)",
        "field2": "1.06",
        "field3": "1.48",
        "field4": "0.78",
        "field5": "0.57",
        "field6": "0.38",
        "field7": "0.04",
        "field8": "-0.45",
    },
    {
        "field1": "营业毛利率(%)",
        "field2": "29.63",
        "field3": "35.41",
        "field4": "22.40",
        "field5": "15.30",
        "field6": "10.00 ",
        "field7": "2.60",
        "field8": "-4.80",
    },
    {
        "field1": "盈余现金保障倍数(倍)",
        "field2": "-1.20",
        "field3": "0.78",
        "field4": "0.93",
        "field5": "0.45",
        "field6": "0.10",
        "field7": "-0.08",
        "field8": "-0.32",
    },
    {
        "field1": "成本费用利润率(%)",
        "field2": "14.29",
        "field3": "24.26",
        "field4": "12.20",
        "field5": "8.50",
        "field6": "4.80",
        "field7": "1.00",
        "field8": "-5.10",
    },
    {
        "field1": "资本收益率(%)",
        "field2": "1.88",
        "field3": "2.80",
        "field4": "1.88",
        "field5": "0.89 ",
        "field6": "0.58",
        "field7": "0.08",
        "field8": "-0.43 ",
    }
]
let gridData41 = [
    {
        "field1": "总资产周转率(次)",
        "field2": "0.08",
        "field3": "0.07",
        "field4": "0.13",
        "field5": "0.08",
        "field6": "0.04",
        "field7": "0.03",
        "field8": "0.01",
    },
    {
        "field1": "流动资产周转率(次)",
        "field2": "0.11",
        "field3": "0.10",
        "field4": "0.25",
        "field5": "0.16",
        "field6": "0.13",
        "field7": "0.08",
        "field8": "0.05",
    },
    {
        "field1": "应收账款周转率(次)",
        "field2": "0.27",
        "field3": "0.24",
        "field4": "1.85",
        "field5": "1.07",
        "field6": "0.69",
        "field7": "0.33",
        "field8": "0.16",
    },
    {
        "field1": "存货周转率(次)",
        "field2": "0.44",
        "field3": "0.35",
        "field4": "18.50",
        "field5": "12.00",
        "field6": "5.30",
        "field7": "2.70",
        "field8": "2.70",
    }
]
let gridData42 = [
    {
        "field1": "资本保值增值率(%)",
        "field2": "107.96",
        "field3": "116.94",
        "field4": "113.40",
        "field5": "108.90",
        "field6": "106.10",
        "field7": "101.30",
        "field8": "91.00",
    },
    {
        "field1": "营业增长率(%)",
        "field2": "14.91",
        "field3": "",
        "field4": "26.90 ",
        "field5": "19.60",
        "field6": "15.00",
        "field7": "1.70",
        "field8": "-9.90",
    },
    {
        "field1": "营业利润增长率(%)",
        "field2": "-26.41",
        "field3": "",
        "field4": "25.90",
        "field5": "18.90",
        "field6": "13.90",
        "field7": "0.40",
        "field8": "-8.60",
    },
    {
        "field1": "总资产增长率(%)",
        "field2": "8.73",
        "field3": "10.64 ",
        "field4": "19.90",
        "field5": "16.10",
        "field6": "10.40",
        "field7": "-3.70",
        "field8": "-11.80",
    }
]
let gridData43 = [
    {
        "field1": "资产现金回收率(%)",
        "field2": "-0.92",
        "field3": "0.87",
        "field4": "1.81",
        "field5": "0.83",
        "field6": "0.33",
        "field7": "-0.21",
        "field8": "-0.74",
    },
    {
        "field1": "盈余现金保障倍数(倍)",
        "field2": "-1.20",
        "field3": "0.78",
        "field4": "0.9",
        "field5": "0.45",
        "field6": "0.10",
        "field7": "-0.08",
        "field8": "-0.32",
    },
    {
        "field1": "现金流动负债比率(%)",
        "field2": "-2.74",
        "field3": "3.22",
        "field4": "2.27",
        "field5": "1.70",
        "field6": "0.91",
        "field7": "-0.23",
        "field8": "-0.78",
    }
]
let gridData44 = [
    {
        "field1": "净资产收益率(%)",
        "field2": "1.18",
        "field3": "1.87",
        "field4": "1.13",
        "field5": "0.83",
        "field6": "0.52",
        "field7": "0.05",
        "field8": "-0.69",
    },
    {
        "field1": "总资产周转率(次)",
        "field2": "0.08",
        "field3": "0.07",
        "field4": "0.13",
        "field5": "0.08",
        "field6": "0.04",
        "field7": "0.03",
        "field8": "0.01",
    },

]
let gridData45 = [
    {
        "field1": "应收账款",
        "field2": "182,397,263.45",
        "field3": "106,044,203.22",
        "field4": "52,688,301.66",
    },
    {
        "field1": "应收票据",
        "field2": "9,850,000.00",
        "field3": "11,190,000.00",
        "field4": "4,374,047.00",
    },
]
let gridData46 = [
    {
        "field1": "营业总收入",
        "field2": "5,191,410.14",
        "field3": "90,297,045.23 ",
        "field4": "82,166,783.85",
        "field5": "8,130,261.38",
        "field6": "9.89%",
    },
    {
        "field1": "主营业务收入",
        "field2": "3,032,854.58",
        "field3": "1,819,563.63",
        "field4": "70,095,505.03",
        "field5": "13,724,058.60",
        "field6": "12.81%",
    },
    {
        "field1": "其他业务收入",
        "field2": "1,032,554.28",
        "field3": "85,574,705.84",
        "field4": "16,773,341.43",
        "field5": "12,801,364.41",
        "field6": "11.99%",
    },
    {
        "field1": "营业外收入",
        "field2": "1126001.2",
        "field3": "31256001.18",
        "field4": "0.00",
        "field5": "0.00",
        "field6": "",
    }
]
let gridData47 = [
    {
        "field1": "资产总额",
        "field2": "93,579.06",
        "field3": "100.00%",
        "field4": "89,310.96",
        "field5": "100.00%",
        "field6": "84,839.64",
        "field7": "100.00%",
    },
    {
        "field1": "流动资产",
        "field2": "26,896.76",
        "field3": "28.74%",
        "field4": "26,170.90",
        "field5": "29.30%",
        "field6": "27,048.45",
        "field7": "31.88%",
    },
    {
        "field1": "固定资产类",
        "field2": "35,139.56",
        "field3": "37.55%",
        "field4": "31,654.90",
        "field5": "35.44%",
        "field6": "26,120.95",
        "field7": "30.79%",
    },
    {
        "field1": "无形及递延资产类",
        "field2": "2,012.74",
        "field3": "2.15%",
        "field4": "1,955.16",
        "field5": "2.19%",
        "field6": "1,904.51",
        "field7": "2.24%",
    },
    {
        "field1": "长期投资类",
        "field2": "29,530.00",
        "field3": "31.56%",
        "field4": "29,530.00",
        "field5": "33.06%",
        "field6": "29,765.73",
        "field7": "35.08%",
    },
    {
        "field1": "其他类",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%",
    }
]
let gridData48 = [
    {
        "field1": "流动资产",
        "field2": "26,896.76",
        "field3": "100.00%",
        "field4": "26,170.90",
        "field5": "100.00%",
        "field6": "27,048.45",
        "field7": "100.00%",
        "field8": "",
    },
    {
        "field1": "货币资金",
        "field2": "8,559.52",
        "field3": "31.82%",
        "field4": "114.67",
        "field5": "0.44%",
        "field6": "617.52",
        "field7": "2.28%",
        "field8": "",
    },
    {
        "field1": "应收票据",
        "field2": "17,597.02",
        "field3": "0.00",
        "field4": "0.00%",
        "field5": "9.00",
        "field6": "0.03%",
        "field7": "0.00",
        "field8": "0.00%",
    },
    {
        "field1": "存货",
        "field2": "17,597.02",
        "field3": "65.42%",
        "field4": "23,381.43",
        "field5": "89.34%",
        "field6": "19,224.45",
        "field7": "71.07%",
        "field8": "",
    },
    {
        "field1": "应收账款",
        "field2": "723.47",
        "field3": "2.69%",
        "field4": "2,633.00",
        "field5": "10.06%",
        "field6": "5,270.82",
        "field7": "19.49%",
        "field8": "",
    },
    {
        "field1": "其他",
        "field2": "16.75",
        "field3": "0.06%",
        "field4": "32.80",
        "field5": "0.13%",
        "field6": "1,935.66",
        "field7": "7.16%",
        "field8": "",
    }
]
let gridData49 = [
    {
        "field1": "存货",
        "field2": "17,597.02",
        "field3": "",
        "field4": "23,381.43",
        "field5": "32.87%",
        "field6": "19,224.45",
        "field7": "-17.78%",
        "field8": "",
    },
    {
        "field1": "应收账款",
        "field2": "723.47",
        "field3": "",
        "field4": "2,633.00",
        "field5": "263.94%",
        "field6": "5,270.82",
        "field7": "100.18%",
        "field8": "",
    },
    {
        "field1": "预付款项",
        "field2": "0.00",
        "field3": "",
        "field4": "0.00",
        "field5": "",
        "field6": "1,065.08",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "其他应收款",
        "field2": "16.75",
        "field3": "",
        "field4": "32.80",
        "field5": "95.85%",
        "field6": "870.58",
        "field7": "2554.04%",
        "field8": "",
    },  {
        "field1": "固定资产类",
        "field2": "35,139.56",
        "field3": "",
        "field4": "31,654.90",
        "field5": "-9.92%",
        "field6": "26,120.95",
        "field7": "-17.48%",
        "field8": "",
    },  {
        "field1": "长期投资类",
        "field2": "",
        "field3": "29,530.00",
        "field4": "29,530.00",
        "field5": "0.00%",
        "field6": "29,765.73",
        "field7": "0.80%",
      
    },  {
        "field1": "无形及递延资产类",
        "field2": "2,012.74",
        "field3": "",
        "field4": "1,955.16",
        "field5": "-2.86%",
        "field6": "1,904.51",
        "field7": "-2.59%",
        "field8": "",
    },
]
let gridData50 = [
    {
        "field1": "流动资产",
        "field2": "156.92",
        "field3": "12.41",
        "field4": "1783.3",
        "field5": "180.72",
        "field6": "635.45",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "长期投资",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "固定资产",
        "field2": "80.42",
        "field3": "30.13",
        "field4": "115.1",
        "field5": "-31.06",
        "field6": "166.96",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "存货",
        "field2": "229.36",
        "field3": "-2.39",
        "field4": "234.76",
        "field5": "23.58",
        "field6": "189.99",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "应收账款",
        "field2": "182.62",
        "field3": "-0.96",
        "field4": "184.4",
        "field5": "8.47",
        "field6": "169.99",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "货币性资产",
        "field2": "1137.15",
        "field3": "-16.46",
        "field4": "1361.16",
        "field5": "404.28",
        "field6": "269.92",
        "field7": "0",
        "field8": "",
    },
]
let gridData51 = [
    {
        "field1": "负债总额",
        "field2": "42,221.68",
        "field3": "45.12%",
        "field4": "32,011.8",
        "field5": "35.84%",
        "field6": "30,577.37",
        "field7": "36.04%",
        "field8": "",
    },
    {
        "field1": "流动负债",
        "field2": "30,221.68",
        "field3": "32.30%",
        "field4": "24,011.86",
        "field5": "26.89%",
        "field6": "26,577.37",
        "field7": "31.33%",
        "field8": "",
    },
    {
        "field1": "非流动负债",
        "field2": "12,000.00",
        "field3": "12.82%",
        "field4": "8,000.00",
        "field5": "8.96%",
        "field6": "4,000.00",
        "field7": "4.71%",
        "field8": "",
    },
    {
        "field1": "所有者权益",
        "field2": "51,357.37",
        "field3": "54.88%",
        "field4": "57,299.10",
        "field5": "64.16%",
        "field6": "54,262.27",
        "field7": "63.96%",
        "field8": "",
    }, 
       {
        "field1": "负债及权益总额",
        "field2": "93,579.06",
        "field3": "100.00%",
        "field4": "89,310.96",
        "field5": "100.00%",
        "field6": "84,839.64",
        "field7": "100.00%",
        "field8": "",
    },
]
let gridData52 = [
    {
        "field1": "流动负债",
        "field2": "30,221.68",
        "field3": "71.58%",
        "field4": "24,011.86",
        "field5": "75.01%",
        "field6": "26,577.37",
        "field7": "86.92%",
        "field8": "",
    },
    {
        "field1": "短期借款",
        "field2": "17,210.00",
        "field3": "40.76%",
        "field4": "21,240.00",
        "field5": "66.35%",
        "field6": "24,240.00",
        "field7": "79.27%",
        "field8": "",
    },
    {
        "field1": "应付账款",
        "field2": "178.87",
        "field3": "0.42%",
        "field4": "736.56",
        "field5": "736.56",
        "field6": "1,214.72",
        "field7": "3.97%",
        "field8": "",
    },
    {
        "field1": "应交税费",
        "field2": "122.30",
        "field3": "0.29%",
        "field4": "552.77",
        "field5": "1.73%",
        "field6": "463.57",
        "field7": "1.52%",
        "field8": "",
    },
    {
        "field1": "预收款项",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "347.03",
        "field5": "1.08%",
        "field6": "299.91",
        "field7": "0.98%",
        "field8": "",
    },
    {
        "field1": "非流动负债",
        "field2": "12,000.00",
        "field3": "28.42%",
        "field4": "8,000.00",
        "field5": "24.99%",
        "field6": "4,000.00",
        "field7": "13.08%",
        "field8": "",
    },
    {
        "field1": "长期借款",
        "field2": "12,000.00",
        "field3": "28.42%",
        "field4": "8,000.00",
        "field5": "24.99%",
        "field6": "4,000.00",
        "field7": "13.08%",
        "field8": "",
    },
    {
        "field1": "负债总额",
        "field2": "42,221.68",
        "field3": "100.00%",
        "field4": "32,011.86",
        "field5": "100.00%",
        "field6": "30,577.37",
        "field7": "100.00%",
        "field8": "",
    },
]
let gridData53 = [
    {
        "field1": "有息负债总额",
        "field2": "29,210.00",
        "field3": "69.18%",
        "field4": "29,240.00",
        "field5": "91.34%",
        "field6": "28,240.00",
        "field7": "92.36%",
        "field8": "55.71%",
        "field9": "-12.81%",
    },
    {
        "field1": "短期有息负债",
        "field2": "17,210.00",
        "field3": "40.76%",
        "field4": "21,240.00",
        "field5": "66.35%",
        "field6": "24,240.00",
        "field7": "79.27%",
        "field8": "3.40%",
        "field9": "2.62%",
    },
    {
        "field1": "长期有息负债",
        "field2": "12,000.00",
        "field3": "28.42%",
        "field4": "8,000.00",
        "field5": "24.99%",
        "field6": "4,000.00",
        "field7": "13.08%",
        "field8": "2.86%",
        "field9": "502.33%",
    },
    {
        "field1": "其他负债",
        "field2": "13,011.68",
        "field3": "30.82%",
        "field4": "2,771.86",
        "field5": "8.66%",
        "field6": "2,337.37",
        "field7": "7.64%",
        "field8": "0.00%",
        "field9": "100.00%",
    },
    {
        "field1": "负债总额",
        "field2": "42,221.68",
        "field3": "100.00%",
        "field4": "32,011.86",
        "field5": "100.00%",
        "field6": "30,577.37",
        "field7": "100.00%",
        "field8": "0.00%",
        "field9": "",
    },
]
let gridData54 = [
    {
        "field1": "负债总额",
        "field2": "68.74",
        "field3": "-4.49",
        "field4": "71.97",
        "field5": "-19.05",
        "field6": "88.91",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "短期借款",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "应付账款",
        "field2": "18.37",
        "field3": "3.77",
        "field4": "17.7",
        "field5": "-42.94",
        "field6": "31.02",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "其他应付款",
        "field2": "9.88",
        "field3": "6.42",
        "field4": "9.29",
        "field5": "-12.49",
        "field6": "10.61",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "非流动负债",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "-100",
        "field6": "5.6",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "其他",
        "field2": "40.49",
        "field3": "-9.99",
        "field4": "44.99",
        "field5": "7.94",
        "field6": "41.67",
        "field7": "0",
        "field8": "",
    },
]
let gridData55 = [
    {
        "field1": "流动负债",
        "field2": "30,221.68",
        "field3": "",
        "field4": "24,011.86",
        "field5": "-20.55%",
        "field6": "26,577.37",
        "field7": "10.68%",
        "field8": "",
    },
    {
        "field1": "短期借款",
        "field2": "17,210.00",
        "field3": "",
        "field4": "21,240.00",
        "field5": "23.42%",
        "field6": "24,240.00",
        "field7": "14.12%",
        "field8": "",
    },
    {
        "field1": "应付账款",
        "field2": "178.87",
        "field3": "",
        "field4": "178.87",
        "field5": "311.78%",
        "field6": "1,214.72",
        "field7": "64.92%",
        "field8": "",
    },
    {
        "field1": "应交税费",
        "field2": "122.30",
        "field3": "",
        "field4": "552.77",
        "field5": "351.98%",
        "field6": "463.57",
        "field7": "16.14%",
        "field8": "",
    },
    {
        "field1": "预收款项",
        "field2": "0.00",
        "field3": "",
        "field4": "347.03",
        "field5": "",
        "field6": "299.91",
        "field7": "13.58%",
        "field8": "",
    },
    {
        "field1": "非流动负债",
        "field2": "12,000.00",
        "field3": "",
        "field4": "8,000.00",
        "field5": "-33.33%",
        "field6": "4,000.00",
        "field7": "50.00%",
        "field8": "",
    },
    {
        "field1": "长期借款",
        "field2": "12,000.00",
        "field3": "",
        "field4": "8,000.00",
        "field5": "-33.33%",
        "field6": "4,000.00",
        "field7": "50.00%",
        "field8": "",
    },
    {
        "field1": "负债总额",
        "field2": "42,221.68",
        "field3": "",
        "field4": "32,011.86",
        "field5": "-24.18%",
        "field6": "30,577.37",
        "field7": "-4.48%",
        "field8": "",
    },
]
let gridData56 = [
    {
        "field1": "有息负债总额",
        "field2": "29,210.00",
        "field3": "",
        "field4": "29,240.00",
        "field5": "0.10%",
        "field6": "28,240.00",
        "field7": "-3.42%",
        "field8": "",
    },
    {
        "field1": "短期有息负债",
        "field2": "17,210.00",
        "field3": "",
        "field4": "21,240.00",
        "field5": "23.42%",
        "field6": "24,240.00",
        "field7": "14.12%",
        "field8": "",
    },
    {
        "field1": "长期有息负债",
        "field2": "12,000.00",
        "field3": "",
        "field4": "8,000.00",
        "field5": "33.33%",
        "field6": "4,000.00",
        "field7": "50.00%",
        "field8": "",
    },
    {
        "field1": "其他负债",
        "field2": "13,011.68",
        "field3": "",
        "field4": "2,771.86",
        "field5": "78.70%",
        "field6": "2,337.37",
        "field7": "15.68%",
        "field8": "",
    },
    {
        "field1": "其他负债",
        "field2": "42,221.68",
        "field3": "",
        "field4": "32,011.86",
        "field5": "24.18%",
        "field6": "30,577.37",
        "field7": "-4.48%",
        "field8": "",
    },
]
let gridData57 = [
    {
        "field1": "实收资本",
        "field2": "8,500.00",
        "field3": "16.55%",
        "field4": "8,500.00",
        "field5": "14.83%",
        "field6": "8,500.00",
        "field7": "15.66%",
        "field8": "",
    },
    {
        "field1": "资本公积",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%",
        "field8": "",
    },
    {
        "field1": "盈余公积",
        "field2": "0.00",
        "field3": "0.00%",
        "field4": "0.00",
        "field5": "0.00%",
        "field6": "0.00",
        "field7": "0.00%",
        "field8": "",
    },
    {
        "field1": "未分配利润",
        "field2": "42,857.37",
        "field3": "83.45%",
        "field4": "48,799.10",
        "field5": "85.17%",
        "field6": "45,762.27",
        "field7": "84.34%",
        "field8": "",
    },
    {
        "field1": "所有者权益",
        "field2": "51,357.37",
        "field3": "100.00%",
        "field4": "57,299.10",
        "field5": "100.00%",
        "field6": "54,262.27",
        "field7": "100.00%",
        "field8": "",
    },
]
let gridData58 = [
    {
        "field1": "实收资本",
        "field2": "8,500.00",
        "field3": "",
        "field4": "8,500.00",
        "field5": "0.00%",
        "field6": "8,500.00",
        "field7": "0.00%",
        "field8": "",
    },
    {
        "field1": "资本公积",
        "field2": "0.00",
        "field3": "",
        "field4": "0.00",
        "field5": "",
        "field6": "0.00",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "盈余公积",
        "field2": "0.00",
        "field3": "",
        "field4": "0.00",
        "field5": "",
        "field6": "0.00",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "未分配利润",
        "field2": "42,857.37",
        "field3": "",
        "field4": "48,799.10",
        "field5": "13.86%",
        "field6": "45,762.27",
        "field7": "-6.22%",
        "field8": "",
    },
    {
        "field1": "所有者权益",
        "field2": "51,357.37",
        "field3": "",
        "field4": "57,299.10",
        "field5": "11.57%",
        "field6": "54,262.27",
        "field7": "-5.30%",
        "field8": "",
    },
]
let gridData59 = [
    {
        "field1": "流动比率",
        "field2": "22.72",
        "field3": "24.78",
        "field4": "7.63",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "速动比率",
        "field2": "19.39",
        "field3": "21.52",
        "field4": "5.35",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "利息保障倍数",
        "field2": "0",
        "field3": "0",
        "field4": "11.98",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "资产负债率",
        "field2": "0.04",
        "field3": "0.04",
        "field4": "0.11",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
]
let gridData60 = [
    {
        "field1": "1",
        "field2": "流动比率(%)",
        "field3": "89.00",
        "field4": "108.99",
        "field5": "101.77",
        "field6": "-7.22",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "2",
        "field2": "速动比率(%)",
        "field3": "30.77",
        "field4": "11.62",
        "field5": "29.44",
        "field6": "17.82",
        "field8": "",
    },
    {
        "field1": "3",
        "field2": "现金比率(%)",
        "field3": "28.32",
        "field4": "0.48",
        "field5": "2.32",
        "field6": "1.84",
        "field7": "",
        "field8": "",
    }
]
let gridData61 = [
    {
        "field1": "1",
        "field2": "资产负债率(%)",
        "field3": "45.12",
        "field4": "35.84",
        "field5": "36.04",
        "field6": "0.20",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "2",
        "field2": "产权比率(%)",
        "field3": "54.88",
        "field4": "64.16",
        "field5": "63.96",
        "field6": "-0.20",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "3",
        "field2": "产权比率(%)",
        "field3": "4.47",
        "field4": "5.06",
        "field5": "4.16",
        "field6": "-0.90",
        "field7": "",
        "field8": "",
    }
]
let gridData62 = [
    {
        "field1": "营业收入",
        "field2": "61,046.85",
        "field3": "",
        "field4": "66,681.96",
        "field5": "9.23%",
        "field6": "65,629.86",
        "field7": "-1.58%",
        "field8": "",
    },
    {
        "field1": "利润总额",
        "field2": "5,622.69",
        "field3": "",
        "field4": "7,060.55",
        "field5": "25.57%",
        "field6": "5,596.13",
        "field7": "-20.74%",
        "field8": "",
    },
    {
        "field1": "核心利润",
        "field2": "193.35",
        "field3": "",
        "field4": "471.97",
        "field5": "144.10%",
        "field6": "372.61",
        "field7": "-21.05%",
        "field8": "",
    },
    {
        "field1": "投资收益",
        "field2": "492.08",
        "field3": "",
        "field4": "173.57",
        "field5": "-64.73%",
        "field6": "409.30",
        "field7": "135.81%",
        "field8": "",
    },
    {
        "field1": "营业外利润",
        "field2": "-15.60",
        "field3": "",
        "field4": "-35.62",
        "field5": "128.37%",
        "field6": "95.41",
        "field7": "367.89%",
        "field8": "",
    },
]
let gridData63 = [
    {
        "field1": "营业收入",
        "field2": "441.45",
        "field3": "-30.77",
        "field4": "637.66",
        "field5": "14.66",
        "field6": "556.12",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "实现利润",
        "field2": "-254.29",
        "field3": "-590.78",
        "field4": "51.81",
        "field5": "0.14",
        "field6": "51.74",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "营业利润",
        "field2": "-255.83",
        "field3": "-1887.36",
        "field4": "14.31",
        "field5": "192.04",
        "field6": "-15.55",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "投资收益",
        "field2": "0",
        "field3": "0",
        "field4": "0",
        "field5": "0",
        "field6": "0",
        "field7": "0",
        "field8": "",
    },
    {
        "field1": "营业外利润",
        "field2": "1.54",
        "field3": "-95.89",
        "field4": "37.5",
        "field5": "-44.27",
        "field6": "67.29",
        "field7": "0",
        "field8": "",
    },
]
let gridData64 = [
    {
        "field1": "营业成本",
        "field2": "56,568.37",
        "field3": "92.96%",
        "field4": "60,469.18",
        "field5": "91.33%",
        "field6": "59,623.09",
        "field7": "91.37%",
        "field8": "",
    },
    {
        "field1": "营业税金及附加",
        "field2": "259.86",
        "field3": "0.43%",
        "field4": "343.27",
        "field5": "0.52%",
        "field6": "593.72",
        "field7": "0.91%",
        "field8": "",
    },
    {
        "field1": "销售费用",
        "field2": "1,540.09",
        "field3": "2.53%",
        "field4": "2,491.92",
        "field5": "3.76%",
        "field6": "2,236.41",
        "field7": "3.43%",
        "field8": "",
    },
    {
        "field1": "管理费用",
        "field2": "862.70",
        "field3": "1.42%",
        "field4": "1,165.02",
        "field5": "1.76%",
        "field6": "1,033.86",
        "field7": "1.58%",
        "field8": "",
    },
    {
        "field1": "财务费用",
        "field2": "1,622.48",
        "field3": "2.67%",
        "field4": "1,740.60",
        "field5": "2.63%",
        "field6": "1,770.17",
        "field7": "2.71%",
        "field8": "",
    },
    {
        "field1": "成本费用总额",
        "field2": "60,853.49",
        "field3": "100.00%",
        "field4": "66,209.99",
        "field5": "100.00%",
        "field6": "65,257.26",
        "field7": "100.00%",
        "field8": "",
    },
]
let gridData65 = [
    {
        "field1": "营业成本",
        "field2": "56,568.37",
        "field3": "",
        "field4": "",
        "field5": "60,469.18",
        "field6": "6.90%",
        "field7": "37.71",
        "field8": "59,623.09",
        "field9": "1.40%",
        "field10": "3.76",
    },
    {
        "field1":  "营业税金及附加",
        "field2":  "259.86 ",
        "field3":  "       ",
        "field4":  "       ",
        "field5":  "343.27 ",
        "field6":  "32.10% ",
        "field7":  "7.6   ",
        "field8":  "593.72 ", 
        "field9":  "72.96% ",          
        "field10": "12.31  ",          
    },
    {
        "field1":  "销售费用",
        "field2":  "1,540.09",
        "field3":  "        ",
        "field4":  "        ",
        "field5":  "2,491.92",
        "field6":  "61.80%  ",
        "field7":  "0       ",
        "field8":  "2,236.41",
        "field9":  "10.25% ",         
        "field10": "0",         
    },
    {                              
        "field1":  "管理费用    ",         
        "field2":  "862.7   ",     
        "field3":  "        ",     
        "field4":  "        ",     
        "field5":  "1,165.02",     
        "field6":  "35.04%  ",     
        "field7":  "93.76  ",     
        "field8":  "1,033.86",     
        "field9":  "11.26% ",     
        "field10": "0       ",              
    },                                
    {                          
        "field1":  "财务费用    ",     
        "field2":  "1,622.48", 
        "field3":  "        ", 
        "field4":  "        ", 
        "field5":  "1,740.60", 
        "field6":  "7.28%   ", 
        "field7":  "0       ", 
        "field8":  "1,770.17", 
        "field9":  "1.70%   ", 
        "field10": "0       ",        
    },                         
    {                          
        "field1":  "成本费用总额   ",     
        "field2":  "60,853.49", 
        "field3":  "         ", 
        "field4":  "         ", 
        "field5":  "66,209.99", 
        "field6":  "8.80%    ", 
        "field7":  "55.51   ", 
        "field8":  "65,257.26", 
        "field9":  "1.44%   ", 
        "field10": "57.09    ",            
    }                             

]
let gridData66 = [
    {
        "field1": "营业毛利率",
        "field2": "33.71",
        "field3": "59.97",
        "field4": "58.07",
    },
    {
        "field1": "营业利润率 ",
        "field2": "57.95",
        "field3": "2.24  ",
        "field4": "2.8  ",

    },
    {
        "field1": "成本费用利润率",
        "field2": "36.47 ",
        "field3": "8.31   ",
        "field4": "9.05   ",
    },
    {
        "field1": "总资产报酬率",
        "field2": "14.59",
        "field3": "3.64  ",
        "field4": "6.99  ",
    },
    {
        "field1": "净资产收益率",
        "field2": "14.96",
        "field3": "2.83  ",
        "field4": "5.05  ",
    }    
         
]
let gridData67 = [
    {
        "field1": "销售收入     ",
        "field2": "76,092.62",
        "field3": "76.25%   ",
        "field4": "76,446.39",
        "field5": "65.57%   ",
        "field6": "86,195.49",
        "field7": "61.35%   ",
        "field8": "66.18   ",  
        "field9": "80.25   ",        
    },
    {
        "field1": "税金返还    ",
        "field2": "4,951.93",
        "field3": "4.96%   ",
        "field4": "6,330.51",
        "field5": "5.43%   ",
        "field6": "4,725.29",
        "field7": "3.36%   ",
        "field8": "744.4  ",  
        "field9": "93.72   ",        
    },
    {
        "field1": "收回投资  ",
        "field2": "850   ",
        "field3": "0.85% ",
        "field4": "0     ",
        "field5": "0.00% ",
        "field6": "0     ",
        "field7": "0.00% ",
        "field8": "70.88",  
        "field9": "0     ",        
    },
    {
        "field1": "取得投资收益",
        "field2": "492.08",
        "field3": "0.49% ",
        "field4": "0     ",
        "field5": "0.00% ",
        "field6": "409.3 ",
        "field7": "0.29% ",
        "field8": "0.07  ",  
        "field9": "38.91 ",        
    },
    {
        "field1": "处置长期资产",
        "field2": "0     ",
        "field3": "0.00% ",
        "field4": "0     ",
        "field5": "0.00% ",
        "field6": "0     ",
        "field7": "0.00% ",
        "field8": "66.18",  
        "field9": "59.07 ",        
    },
    {
        "field1": "吸收投资  ",
        "field2": "0     ",
        "field3": "0.00% ",
        "field4": "0     ",
        "field5": "0.00% ",
        "field6": "0     ",
        "field7": "0.00% ",
        "field8": "62.91",  
        "field9": "70.39",        
    },
    {
        "field1": "吸收借款     ",
        "field2": "17,410.00",
        "field3": "17.45%   ",
        "field4": "21,240.00",
        "field5": "18.22%   ",
        "field6": "24,240.00",
        "field7": "17.25%   ",
        "field8": "45.34   ",  
        "field9": "0        ",        
    },
    {
        "field1": "其他收入     ",
        "field2": "0        ",
        "field3": "0.00%    ",
        "field4": "12,575.20",
        "field5": "10.79%   ",
        "field6": "24,938.57",
        "field7": "17.75%   ",
        "field8": "91.46    ",  
        "field9": "10.62   ",        
    },
    {
        "field1": "现金流入总额    ",
        "field2": "99,796.63 ",
        "field3": "100.00%   ",
        "field4": "116,592.10",
        "field5": "100.00%   ",
        "field6": "140,508.65",
        "field7": "100.00%   ",
        "field8": "1.73      ",  
        "field9": "0         ",        
    }
]
let gridData68 = [
    {
        "field1": "销售收入     ",
        "field2": "76,092.62",
        "field3": "        ",
        "field4": "76,446.39",
        "field5": "0.46%    ",
        "field6": "86,195.49",
        "field7": "12.75%   ",
        "field8": "3.76    ",
    },
    {
        "field1": "税金返还    ",
        "field2": "4,951.93",
        "field3": "       ",
        "field4": "6,330.51",
        "field5": "27.84%  ",
        "field6": "4,725.29",
        "field7": "25.36% ",
        "field8": "12.31   ",
    },
    {
        "field1": "收回投资   ",
        "field2": "850    ",
        "field3": "       ",
        "field4": "0      ",
        "field5": "100.00%",
        "field6": "0      ",
        "field7": "       ",
        "field8": "0      ",
    },
        {
        "field1": "取得投资收益 ",
        "field2": "492.08 ",
        "field3": "       ",
        "field4": "0      ",
        "field5": "100.00%",
        "field6": "409.3  ",
        "field7": "       ",
        "field8": "0      ",
    },
        {
        "field1": "处置长期资产",
        "field2": "0     ",
        "field3": "      ",
        "field4": "0     ",
        "field5": "      ",
        "field6": "0     ",
        "field7": "      ",
        "field8": "0     ",
    },
        {
        "field1": "吸收投资 ",
        "field2": "0    ",
        "field3": "    ",
        "field4": "0    ",
        "field5": "    ",
        "field6": "0    ",
        "field7": "    ",
        "field8": "57.09",
    },
        {
        "field1": "吸收借款     ",
        "field2": "17,410.00",
        "field3": "        ",
        "field4": "21,240.00",
        "field5": "22.00%   ",
        "field6": "24,240.00",
        "field7": "14.12%   ",
        "field8": "57.09   ",
    },
        {
        "field1": "其他收入     ",
        "field2": "0        ",
        "field3": "        ",
        "field4": "12,575.20",
        "field5": "        ",
        "field6": "24,938.57",
        "field7": "98.32%   ",
        "field8": "6.7      ",
    },
        {
        "field1": "现金流入总额    ",
        "field2": "99,796.63 ",
        "field3": "         ",
        "field4": "116,592.10",
        "field5": "16.83%    ",
        "field6": "140,508.65",
        "field7": "20.51%    ",
        "field8": "59.07     ",
    }
]
let gridData69 = [
    {
        "field1": "购买商品、接受劳务支出",
        "field2": "69,182.69  ",
        "field3": "73.24%     ",
        "field4": "89,459.01  ",
        "field5": "71.55%     ",
        "field6": "78,000.98  ",
        "field7": "55.71%     ",
        "field8": "66.18     ",  
        "field9": "39.02     ",        
    },
    {                   
        "field1": "工资性支出   ",   
        "field2": "4,630.18",   
        "field3": "4.90%   ",   
        "field4": "4,633.48",   
        "field5": "3.71%   ",   
        "field6": "4,754.70",   
        "field7": "3.40%   ",   
        "field8": "744.4  ",   
        "field9": "12.52   ",   
    },
    {                                         
        "field1": "税费支付    ",   
        "field2": "2,425.29",   
        "field3": "2.57%   ",   
        "field4": "665.77  ",   
        "field5": "0.53%   ",   
        "field6": "4,010.12",   
        "field7": "2.86%   ",   
        "field8": "70.88  ",   
        "field9": "11.12  ",   
    }, 
    {                   
        "field1": "资产购置    ",   
        "field2": "0       ",   
        "field3": "0.00%   ",   
        "field4": "2,016.11",   
        "field5": "1.61%   ",   
        "field6": "0       ",   
        "field7": "0.00%   ",         
        "field8": "0.07    ",       
        "field9": "        ",       
    },                      
    {                   
        "field1": "对外投资  ",   
        "field2": "0     ",   
        "field3": "0.00% ",   
        "field4": "0     ",   
        "field5": "0.00% ",   
        "field6": "0     ",   
        "field7": "0.00% ",   
        "field8": "62.91",   
        "field9": "43.39",   
    },                  
    {                   
        "field1": "偿还债务     ",   
        "field2": "16,600.00",   
        "field3": "17.57%   ",   
        "field4": "21,210.00",   
        "field5": "16.96%   ",   
        "field6": "25,240.00",   
        "field7": "18.03%   ",   
        "field8": "45.34   ",   
        "field9": "109.83   ",   
    },                  
    {                   
        "field1": "利润分配    ",   
        "field2": "1,622.48",   
        "field3": "1.72%   ",   
        "field4": "1,768.49",   
        "field5": "1.41%   ",   
        "field6": "8,000.00",   
        "field7": "5.71%   ",   
        "field8": "91.46   ",   
        "field9": "52.34  ",   
    },                  
    {                   
        "field1": "其他支出     ",   
        "field2": "0        ",   
        "field3": "0.00%    ",   
        "field4": "5,284.10 ",   
        "field5": "4.23%    ",   
        "field6": "20,000.00",   
        "field7": "14.29%   ",   
        "field8": "1.73     ",   
        "field9": "1.53     ",   
    },                  
    {                   
        "field1": "现金流出总额    ",   
        "field2": "94,460.64 ",   
        "field3": "100.00%   ",   
        "field4": "125,036.95",   
        "field5": "100.00%   ",   
        "field6": "140,005.79",   
        "field7": "100.00%   ",   
        "field8": "7.71      ",       
        "field9": "1.53      ",       
    }                                    


]
let gridData70 = [
    {
        "field1": "购买商品、接受劳务支出",
        "field2": "69,182.69  ",
        "field3": "          ",
        "field4": "89,459.01  ",
        "field5": "29.31%     ",
        "field6": "78,000.98  ",
        "field7": "12.81%    ",
    },
    {
        "field1": "工资性支出   ",
        "field2": "4,630.18",
        "field3": "       ",
        "field4": "4,633.48",
        "field5": "0.07%   ",
        "field6": "4,754.70",
        "field7": "2.62%   ",
    },
    {
        "field1": "税费支付    ",
        "field2": "2,425.29",
        "field3": "       ",
        "field4": "665.77  ",
        "field5": "72.55% ",
        "field6": "4,010.12",
        "field7": "502.33% ",
    },
    {                       
        "field1": "资产购置    ",       
        "field2": "0       ",       
        "field3": "       ",       
        "field4": "2,016.11",       
        "field5": "       ",       
        "field6": "0       ",       
        "field7": "100.00%",       
    },                      
    {                       
        "field1": "对外投资",       
        "field2": "0   ",       
        "field3": "   ",       
        "field4": "0   ",       
        "field5": "   ",       
        "field6": "0   ",       
        "field7": "   ",       
    },                      
    {                       
        "field1": "偿还债务     ",       
        "field2": "16,600.00",       
        "field3": "        ",       
        "field4": "21,210.00",       
        "field5": "27.77%   ",       
        "field6": "25,240.00",       
        "field7": "19.00%   ",       
    },                      
    {                       
        "field1": "利润分配    ",       
        "field2": "1,622.48",       
        "field3": "       ",       
        "field4": "1,768.49",       
        "field5": "9.00%   ",       
        "field6": "8,000.00",       
        "field7": "352.36% ",       
    },                      
    {                       
        "field1": "其他支出     ",       
        "field2": "0        ",       
        "field3": "        ",       
        "field4": "5,284.10 ",       
        "field5": "        ",       
        "field6": "20,000.00",       
        "field7": "278.49%  ",       
    },                      
    {                       
        "field1": "现金流出总额    ",       
        "field2": "94,460.64 ",       
        "field3": "         ",       
        "field4": "125,036.95",       
        "field5": "32.37%    ",       
        "field6": "140,005.79",       
        "field7": "11.97%    ",       
    }                     
   
]
let gridData71 = [
    {
        "field1": "经营活动产生的现金流量净额",
        "field2": "28667250    ",
        "field3": "2123500     ",
        "field4": "26543750    ",
        "field5": "92.59%       ",
    },
    {
        "field1": "投资活动产生的现金流量净额",
        "field2": "282172      ",
        "field3": "116600      ",
        "field4": "165572      ",
        "field5": "58.68%       ",

    },
    {
        "field1": "筹资活动产生的现金流量净额",
        "field2": "0            ",
        "field3": "10753200     ",
        "field4": "10753200    ",
        "field5": "0.00%        ",

    }
]
let gridData72 = [
    {
        "field1": "销售商品、提供劳务收到的现金",
        "field2": "501.86        ",
        "field3": "购买商品、接受劳务支付的现金",
        "field4": "305.32        ",

    },
    {
        "field1": "收到其他与经营活动有关的现金 ",
        "field2": "5.8            ",
        "field3": "支付给职工以及为职工支付的现金",
        "field4": "223.66         ",

    },
    {
        "field1": "收到的税费返还        ",
        "field2": "0              ",
        "field3": "支付的其他与经营活动有关的现金",
        "field4": "151.27         ",

    },
    {
        "field1": "收回投资收到的现金",
        "field2": "0        ",
        "field3": "支付的各项税费  ",
        "field4": "39.77    ",

    } ,   
     {
        "field1": "取得投资收益收到的现金    ",
        "field2": "0              ",
        "field3": "支付的其他与投资活动有关的现金",
        "field4": "5.5            ",

    }   
 
]
let gridData73 = [
    {
        "field1": "现金净流量",
        "field2": "0    ",
        "field3": "    ",
        "field4": "0    ",
        "field5": "    ",
        "field6": "0    ",
        "field7": "    ",
    },
    {
        "field1": "经营现金净流量  ",
        "field2": "4,806.38 ",
        "field3": "        ",
        "field4": "4,690.25",
        "field5": "197.58% ",
        "field6": "9,093.55 ",
        "field7": "293.88% ",
    },
    {
        "field1": "投资现金净流量  ",
        "field2": "1,342.08 ",
        "field3": "        ",
        "field4": "2,016.11",
        "field5": "250.22% ",
        "field6": "409.3    ",
        "field7": "120.30% ",
    },
        {
        "field1": "筹资现金净流量  ",
        "field2": "812.48  ",
        "field3": "        ",
        "field4": "1,738.49",
        "field5": "113.97%  ",
        "field6": "9,000.00",
        "field7": "417.69%  ",
    },
        {
        "field1": "汇率变动对现金的影响",
        "field2": "0         ",
        "field3": "         ",
        "field4": "0         ",
        "field5": "         ",
        "field6": "0         ",
        "field7": "         ",
    }
]
let gridData74 = [
    {
        "field1": "经营活动现金流入流出比（%）",
        "field2": "106.3         ",
        "field3": "95.31         ",
        "field4": "108.52        ",
    },
    {
        "field1": "净现金流量适当比率（%）",
        "field2": "           ",
        "field3": "49.02      ",
        "field4": "113.67      ",
    },
    {
        "field1": "现金流动负债比率（%）",
        "field2": "15.9       ",
        "field3": "19.53     ",
        "field4": "34.22      ",

    },
        {
        "field1": "现金到期债务比（%）",
        "field2": "38.45     ",
        "field3": "         ",
        "field4": "         ",

    },
        {
        "field1": "经营现金偿还期（年）",
        "field2": "6.08      ",
        "field3": "6.23     ",
        "field4": "3.11      ",

    },
        {
        "field1": "现金流动资产比（%）",
        "field2": "37.67     ",
        "field3": "6.24      ",
        "field4": "12.09     ",

    },
        {
        "field1": "现金流动负债比（%）",
        "field2": "27.36     ",
        "field3": "6.65      ",
        "field4": "13.68     ",

    },
        {
        "field1": "经营偿债能力",
        "field2": "1.37  ",
        "field3": "1.12  ",
        "field4": "6.36  ",

    },
        {
        "field1": "债务偿还率（%）",
        "field2": "19.9    ",
        "field3": "12.81   ",
        "field4": "104.6   ",

    }
]
let gridData75 = [
    {
        "field1": "经营活动现金流入流出比（%）",
        "field2": "106.3         ",
        "field3": "95.31         ",
        "field4": "108.52        ",
    },
    {
        "field1": "净现金流量适当比率（%）",
        "field2": "           ",
        "field3": "49.02      ",
        "field4": "113.67      ",
    },
    {
        "field1": "现金流动负债比率（%）",
        "field2": "15.9       ",
        "field3": "19.53     ",
        "field4": "34.22      ",

    },
        {
        "field1": "现金到期债务比（%）",
        "field2": "38.45     ",
        "field3": "         ",
        "field4": "         ",

    },
        {
        "field1": "经营现金偿还期（年）",
        "field2": "6.08      ",
        "field3": "6.23     ",
        "field4": "3.11      ",

    },
        {
        "field1": "现金流动资产比（%）",
        "field2": "37.67     ",
        "field3": "6.24      ",
        "field4": "12.09     ",

    },
        {
        "field1": "现金流动负债比（%）",
        "field2": "27.36     ",
        "field3": "6.65      ",
        "field4": "13.68     ",

    },
        {
        "field1": "经营偿债能力",
        "field2": "1.37  ",
        "field3": "1.12  ",
        "field4": "6.36  ",

    },
        {
        "field1": "债务偿还率（%）",
        "field2": "19.9    ",
        "field3": "12.81   ",
        "field4": "104.6   ",

    }
]

let gridData76 = [
    {
        "field1": "销售收现率（%）",
        "field2": "124.65  ",
        "field3": "114.64  ",
        "field4": "131.34  ",
    },
    {
        "field1": "净收益营运指数",
        "field2": "0.55   ",
        "field3": "0.65   ",
        "field4": "0.52   ",

    }

]
let gridData77 = [
    {
        "field1": "总资产周转天数",
        "field2": "1446.27",
        "field3": "765.12 ",
        "field4": "523.04 ",
    },
    {
        "field1": "固定资产周转天数们",
        "field2": "79.73    ",
        "field3": "79.62    ",
        "field4": "108.08   ",
    },
    {
        "field1": "流动资产周转天数",
        "field2": "1364.01 ",
        "field3": "682.714 ",
        "field4": "411.23  ",

    },
        {
        "field1": "现金周转天数",
        "field2": "415.66",
        "field3": "391.31",
        "field4": "383.06",

    }
]
let gridData78 = [
    {
        "field1": "存货周转天数",
        "field2": "128.63",
        "field3": "121.98",

    },
    {
        "field1": "应收账款周转天数",
        "field2": "21.68   ",
        "field3": "9.06    ",

    },
    {
        "field1": "应付账款周转天数",
        "field2": "311.1   ",
        "field3": "184.72  ",

    },
        {
        "field1": "营业周期  ",
        "field2": "150.31",
        "field3": "131.04",

    }

]
let gridData79 = [
    {
        "field1": "营运资本    ",
        "field2": "1,493.18",
        "field3": "12.75  ",
        "field4": "1,711.33",
        "field5": "210.04  ",
        "field6": "551.96  ",
        "field7": "0       ",
    },
    {
        "field1": "所有者权益   ",
        "field2": "1,575.73",
        "field3": "13.92  ",
        "field4": "1,830.53",
        "field5": "154.57  ",
        "field6": "719.08  ",
        "field7": "0       ",
    },
    {
        "field1": "非流动负债",
        "field2": "0    ",
        "field3": "0    ",
        "field4": "0    ",
        "field5": "100 ",
        "field6": "5.6  ",
        "field7": "0    ",
    },
        {
        "field1": "固定资产  ",
        "field2": "80.42 ",
        "field3": "30.13",
        "field4": "115.1 ",
        "field5": "31.06",
        "field6": "166.96",
        "field7": "0     ",
    },
        {
        "field1": "长期投资",
        "field2": "0   ",
        "field3": "0   ",
        "field4": "0   ",
        "field5": "0   ",
        "field6": "0   ",
        "field7": "0   ",
    }
]
let gridData80 = [
    {
        "field1": "存货    ",
        "field2": "229.16",
        "field3": "2.39 ",
        "field4": "234.76",
        "field5": "23.58 ",
        "field6": "189.96",
        "field7": "0     ",
    },
    {
        "field1": "应收账款  ",
        "field2": "182.62",
        "field3": "0.96 ",
        "field4": "184.4 ",
        "field5": "8.47  ",
        "field6": "169.99",
        "field7": "0     ",
    },
    {
        "field1": "其他应收款 ",
        "field2": "7.83  ",
        "field3": "241.01",
        "field4": "2.3   ",
        "field5": "30.69 ",
        "field6": "1.76  ",
        "field7": "0     ",
    },
        {
        "field1": "预付账款  ",
        "field2": "0.5   ",
        "field3": "27.63",
        "field4": "0.69  ",
        "field5": "81   ",
        "field6": "3.64  ",
        "field7": "0     ",
    },
        {
        "field1": "其他经营性资产",
        "field2": "4.67   ",
        "field3": "0      ",
        "field4": "0      ",
        "field5": "0      ",
        "field6": "0      ",
        "field7": "0      ",
    },
        {
        "field1": "合计    ",
        "field2": "424.78",
        "field3": "0.62  ",
        "field4": "422.14",
        "field5": "15.55 ",
        "field6": "365.35",
        "field7": "0     ",
    }
]
let gridData81 = [
    {
        "field1": "应付账款  ",
        "field2": "18.37 ",
        "field3": "3.77  ",
        "field4": "17.7  ",
        "field5": "42.94",
        "field6": "31.02 ",
        "field7": "0     ",
    },                  
    {
        "field1": "其他应付款 ",
        "field2": "9.88  ",
        "field3": "6.42  ",
        "field4": "9.29  ",
        "field5": "12.49",
        "field6": "10.61 ",
        "field7": "0     ",
    },
    {
        "field1": "预收货款  ",
        "field2": "27.22 ",
        "field3": "399.05",
        "field4": "5.46  ",
        "field5": "49.76",
        "field6": "10.86 ",
        "field7": "0     ",
    },
        {
        "field1": "应付职工薪酬",
        "field2": "0.72  ",
        "field3": "0     ",
        "field4": "0.72  ",
        "field5": "232.87",
        "field6": "0.22  ",
        "field7": "0     ",
    },
        {
        "field1": "应付股利",
        "field2": "0   ",
        "field3": "0   ",
        "field4": "0   ",
        "field5": "0   ",
        "field6": "0   ",
        "field7": "0   ",
    },
        {
        "field1": "应交税金  ",
        "field2": "12.55 ",
        "field3": "67.66",
        "field4": "38.81 ",
        "field5": "26.84 ",
        "field6": "30.6  ",
        "field7": "0     ",
    },
        {
        "field1": "其他经营性负债",
        "field2": "0      ",
        "field3": "0      ",
        "field4": "0      ",
        "field5": "0      ",
        "field6": "0      ",
        "field7": "0      ",
    },
        {
        "field1": "合计    ",
        "field2": "68.74 ",
        "field3": "4.49 ",
        "field4": "71.97 ",
        "field5": "13.61",
        "field6": "83.3  ",
        "field7": "0     ",
    }
]
let gridData82 = [                              
    {                                           
        "field1": "盈亏平衡点",                     
        "field2": "3,101.56",                     
        "field3": "415.98 ",                     
        "field4": "601.11 ",                     
        "field5": "1.43",                     
        "field6": "592.65", 
        "field7": "0     ",                     
    },                                       
    {                                           
        "field1": "营业安全率",                     
        "field2": "-6.03 ",                     
        "field3": "-10,610.16",                     
        "field4": "0.06",                     
        "field5": "0.06",                     
        "field6": "-0.07 ",                     
        "field7": "0     ",                     
    },                                          
    {                                           
        "field1": "经营风险系数",                     
        "field2": "-0.13",                     
        "field3": "-102.12",                     
        "field4": "6.18 ",                     
        "field5": "49.76",                     
        "field6": "220.47",                     
        "field7": "0     ",                     
    },                                          
        {                                       
        "field1": "财务风险系数",                     
        "field2": "0.98",                     
        "field3": "-6.54",                     
        "field4": "1.05",                     
        "field5": "13.85",                     
        "field6": "0.92",                     
        "field7": "0     ",                     
    },                                                                                   
]                                               
let gridData83 = [
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    }
]
let gridData84 = [
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    },
    {
        "field1": "",
        "field2": "",
        "field3": "",
        "field4": "",
        "field5": "",
        "field6": "",
        "field7": "",
        "field8": "",
    }
]
let chartData2 = {
    columns: ['日期', '营业成本', '存货', '应收账款'],
    rows: [{
            '日期': '2015',
            '营业成本': 43004.09,
            '存货': 59097.34,
            '应收账款': 23334
        },
        {
            '日期': '2016',
            '营业成本': 57702.71,
            '存货': 102230.74,
            '应收账款': 23443
        },
        {
            '日期': '2017',
            '营业成本': 414744.01,
            '存货': 503515.35,
            '应收账款': 23433
        },
    ]
}
let chartData3 = {
    columns: ["日期", "经营活动现金净流量", "现金及现金等价物净增加额", "应收账款"],
    rows: [{
            "日期": "2015年",
            "经营活动现金净流量": -201376.3,
            "现金及现金等价物净增加额": -371880.37,
            "应收账款": -665325
        },
        {
            "日期": "2016年",
            "经营活动现金净流量": 25490.76,
            "现金及现金等价物净增加额": -83132.57,
            "应收账款": -14665
        },
        {
            '日期': '2017年',
            '经营活动现金净流量': 414744.01,
            '现金及现金等价物净增加额': 503515.35,
            "应收账款": 451155
        },
    ]
}
let chartData4 = {
    columns: ["日期", "销售收入", "应收账款", "实现利润", "营业利润", "净利润"],
    rows: [{
            "日期": "2015年",
            "销售收入": 3833468.97,
            "应收账款": 5382058.75,
            "实现利润": 5963542.03,
            "营业利润": 690304.31,
            "净利润": 616811.83
        },
        {
            "日期": "2016年",
            "销售收入": 717747.73,
            "应收账款": 950077.53,
            "实现利润": 1891031.77,
            "营业利润": 498709.13,
            "净利润": 1287779.82
        },
        {
            "日期": "2017年",
            "销售收入": 694856.10,
            "应收账款": 897551.78,
            "实现利润": 1279908.03,
            "营业利润": 881827.50,
            "净利润": 880657.10
        },
    ]
}
let chartData5 = {
    columns: ["日期", "应收账款", "营业利润", "存货/主营业务收入", "主营业务成本/主营业务收入"],
    rows: [{
            "日期": "2015年",
            "应收账款": 11231,
            "营业利润": 43004.09,
            "存货/主营业务收入": 59,
            "主营业务成本/主营业务收入": 55
        },
        {
            "日期": "2016年",
            "应收账款": 22323,
            "营业利润": 57702.71,
            "存货/主营业务收入": 10,
            "主营业务成本/主营业务收入": 42
        },
        {
            "日期": "2017年",
            "应收账款": 32433,
            "营业利润": 414744.01,
            "存货/主营业务收入": 50,
            "主营业务成本/主营业务收入": 55
        },
    ]
}
let chartData6 = {
    columns: ["日期", "存货", "营业利润", "存货/主营业务收入", "主营业务成本/主营业务收入"],
    rows: [{
            "日期": "2015年",
            "存货": 43004.09,
            "营业利润": 59097.34,
            "存货/主营业务收入": 66,
            "主营业务成本/主营业务收入": 67
        },
        {
            "日期": "2016年",
            "存货": 57702.71,
            "营业利润": 102230.74,
            "存货/主营业务收入": 15,
            "主营业务成本/主营业务收入": 21
        },
        {
            "日期": "2017年",
            "存货": 414744.01,
            "营业利润": 503515.35,
            "存货/主营业务收入": 30,
            "主营业务成本/主营业务收入": 33
        },
    ]
}
let chartData7 = {
    columns: ["日期", "应收账款/营业收入", "应付账款/营业收入", "营业利润/营业收入", "应收账款增加额/营业收入"],
    rows: [{
            "日期": "2015年",
            "应收账款/营业收入": 43004.09,
            "应付账款/营业收入": 59097.34,
            "营业利润/营业收入": 43004.09,
            "应收账款增加额/营业收入": 43004.09
        },
        {
            "日期": "2016年",
            "应收账款/营业收入": 57702.71,
            "应付账款/营业收入": 102230.74,
            "营业利润/营业收入": 43004.09,
            "应收账款增加额/营业收入": 43004.09
        },
        {
            "日期": "2017年",
            "应收账款/营业收入": 414744.01,
            "应付账款/营业收入": 503515.35,
            "营业利润/营业收入": 43004.09,
            "应收账款增加额/营业收入": 43004.09
        },
    ]
}
let chartData8 = {
    columns: ["日期", "预付账款", "营业成本", "营业收入", "毛利"],
    rows: [{
            "日期": "2015年",
            "预付账款": 43004.09,
            "营业成本": 59097.34,
            "营业收入": 56004.09,
            "毛利": 12004.09
        },
        {
            "日期": "2016年",
            "预付账款": 57702.71,
            "营业成本": 102230.74,
            "营业收入": 43504.09,
            "毛利": 23004.09
        },
        {
            "日期": "2017年",
            "预付账款": 414744.01,
            "营业成本": 503515.35,
            "营业收入": 67004.09,
            "毛利": 67004.09
        },
    ]
}
let chartData9 = {
    columns: ["日期", "应收账款", "营业收入", "营业利润"],
    rows: [{
            "日期": "2015年",
            "应收账款": 43004.09,
            "营业收入": 59097.34,
            "营业利润": 549848
        },
        {
            "日期": "2016年",
            "应收账款": 57702.71,
            "营业收入": 102230.74,
            "营业利润": 42527
        },
        {
            "日期": "2017年",
            "应收账款": 414744.01,
            "营业收入": 503515.35,
            "营业利润": 17757
        },
    ]
}
let chartData21 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "营运资本",
            "2015年": "-3324.93",
            "2016年": "2159.04",
            "2017年": "4721.08"
        },
        {
            "日期": "非流动负债",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "所有者权益",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "非流动资产",
            "2015年": "66682.30",
            "2016年": "63140.06",
            "2017年": "57791.19"
        }

    ]
}
let chartData22 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "营运资金需求",
            "2015年": 43004.09,
            "2016年": 59097.34,
            "2017年": 549848
        },
        {
            "日期": "营业收入",
            "2015年": 57702.71,
            "2016年": 102230.74,
            "2017年": 42527
        },

    ]
}
let chartData23 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "现金支付能力",
            "2015年": 43004.09,
            "2016年": 59097.34,
            "2017年": 549848
        },

    ]
}
let chartData24 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "现金支付能力",
            "2015年": "-3324.93",
            "2016年": "2159.04",
            "2017年": "4721.08"
        },
        {
            "日期": "运营资金需求",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "营运资本",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },

    ]
}
let chartData25 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "负债总额",
            "2015年": "-3324.93",
            "2016年": "2159.04",
            "2017年": "4721.08"
        },
        {
            "日期": "有息负债",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },

    ]
}

let chartData26 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "短期有息负债",
            "2015年": "-3324.93",
            "2016年": "2159.04",
            "2017年": "4721.08"
        },
        {
            "日期": "短期借款",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "交易性有息负债",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "应收利息",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "年内到期的非流动负债",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "长期有息负债",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "长期借款",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "应付债券",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },

    ]
}
let chartData27 = {
    columns: ["日期", "短期有息负债", "长期有息负债", "长短期有息负债比值"],
    rows: [{
            "日期": "2015年",
            "短期有息负债": "-3324.93",
            "长期有息负债": "2159.04",
            "长短期有息负债比值": "4721.08"
        },
        {
            "日期": "2016年",
            "短期有息负债": "12000.00",
            "长期有息负债": "8000.00",
            "长短期有息负债比值": "4000.00"
        },
        {
            "日期": "2017年",
            "短期有息负债": "51357.37",
            "长期有息负债": "57299.10",
            "长短期有息负债比值": "54262.27"
        },


    ]
}
let chartData28 = {
    columns: ["日期", "负债总额", "有息负债", "负债及股东权益"],
    rows: [{
            "日期": "2015年",
            "负债总额": "-3324.93",
            "有息负债": "2159.04",
            "负债及股东权益": "4721.08"
        },
        {
            "日期": "2016年",
            "负债总额": "12000.00",
            "有息负债": "8000.00",
            "负债及股东权益": "4000.00"
        },
        {
            "日期": "2017年",
            "负债总额": "51357.37",
            "有息负债": "57299.10",
            "负债及股东权益": "54262.27"
        },
    ]
}
let chartData29 = {
    columns: ["日期", "未分配利润", "短期有息负债"],
    rows: [{
            "日期": "2015年",
            "未分配利润": "-3324.93",
            "短期有息负债": "2159.04",
        },
        {
            "日期": "2016年",
            "未分配利润": "12000.00",
            "短期有息负债": "8000.00",
        },
        {
            "日期": "2017年",
            "未分配利润": "51357.37",
            "短期有息负债": "57299.10",
        },
    ]
}
let chartData30 = {
    columns: ["日期", "未分配利润", "有息负债"],
    rows: [{
            "日期": "2015年",
            "未分配利润": "-3324.93",
            "有息负债": "2159.04",
        },
        {
            "日期": "2016年",
            "未分配利润": "12000.00",
            "有息负债": "8000.00",
        },
        {
            "日期": "2017年",
            "未分配利润": "51357.37",
            "有息负债": "57299.10",
        },

    ]
}
let chartData31 = {
    columns: ["日期", "未分配利润", "EBIT", "营业利润", "经营活动净现金流"],
    rows: [{
            "日期": "2015年",
            "未分配利润": "-3324.93",
            "EBIT": "2159.04",
            "营业利润": "2159.04",
            "经营活动净现金流": "2159.04"
        },
        {
            "日期": "2016年",
            "未分配利润": "12000.00",
            "EBIT": "8000.00",
            "营业利润": "2159.04",
            "经营活动净现金流": "2159.04"
        },
        {
            "日期": "2017年",
            "未分配利润": "51357.37",
            "EBIT": "57299.10",
            "营业利润": "2159.04",
            "经营活动净现金流": "2159.04"
        },

    ]
}
let chartData32 = {
    columns: ["日期", "金融投资", "长期经营性资产投资", "对外投资总额"],
    rows: [{
            "日期": "2015年",
            "金融投资": "-3324.93",
            "长期经营性资产投资": "2159.04",
            "对外投资总额": "4721.08"
        },
        {
            "日期": "2016年",
            "金融投资": "12000.00",
            "长期经营性资产投资": "8000.00",
            "对外投资总额": "4000.00"
        },
        {
            "日期": "2017年",
            "金融投资": "51357.37",
            "长期经营性资产投资": "57299.10",
            "对外投资总额": "54262.27"
        },

    ]
}
let chartData33 = {
    columns: ["日期", "金融产品投资", "长期股权投资", "投资性房地产"],
    rows: [{
            "日期": "2015年",
            "金融产品投资": "-3324.93",
            "长期股权投资": "2159.04",
            "投资性房地产": "4721.08"
        },
        {
            "日期": "2016年",
            "金融产品投资": "12000.00",
            "长期股权投资": "8000.00",
            "投资性房地产": "4000.00"
        },
        {
            "日期": "2017年",
            "金融产品投资": "51357.37",
            "长期股权投资": "57299.10",
            "投资性房地产": "54262.27"
        },

    ]
}
let chartData34 = {
    columns: ["日期", "投资收益", "内部经营资产收益率", "投资收益率", ],
    rows: [{
            "日期": "2015年",
            "投资收益": "-3324.93",
            "内部经营资产收益率": "2159.04",
            "投资收益率": "4721.08"
        },
        {
            "日期": "2016年",
            "投资收益": "12000.00",
            "内部经营资产收益率": "8000.00",
            "投资收益率": "4000.00"
        },
        {
            "日期": "2017年",
            "投资收益": "51357.37",
            "内部经营资产收益率": "57299.10",
            "投资收益率": "54262.27"
        },
    ]
}
let chartData35 = {
    columns: ["日期", "净利润", "EBIT", "投资收益", "经营性资产总额增长率", "经营性资产报酬率"],
    rows: [{
            "日期": "2015年",
            "净利润": "-3324.93",
            "EBIT": "2159.04",
            "投资收益": "4721.08",
            "经营性资产总额增长率": "54.04",
            "经营性资产报酬率": "23.04"
        },
        {
            "日期": "2016年",
            "净利润": "12000.00",
            "EBIT": "8000.00",
            "投资收益": "4000.00",
            "经营性资产总额增长率": "21.04",
            "经营性资产报酬率": "12.04"
        },


    ]
}
let chartData36 = {
    columns: ["日期", "2015年", "2016年", "2017年"],
    rows: [{
            "日期": "应收票据",
            "2015年": "-3324.93",
            "2016年": "2159.04",
            "2017年": "4721.08"
        },
        {
            "日期": "应收账款",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "预付款项",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "应收利息",
            "2015年": "12000.00",
            "2016年": "8000.00",
            "2017年": "4000.00"
        },
        {
            "日期": "应收股利",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },
        {
            "日期": "其他应收款",
            "2015年": "51357.37",
            "2016年": "57299.10",
            "2017年": "54262.27"
        },

    ]
}
let chartData37 = {
    columns: ["日期", "应收账款周转率", "存货周转率", "营业收入增长率"],
    rows: [{
            "日期": "2015年",
            "应收账款周转率": "-3324.93",
            "存货周转率": "2159.04",
            "营业收入增长率": "4721.08"
        },
        {
            "日期": "2016年",
            "应收账款周转率": "12000.00",
            "存货周转率": "8000.00",
            "营业收入增长率": "4000.00"
        },

    ]
}
let chartData38 = {
    columns: ["日期", "销售商品、提供劳务收到的现金", "营业收入", "营业收入的收现能力"],
    rows: [{
            "日期": "2015年",
            "销售商品、提供劳务收到的现金": "-3324.93",
            "营业收入": "2159.04",
            "营业收入的收现能力": "4721.08"
        },
        {
            "日期": "2016年",
            "销售商品、提供劳务收到的现金": "12000.00",
            "营业收入": "8000.00",
            "营业收入的收现能力": "4000.00"
        },
        {
            "日期": "2017年",
            "销售商品、提供劳务收到的现金": "51357.37",
            "营业收入": "57299.10",
            "营业收入的收现能力": "54262.27"
        },

    ]
}
let chartData39 = {
    columns: ["日期", "应收利息", "应收账款", "其他应收款", "预付款项", "存货", "其他流动资产"],
    rows: [{
            "日期": "2015年",
            "应收利息": "-3324.93",
            "应收账款": "2159.04",
            "其他应收款": "4721.08",
            "预付款项": "8000.00",
            "存货": "8000.00",
            "其他流动资产": "8000.00"
        },
        {
            "日期": "2016年",
            "应收利息": "12000.00",
            "应收账款": "8000.00",
            "其他应收款": "4000.00",
            "预付款项": "8000.00",
            "存货": "8000.00",
            "其他流动资产": "8000.00"
        },
        {
            "日期": "2017年",
            "应收利息": "51357.37",
            "应收账款": "57299.10",
            "其他应收款": "54262.27",
            "预付款项": "8000.00",
            "存货": "8000.00",
            "其他流动资产": "8000.00"
        },
    ]
}
let chartData40 = {
    columns: ["日期", "应付账款", "应付账款", "应付职工薪酬", "应付股利", "应交税费", "其他应付款", "应付利息", "年内到期的非流动负债"],
    rows: [{
            "日期": "2015年",
            "应付账款": "-3324.93",
            "应付账款": "2159.04",
            "应付职工薪酬": "4721.08",
            "应付股利": "4000.00",
            "应交税费": "4000.00",
            "其他应付款": "4000.00",
            "应付利息": "4000.00",
            "年内到期的非流动负债": "4000.00"
        },
        {
            "日期": "2016年",
            "应付账款": "1200.00",
            "应付账款": "8000.00",
            "应付职工薪酬": "4000.00",
            "应付股利": "4000.00",
            "应交税费": "4000.00",
            "其他应付款": "4000.00",
            "应付利息": "4000.00",
            "年内到期的非流动负债": "4000.00"
        },
        {
            "日期": "2017年",
            "应付账款": "5135.37",
            "应付账款": "5729.10",
            "应付职工薪酬": "5426.27",
            "应付股利": "4000.00",
            "应交税费": "4000.00",
            "其他应付款": "4000.00",
            "应付利息": "4000.00",
            "年内到期的非流动负债": "4000.00"
        },

    ]
}
let chartData41 = {
    columns: ["日期", "应收账款", "应收票据"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45",
            "应收票据": "9850000.00",
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22",
            "应收票据": "11190000.00",
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66",
            "应收票据": "4374047.00",
        },

    ]
}
let chartData42 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData43 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "90297045.45"
        },
        {
            "日期": "2016年",
            "应收账款": "82166783.85"
        },
        {
            "日期": "2017年",
            "应收账款": "8130261.38"
        },

    ]
}
let chartData44 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "-24.46"
        },
        {
            "日期": "2016年",
            "应收账款": "13.98"
        },
        {
            "日期": "2017年",
            "应收账款": "17.26"
        },

    ]
}
let chartData45 = {
    columns: ["日期", "应收利息"],
    rows: [{
            "日期": "流动资产",
            "应收利息": "31.88",
        },
        {
            "日期": "固定资产",
            "应收利息": "30.79",
        },
        {
            "日期": "无形及递延资产类",
            "应收利息": "2.24",
        },
        {
            "日期": "长期投资类",
            "应收利息": "35.08",
        },
        {
            "日期": "其他类",
            "应收利息": "0.00",
        },
    ]
}
let chartData46 = {
    columns: ["日期", "流动资产", "固定资产类", "无形及递延资产类", "长期投资类", "其他类"],
    rows: [{
            "日期": "2015年",
            "流动资产": "26896.76",
            "固定资产类": "35139.56",
            "无形及递延资产类":"2012.74",
            "长期投资类":"29530.00",
            "其他类":"0.00"
        },
        {
            "日期": "2016年",
            "流动资产": "89310.96",
            "固定资产类": "26170.90",
            "无形及递延资产类":"31654.90",
            "长期投资类":"1955.16",
            "其他类":"0.00"
        },
        {
            "日期": "2017年",
            "流动资产": "27048.45",
            "固定资产类": "26120.95",
            "无形及递延资产类":"1904.51",
            "长期投资类":"29765.73",
            "其他类":"0.00"
        },

    ]
}
let chartData47 = {
    columns: ["日期", "应收利息"],
    rows: [{
            "日期": "货币资金",
            "应收利息": "2.28",
        },
        {
            "日期": "应收票据",
            "应收利息": "0.00",
        },
        {
            "日期": "存货",
            "应收利息": "71.07",
        },
        {
            "日期": "应收账款",
            "应收利息": "19.49",
        },
        {
            "日期": "其他",
            "应收利息": "7.16",
        },
    ]
}
let chartData48 = {
    columns: ["日期", "货币资金","应收票据","存货","应收账款","其他"],
    rows: [{
            "日期": "2015年",
            "货币资金": "8,559.52",
            "应收票据":"0.00",
            "存货":"17,597.02",
            "应收账款":"723.47",
            "其他":"16.75"
        },
        {
            "日期": "2016年",
            "货币资金": "26,170.90",
            "应收票据":"114.67",
            "存货":"23,381.43",
            "应收账款":"2,633.00",
            "其他":"32.80"
        },
        {
            "日期": "2017年",
            "货币资金": "617.52",
            "应收票据":"0.00",
            "存货":"19,224.45",
            "应收账款":"5,270.82",
            "其他":"1,935.66"
        },

    ]
}
let chartData49 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "807.99"
        },
        {
            "日期": "2016年",
            "应收账款": "1902.5"
        },
        {
            "日期": "2017年",
            "应收账款": "1644.47"
        },

    ]
}
let chartData50 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "166.96"
        },
        {
            "日期": "2016年",
            "应收账款": "115.1"
        },
        {
            "日期": "2017年",
            "应收账款": "80.42"
        },

    ]
}
let chartData51 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "34.16"
        },
        {
            "日期": "2016年",
            "应收账款": "36.82"
        },
        {
            "日期": "2017年",
            "应收账款": "51.91"
        },

    ]
}
let chartData52 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "30.57"
        },
        {
            "日期": "2016年",
            "应收账款": "28.92"
        },
        {
            "日期": "2017年",
            "应收账款": "41.37"
        },

    ]
}
let chartData53 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "0.32"
        },
        {
            "日期": "2016年",
            "应收账款": "0.36"
        },
        {
            "日期": "2017年",
            "应收账款": "1.77"
        },

    ]
}
let chartData54 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "流动负债",
            "应收账款": "31.33"
        },
        {
            "日期": "非流动负债",
            "应收账款": "4.71"
        },
        {
            "日期": "所有者权益",
            "应收账款": "63.96"
        },

    ]
}
let chartData55 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "短期借款",
            "应收账款": "79.27"
        },
        {
            "日期": "应付账款",
            "应收账款": "3.97"
        },
        {
            "日期": "应交税费",
            "应收账款": "1.52"
        },
        {
            "日期": "预收款项",
            "应收账款": "0.98"
        },

        {
            "日期": "其他类",
            "应收账款": "1.17"
        },

        {
            "日期": "非流动负债",
            "应收账款": "13.08"
        },


    ]
}
let chartData56 = {
    columns: ["日期", ""],
    rows: [{
            "日期": "短期有息负债",
            "": "79.27"
        },
        {
            "日期": "长期有息负债",
            "": "13.08"
        },
        {
            "日期": "其他负债",
            "": "7.64"
        },

    ]
}
let chartData57 = {
    columns: ["日期", "短期借款","应付账款","应交税费","预收款项","其他类","非流动负债"],
    rows: [{
            "日期": "2015年",
            "短期借款": "17210.00",
            "应付账款":"178.87",
            "应交税费":"122.30",
            "预收款项":"0.00",
            "其他类":"12000.00",
            "非流动负债":"12000.00",
        },
        {
            "日期": "2016年",
            "短期借款": "12000.00",
            "应付账款":"736.56",
            "应交税费":"552.77",
            "预收款项":"347.03",
            "其他类":"",
            "非流动负债":"8000.00",
        },
        {
            "日期": "2017年",
            "短期借款": "24240.00",
            "应付账款":"1214.72",
            "应交税费":"463.57",
            "预收款项":"299.91",
            "其他类":"4000.00",
            "非流动负债":"4000.00",
        },

    ]
}
let chartData58 = {
    columns: ["日期", "短期有息负债","长期有息负债","其他负债"],
    rows: [{
            "日期": "2015年",
            "短期有息负债":"17210.00",
            "长期有息负债":"12000.00",
            "其他负债":"13011.68"
        },
        {
            "日期": "2016年",
            "短期有息负债":"21240.00",
            "长期有息负债":"8000.00",
            "其他负债":"2771.86"
        },
        {
            "日期": "2017年",
            "短期有息负债":"24240.00",
            "长期有息负债":"4000.00",
            "其他负债":"2337.37"
        },

    ]
}
let chartData59 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "实收资本",
            "应收账款": "15.66"
        },
        {
            "日期": "资本公积",
            "应收账款": "0.00"
        },
        {
            "日期": "盈余公积",
            "应收账款": "0.00"
        },
        {
            "日期": "未分配利润",
            "应收账款": "84.34"
        },
     
    ]
}
let chartData60 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "89"
        },
        {
            "日期": "2016年",
            "应收账款": "108.99"
        },
        {
            "日期": "2017年",
            "应收账款": "101.77"
        },

    ]
}
let chartData61 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "30.77"
        },
        {
            "日期": "2016年",
            "应收账款": "11.62"
        },
        {
            "日期": "2017年",
            "应收账款": "29.44"
        },

    ]
}
let chartData62 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "28.32"
        },
        {
            "日期": "2016年",
            "应收账款": "0.48"
        },
        {
            "日期": "2017年",
            "应收账款": "2.32"
        },

    ]
}
let chartData63 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "45.12"
        },
        {
            "日期": "2016年",
            "应收账款": "35.84"
        },
        {
            "日期": "2017年",
            "应收账款": "36.04"
        },

    ]
}
let chartData64 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "11"
        },
        {
            "日期": "2016年",
            "应收账款": "3.78"
        },
        {
            "日期": "2017年",
            "应收账款": "4.18"
        },

    ]
}
let chartData65 = {
    columns: ["日期", "利润总额","核心利润","投资收益","营业外利润"],
    rows: [{
            "日期": "2015年",
            "利润总额":"5622.69",
            "核心利润":"193.35",
            "投资收益":"492.08",
            "营业外利润":"-15.60"
        },
        {
            "日期": "2016年",
            "利润总额":"7060.55",
            "核心利润":"471.97",
            "投资收益":"173.57",
            "营业外利润":"-35.62"
        },
        {
            "日期": "2017年",
            "利润总额":"5596.13",
            "核心利润":"372.61",
            "投资收益":"409.30",
            "营业外利润":"95.41"
        },

    ]
}
let chartData66 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "193"
        },
        {
            "日期": "2016年",
            "应收账款": "472"
        },
        {
            "日期": "2017年",
            "应收账款": "373"
        },

    ]
}
let chartData67 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "-15.55"
        },
        {
            "日期": "2016年",
            "应收账款": "14.31"
        },
        {
            "日期": "2017年",
            "应收账款": "-255.83"
        },

    ]
}
let chartData68 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "492"
        },
        {
            "日期": "2016年",
            "应收账款": "174"
        },
        {
            "日期": "2017年",
            "应收账款": "409"
        },

    ]
}
let chartData69 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "-16"
        },
        {
            "日期": "2016年",
            "应收账款": "-36"
        },
        {
            "日期": "2017年",
            "应收账款": "95"
        },

    ]
}
let chartData70 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "营业成本",
            "应收账款": "91.37"
        },
        {
            "日期": "营业税金及附加",
            "应收账款": "0.91"
        },
        {
            "日期": "销售费用",
            "应收账款": "3.43"
        },
        {
            "日期": "管理费用",
            "应收账款": "1.58"
        },
        {
            "日期": "财务费用",
            "应收账款": "2.71"
        },

    ]
}
let chartData71 = {
    columns: ["日期", "营业成本","营业税金及附加","销售费用","管理费用","财务费用"],
    rows: [{
            "日期": "2015年",
            "营业成本":"56568.37",
            "营业税金及附加":"259.86",
            "销售费用":"1540.09" ,
           "管理费用":"862.70",
            "财务费用":"1622.48"
        },
        {
            "日期": "2016年",
            "营业成本":"60,469.18",
            "营业税金及附加":"343.27",
            "销售费用":"2491.92" ,
           "管理费用":"1165.02",
            "财务费用":"1740.60"
        },
        {
            "日期": "2017年",
            "营业成本":"59623.09",
            "营业税金及附加":"593.72",
            "销售费用":"2236.41" ,
           "管理费用":"1033.86",
            "财务费用":"1770.17"
        },

    ]
}
let chartData72 = {
    columns: ["日期", "营业成本","营业收入"],
    rows: [{
            "日期": "2015年",
            "营业成本": "56568",
            "营业收入": "61047"
        },
        {
            "日期": "2016年",
            "营业成本": "60469",
            "营业收入": "66682"
        },
        {
            "日期": "2017年",
            "营业成本": "59623",
            "营业收入": "65630"
        },

    ]
}
let chartData73 = {
    columns: ["日期", "销售费用","营业收入"],
    rows: [{
            "日期": "2015年",
            "销售费用": "1540",
            "营业收入": "61047"
        },
        {
            "日期": "2016年",
            "销售费用": "2492",
            "营业收入": "66682"
        },
        {
            "日期": "2017年",
            "销售费用": "2236",
            "营业收入": "65630"
        },

    ]
}
let chartData74 = {
    columns: ["日期", "管理费用","营业收入","核心利润"],
    rows: [{
            "日期": "2015年",
            "管理费用": "1540",
            "营业收入": "61047",
            "核心利润":"2344"
        },
        {
            "日期": "2016年",
            "管理费用": "2492",
            "营业收入": "66682",
            "核心利润":"2344"
        },
        {
            "日期": "2017年",
            "管理费用": "2236",
            "营业收入": "65630",
            "核心利润":"2344"
        },

    ]
}
let chartData75 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData76 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "-2.8"
        },
        {
            "日期": "2016年",
            "应收账款": "2.24"
        },
        {
            "日期": "2017年",
            "应收账款": "-57.95"
        },

    ]
}
let chartData77 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "5.05"
        },
        {
            "日期": "2016年",
            "应收账款": "2.83"
        },
        {
            "日期": "2017年",
            "应收账款": "-14.96"
        },

    ]
}
let chartData78 = {
    columns: ["日期", "销售毛利率","销售利润率","销售净利率"],
    rows: [{
            "日期": "2015年",
            "销售毛利率": "7.83",
            "销售利润率": "7.34",
            "销售净利率": "0.32"
        },
        {
            "日期": "2016年",
            "销售毛利率": "9",
            "销售利润率": "9.32",
            "销售净利率": "0.89"
        },
        {
            "日期": "2017年",
            "销售毛利率": "9.15",
            "销售利润率": "7.25",
            "销售净利率": "0.58"
        },

    ]
}
let chartData79 = {
    columns: ["日期", "利润总额","成本费用总额","成本费用利润率"],
    rows: [{
            "日期": "2015年",
            "利润总额":"6000",
            "成本费用总额":"5000",
            "成本费用利润率":"9.2"
        },
        {
            "日期": "2016年",
            "利润总额":"2000",
            "成本费用总额":"6000",
            "成本费用利润率":"10.66"
        },
        {
            "日期": "2017年",
            "利润总额":"2000",
            "成本费用总额":"7000",
            "成本费用利润率":"6.54"
        },

    ]
}
let chartData80 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "经营活动现金流入小计",
            "应收账款": "82.46"
        },
        {
            "日期": "投资活动现金流入小计",
            "应收账款": "0.29"
        },
        {
            "日期": "筹集活动现金流入小计",
            "应收账款": "17.25"
        },

    ]
}
let chartData81 = {
    columns: ["日期", "经营活动现金流入小计","投资活动现金流入小计","筹集活动现金流入小计"],
    rows: [{
            "日期": "2015年",
            "经营活动现金流入小计": "182397263.45",
            "投资活动现金流入小计":"",
            "筹集活动现金流入小计":""
        },
        {
            "日期": "2016年",
            "经营活动现金流入小计": "106044203.22",
            "投资活动现金流入小计":"234234234",
            "筹集活动现金流入小计":"4564645645"
        },
        {
            "日期": "2017年",
            "经营活动现金流入小计": "52688301.66",
            "投资活动现金流入小计":"234234",
            "筹集活动现金流入小计":"45345345"
        },

    ]
}
let chartData82 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "经营活动现金流入小计",
            "应收账款": "76.26"
        },
        {
            "日期": "投资活动现金流入小计",
            "应收账款": "23.74"
        },
        {
            "日期": "筹集活动现金流入小计",
            "应收账款": "0.00"
        },

    ]
}
let chartData83 = {
    columns: ["日期", "经营活动现金流入小计","投资活动现金流入小计","筹集活动现金流入小计"],
    rows: [{
            "日期": "2015年",
            "经营活动现金流入小计": "182397263.45",
            "投资活动现金流入小计":"",
            "筹集活动现金流入小计":""
        },
        {
            "日期": "2016年",
            "经营活动现金流入小计": "106044203.22",
            "投资活动现金流入小计":"234234234",
            "筹集活动现金流入小计":"4564645645"
        },
        {
            "日期": "2017年",
            "经营活动现金流入小计": "52688301.66",
            "投资活动现金流入小计":"234234",
            "筹集活动现金流入小计":"45345345"
        },

    ]
}
let chartData84 = {
    columns: ["日期", "现金净流量","经营现金净流量","投资现金净流量","筹集现金净流量","汇率变动对现金的影响"],
    rows: [{
            "日期": "2015年",
            "现金净流量": "0.00",
            "经营现金净流量":"4,806.38",
            "投资现金净流量":"1,342.08",
            "筹集现金净流量":"-812.48",
            "汇率变动对现金的影响":"0.00"
        },
        {
            "日期": "2016年",
            "现金净流量": "0.00",
            "经营现金净流量":"-4,690.25",
            "投资现金净流量":"-2,016.11",
            "筹集现金净流量":"-1,738.49",
            "汇率变动对现金的影响":"0.00"
        },
        {
            "日期": "2017年",
            "现金净流量": "0.00",
            "经营现金净流量":"234234",
            "投资现金净流量":"409.30",
            "筹集现金净流量":"-9,000.00",
            "汇率变动对现金的影响":"-9,000.00"
        },

    ]
}
let chartData85 = {
    columns: ["日期", "应收账款"],
    rows: [
        {
            "日期": "2016年",
            "应收账款": "0.73"
        },
        {
            "日期": "2017年",
            "应收账款": "0.75"
        },

    ]
}
let chartData86 = {
    columns: ["日期", "应收账款"],
    rows: [
        {
            "日期": "2016年",
            "应收账款": "2.51"
        },
        {
            "日期": "2017年",
            "应收账款": "2.47"
        },

    ]
}
let chartData87 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "467.21"
        },
        {
            "日期": "2016年",
            "应收账款": "682.71"
        },
        {
            "日期": "2017年",
            "应收账款": "1364.01"
        },

    ]
}
let chartData88 = {
    columns: ["日期", "应收账款"],
    rows: [
        {
            "日期": "2016年",
            "应收账款": "2"
        },
        {
            "日期": "2017年",
            "应收账款": "2.28"
        },

    ]
}
let chartData89 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "232.62"
        },
        {
            "日期": "2016年",
            "应收账款": "46.47"
        },
        {
            "日期": "2017年",
            "应收账款": "123.56"
        },

    ]
}
let chartData90 = {
    columns: ["日期", "应收账款"],
    rows: [
        {
            "日期": "2016年",
            "应收账款": "121.98"
        },
        {
            "日期": "2017年",
            "应收账款": "128.63"
        },

    ]
}
let chartData91 = {
    columns: ["日期", "应收账款"],
    rows: [
        {
            "日期": "2016年",
            "应收账款": "9.06"
        },
        {
            "日期": "2017年",
            "应收账款": "21.68"
        },

    ]
}
let chartData92 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData93 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData94 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData95 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData96 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData97 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData98 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData99 = {
    columns: ["日期", "应收账款"],
    rows: [{
            "日期": "2015年",
            "应收账款": "182397263.45"
        },
        {
            "日期": "2016年",
            "应收账款": "106044203.22"
        },
        {
            "日期": "2017年",
            "应收账款": "52688301.66"
        },

    ]
}
let chartData100 = {
    columns: ["日期", "权益报酬率","总资产收益率","权益乘数"],
    rows: [{
            "日期": "2015年",
            "权益报酬率": "18.61",
            "总资产收益率":"10.21",
            "权益乘数":"1.82"
        },
        {
            "日期": "2016年",
            "权益报酬率": "11.05",
            "总资产收益率":"6.56",
            "权益乘数":"1.56"
        },
        {
            "日期": "2017年",
            "权益报酬率": "8.53",
            "总资产收益率":"5.46",
            "权益乘数":"1.56"
        },

    ]
}
let chartData101 = {
    columns: ["日期", "总资产收益率","销售净利率","总资产周转率"],
    rows: [{
            "日期": "2015年",
            "总资产收益率": "18.61",
            "销售净利率":"10.21",
            "总资产周转率":"1.82"
        },
        {
            "日期": "2016年",
            "总资产收益率": "11.05",
            "销售净利率":"6.56",
            "总资产周转率":"1.56"
        },
        {
            "日期": "2017年",
            "总资产收益率": "8.53",
            "销售净利率":"5.46",
            "总资产周转率":"1.56"
        },

    ]
}

let chartData102 = {
    columns: ["日期", "权益乘数","资产负债率"],
    rows: [{
            "日期": "2015年",
            "权益乘数": "0.62",
            "资产负债率":"45.12"
        },
        {
            "日期": "2016年",
            "权益乘数": "1.56",
            "资产负债率":"35.84"
        },
        {
            "日期": "2017年",
            "权益乘数": "1.56",
            "资产负债率":"36.04"
        },

    ]
}

let chartData103 = {
    columns: ["日期", "销售净利率","净利润","营业收入"],
    rows: [{
            "日期": "2015年",
            "销售净利率": "7.83",
            "净利润":"61047",
            "营业收入":"4779"
        },
        {
            "日期": "2016年",
            "销售净利率": "9.00",
            "净利润":"66682",
            "营业收入":"6001"
        },
        {
            "日期": "2017年",
            "销售净利率": "7.25",
            "净利润":"65630",
            "营业收入":"4757"
        },

    ]
}

let chartData104 = {
    columns: ["日期", "净利润","权益现金流量","利润含金量"],
    rows: [{
            "日期": "2015年",
            "净利润": "182397263.45",
            "权益现金流量":"345435345",
            "利润含金量":"123"
        },
        {
            "日期": "2016年",
            "净利润": "106044203.22",
            "权益现金流量":"345345435",
            "利润含金量":"234"
        },
        {
            "日期": "2017年",
            "净利润": "52688301.66",
            "权益现金流量":"4564565",
            "利润含金量":"345"
        },

    ]
}
let chartData105 = {
    columns: ["日期", "营业收入","营业成本","核心利润"],
    rows: [{
            "日期": "2015年",
            "营业收入":"61047",
            "营业成本":"56568",
            "核心利润":"193"
        },
        {
            "日期": "2016年",
            "营业收入":"66682",
            "营业成本":"60469",
            "核心利润":"472"
        },
        {
            "日期": "2017年",
            "营业收入":"65630",
            "营业成本":"56568",
            "核心利润":"373"
        },

    ]
}




let mainChartSettings = {
    showLine: ['存货/主营业务收入', '主营业务成本/主营业务收入'],
    axisSite: {
        right: ['存货/主营业务收入', '主营业务成本/主营业务收入']
    }
}
let mainChartSettings1 = {
    showLine: ['存货/主营业务收入', '主营业务成本/主营业务收入'],
    axisSite: {
        right: ['存货/主营业务收入', '主营业务成本/主营业务收入']
    }
}
let chartSetting1 = {
    showLine: ['长短期有息负债比值', ],
    axisSite: {
        right: ['长短期有息负债比值', ]
    }
}
let chartSettings2 = {
    showLine: ['营业收入的收现能力', ],
    axisSite: {
        right: ['营业收入的收现能力', ]
    }
}
let chartSettings3 = {
    showLine: ["内部经营资产收益率", "投资收益率", ],
    axisSite: {
        right: ["内部经营资产收益率", "投资收益率", ]
    }
}
let chartSettings4 = {
    showLine: ["经营性资产总额增长率", "经营性资产报酬率"],
    axisSite: {
        right: ["经营性资产总额增长率", "经营性资产报酬率"]
    }
}
let chartSettings5 = {
    showLine: ["应收账款"],
}
let chartSettings6 = {
    showLine: ["营业成本","营业收入"],
 
}
let chartSettings7 = {
    showLine: ["销售费用","营业收入"],
 
}
let chartSettings8 = {
    showLine: ["管理费用","营业收入","核心利润"],
 
}
let chartSettings9 = {
    showLine: ["销售毛利率","销售利润率","销售净利率"],
 
}
let chartSettings10 = {
    showLine: ["营业收入","营业成本","核心利润"],
 
}
let chartSettings11 = {
    showLine: ["成本费用利润率"],
 
}
let chartSettings12 = {
    showLine: ["利润含金量"],
 
}
let chartSettings13 = {
    showLine: ["权益报酬率","总资产收益率","权益乘数"],
 
}
let chartSettings14 = {
    showLine: ["总资产收益率","销售净利率","总资产周转率"],
 
}
let chartSettings15 = {
    showLine: ["权益乘数","资产负债率"],
 
}
let chartSettings16 = {
    showLine: ["销售净利率","净利润","营业收入"],
 
}
export {
    tableData,
    gridData,
    gridData2,
    gridData3,
    gridData4,
    gridData5,
    gridData6,
    gridData7,
    gridData8,
    gridData9,
    gridData10,
    gridData11,
    gridData12,
    gridData21,
    gridData22,
    gridData23,
    gridData24,
    gridData25,
    gridData26,
    gridData27,
    gridData28,
    gridData29,
    gridData30,
    gridData31,
    gridData32,
    gridData33,
    gridData34,
    gridData35,
    gridData36,
    gridData37,
    gridData38,
    gridData39,
    gridData40,
    gridData41,
    gridData42,
    gridData43,
    gridData44,
    gridData45,
    gridData46,
    gridData47,
    gridData48,
    gridData49,
    gridData50,
    gridData51,
    gridData52,
    gridData53,
    gridData54,
    gridData55,
    gridData56,
    gridData57,
    gridData58,
    gridData59,
    gridData60,
    gridData61,
    gridData62,
    gridData63,
    gridData64,
    gridData65,
    gridData66,
    gridData67,
    gridData68,
    gridData69,
    gridData70,
    gridData71,
    gridData72,
    gridData73,
    gridData74,
    gridData75,
    gridData76,
    gridData77,
    gridData78,
    gridData79,
    gridData80,
    gridData81,
    gridData82,
    gridData83,
    gridData84,

    chartData2,
    chartData3,
    chartData4,
    chartData5,
    chartData6,
    chartData7,
    chartData8,
    chartData9,
    chartData21,
    chartData22,
    chartData23,
    chartData24,
    chartData25,
    chartData26,
    chartData27,
    chartData28,
    chartData29,
    chartData30,
    chartData31,
    chartData32,
    chartData33,
    chartData34,
    chartData35,
    chartData36,
    chartData37,
    chartData38,
    chartData39,
    chartData40,
    chartData41,
    chartData42,
    chartData43,
    chartData44,
    chartData45,
    chartData46,
    chartData47,
    chartData48,
    chartData49,
    chartData50,
    chartData51,
    chartData52,
    chartData53,
    chartData54,
    chartData55,
    chartData56,
    chartData57,
    chartData58,
    chartData59,
    chartData60,
    chartData61,
    chartData62,
    chartData63,
    chartData64,
    chartData65,
    chartData66,
    chartData67,
    chartData68,
    chartData69,
    chartData70,
    chartData71,
    chartData72,
    chartData73,
    chartData74,
    chartData75,
    chartData76,
    chartData77,
    chartData78,
    chartData79,
    chartData80,
    chartData81,
    chartData82,
    chartData83,
    chartData84,
    chartData85,
    chartData86,
    chartData87,
    chartData88,
    chartData89,
    chartData90,
    chartData91,
    chartData92,
    chartData93,
    chartData94,
    chartData95,
    chartData96,
    chartData97,
    chartData98,
    chartData99,
    chartData100,
    chartData101,
    chartData102,
    chartData103,
    chartData104,
    chartData105,
    chartSetting1,
    chartSettings2,
    chartSettings3,
    chartSettings4,
    chartSettings5,
    chartSettings6,
    chartSettings7,
    chartSettings8,
    chartSettings9,
    chartSettings10,
    chartSettings11,
    chartSettings12,
    chartSettings13,
    chartSettings14,
    chartSettings15,
    chartSettings16,
    mainChartSettings,
    mainChartSettings1
}