let chartData1 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '营业资本', '本期': 29869.64, '同期': 23435.50 },
        { '日期': '营运资金', '本期': 8129.39, '同期': 5413.61 },
        { '日期': '现金支付能力', '本期': 11075.53, '同期': 18459.30 },
    ]
}
let chartData2 = {
    columns: ['日期', '本期', '同期'],
    rows: [
        { '日期': '经营收益', '本期': 79933.49, '同期': 26594.81 },
        { '日期': '经常收益', '本期': 1975.20, '同期': 2224.66 },
        { '日期': '期间收益', '本期': 4381.49, '同期': 85493.15 },
    ]
}

let tableData1 = [
    { "no": 1, "field1": "  营业 资本    ", "field2": "  29,869.64 ", "field3": "  23,435.50 ", "field4": "  协调且有支付能力，资金富裕    " },
    { "no": 2, "field1": "  营运资金     ", "field2": "  8,129.39  ", "field3": " 5,413.61   ", "field4": "	经营活动不协调，存在资金缺口  " },
    { "no": 3, "field1": "  现金支付能力 ", "field2": "  11,075.53 ", "field3": "  18,459.30 ", "field4": "  经营活动异常，存在亏损现象    " }
]
let tableData2 = [
    { "no": 1, "field1": "  经营收益 ", "field2": " 79,933.49 ", "field3": "  26,594.81 ", "field4": "  协调且有支付能力，资金富裕    " },
    { "no": 2, "field1": "  经常收益 ", "field2": " 1,975.20  ", "field3": " 2,224.66   ", "field4": "经营活动异常，存在亏损现象      " },
    { "no": 3, "field1": "  期间收益 ", "field2": " 4,381.49  ", "field3": " 85,493.15  ", "field4": " 协调且有支付能力，资金富裕     " }
]

export {
    chartData1,
    chartData2,
    tableData1,
    tableData2,
}