let chartData1={}
let chartData2={}
let tableData=[
    {
        "field1":"隆平高科",
        "field2":"000998",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"登海种业",
        "field2":"002041",
        "field3":"财务识假报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"神农科技",
        "field2":"300189",
        "field3":"财务分析报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"农发种业",
        "field2":"600313",
        "field3":"行业数据",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"众兴菌业",
        "field2":"002772",
        "field3":"参数数据",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"隆万向德农",
        "field2":"600371",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"隆平高科",
        "field2":"000998 ",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"隆平高科",
        "field2":"000998 ",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },

]
let tableData1=[
    {
        "no":"上海",
        "field":"财务风险报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        "no":"北京",
        "field":"财务识假报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付失败",
        "field8":"查看详情"
    },
    {
        "no":"天津",
        "field":"财务分析报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        "no":"海南",
        "field":"财务分析报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        "no":"重庆",
        "field":"财务分析报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        "no":"成都",
        "field":"财务识假报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        "no":"天津",
        "field":"财务识假报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        "no":"天津",
        "field":"财务识假报告",
        "field1":"2020-9-9 13：21",
        "field2":"001",
        "field3":"100",
        "field4":"3",
        "field5":"300",
        "field6":"刘女士",
        "field7":"支付成功",
        "field8":"查看详情"
    },
    {
        
        "field4":"合计：24",
        "field5":"合计：2400",
       
    },

]
let tableData2=[
    {
        "field1":"隆平高科",
        "field2":"000998",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"登海种业",
        "field2":"002041",
        "field3":"财务识假报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"神农科技",
        "field2":"300189",
        "field3":"财务分析报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"农发种业",
        "field2":"600313",
        "field3":"行业数据",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"众兴菌业",
        "field2":"002772",
        "field3":"参数数据",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"隆万向德农",
        "field2":"600371",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"隆平高科",
        "field2":"000998 ",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },
    {
        "field1":"隆平高科",
        "field2":"000998 ",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"支付成功",
        "field11":"查看详情"
    },

]
let tableData3=[
    {
        "field1":"隆平高科",
        "field2":"000998",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"登海种业",
        "field2":"002041",
        "field3":"财务识假报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"神农科技",
        "field2":"300189",
        "field3":"财务分析报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"农发种业",
        "field2":"600313",
        "field3":"行业数据",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"众兴菌业",
        "field2":"002772",
        "field3":"参数数据",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"隆万向德农",
        "field2":"600371",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"隆平高科",
        "field2":"000998 ",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },
    {
        "field1":"隆平高科",
        "field2":"000998 ",
        "field3":"财务风险报告",
        "field4":"2020-9-9 13：21",
        "field5":"001",
        "field6":"100",
        "field7":"3",
        "field8":"300",
        "field9":"刘女士",
        "field10":"未支付",
        "field11":"查看详情"
    },

]
let chartData14 = {
    columns: ['日期', '递延收益', '非流动负债'],
rows: [{
    '日期': '2015年',
    '递延收益': 1393.00,
    '非流动负债': 21000.00,
    '下单率': 0.32
},
{
    '日期': '2016年',
    '递延收益': 3530.00,
    '非流动负债': 24320.00,
    '下单率': 0.26
},
{
    '日期': '2017年',
    '递延收益': 2923.00,
    '非流动负债': 14080.00,
    '下单率': 0.76
},
{
    '日期': '2018年',
    '递延收益': 1723.00,
    '非流动负债': 8840.00,
    '下单率': 0.49
},
{
    '日期': '2019年',
    '递延收益': 3792.00,
    '非流动负债': 3600.00,
    '下单率': 0.323
},
]
};
export {
    chartData1,
    chartData2,
    tableData,
    tableData1,
    tableData2,
    tableData3,
    chartData14
}