let data = [
  {
  label: '(A)农、林、牧、渔业',
  children: [
    {
    label: '(A01)农业',
    children: [
      {
      label: '(A011)谷物种植',
      children: [{
        label: '(A0111)稻谷种植'
      },
      {
        label: '(A0112)小麦种植',
      },
      {
        label: '(A0113)玉米种植',
      },
      {
        label: '(A0119)其他谷物种植',
      },
    ]
    },
    {
      label: '(A012)豆类、油料和薯类种植',
      children: [
        {
        label: '(A0121)豆类种植'
      },
      {
        label: '(A0122)油料种植'
      },
      {
        label: '(A0123)薯类种植'
      },
    ]
    },
    {
      label: '(A013)棉、麻、糖、烟草种植',
      children: [
        {
        label: '(A0131)棉花种植'
      },
      {
        label: '(A0132)麻类种植'
      },
      {
        label: '(A0133)糖料种植'
      },
      {
        label: '(A0134)烟草种植'
      },
    ]
    },
    {
      label: '(A014)蔬菜、食用菌及园艺作物种植',
      children: [
        {
        label: '(A0141)蔬菜种植'
      },
      {
        label: '(A0142)食用菌种植'
      },
      {
        label: '(A0143)花卉种植'
      },
      {
        label: '(A0149)其他园艺作物种植'
      },
    ]
    },
    {
      label: '(A015)水果种植',
      children: [
        {
        label: '(A0151)仁果类和核果类水果种植'
      },
      {
        label: '(A0152)葡萄种植'
      },
      {
        label: '(A0153)柑橘类种植'
      },
      {
        label: '(A0154)香蕉等亚热带水果种植'
      },
      {
        label: '(A0159)其他水果种植'
      },
    ]
    },
    {
      label: '(A016)坚果、含油果、香料和饮料作物种植',
      children: [
        {
        label: '(A0161)坚果种植'
      },
      {
        label: '(A0162)含油果种植'
      },
      {
        label: '(A0163)香料作物种植'
      },
      {
        label: '(A0169)茶及其他饮料作物种植'
      },
    ]
    },
    {
      label: '(A0170)中药材种植',
    },
    {
      label: '(A0190)其他农业',
    },
  ]
  },
  {
    label: '(A02)林业',
    children: [
      {
      label: '(A021)林木育种和育苗',
      children: [
        {
        label: '(A0211)林木育种'
      },
      {
        label: '(A0212)林木育苗'
      },
    ]
    },
    {
      label: '(A0220)造林和更新', 
    },
    {
      label: '(A0230)森林经营和管护', 
    },
    {
      label: '(A024)木材和竹材采运',
      children: [
        {
        label: '(A0241)木材采运'
      },
      {
        label: '(A0242)竹材采运'
      },
    ]
    },
    {
      label: '(A025)林产品采集',
      children: [
        {
        label: '(A0251)木竹材林产品采集'
      },
      {
        label: '(A0252)非木竹材林产品采集'
      },
    ]
    },
  ]
  },
  {
    label: '(A03)畜牧业',
    children: [
      {
      label: '(A031)牲畜饲养',
      children: [
        {
        label: '(A0311)牛的饲养'
      },
      {
        label: '(A0312)马的饲养'
      },
      {
        label: '(A0313)猪的饲养'
      },
      {
        label: '(A0314)羊的饲养'
      },
      {
        label: '(A0315)骆驼饲养'
      },
      {
        label: '(A0319)其他牲畜饲养'
      },
    ]
    },
    {
      label: '(A032)家禽饲养',
      children: [
        {
        label: '(A0321)鸡的饲养'
      },
      {
        label: '(A0322)鸭的饲养'
      },
      {
        label: '(A0323)鹅的饲养'
      },
      {
        label: '(A0329)其他家禽饲养'
      },
    ]
    },
    {
      label: '(A0330)狩猎和捕捉动物',
    },
    {
      label: '(A0390)其他畜牧业',
    },
  ]
  },
  {
    label: '(A04)渔业',
    children: [
      {
      label: '(A041)水产养殖',
      children: [
        {
        label: '(A0411)海水养殖'
      },
      {
        label: '(A0412)内陆养殖'
      },
    ]
    },
    {
      label: '(A042)水产捕捞',
      children: [
        {
        label: '(A0421)海水捕捞'
      },
      {
        label: '(A0422)内陆捕捞'
      },
    ]
    },
  ]
  },
  {
    label: '(A05)农、林、牧、渔服务业',
    children: [
      {
        label: '(A051)农业服务业',
        children: [
          {
          label: '(A0511)农业机械服务'
        },
        {
          label: '(A0512)灌溉服务'
        },
        {
          label: '(A0513)农产品初加工服务'
        },
        {
          label: '(A0519)其他农业服务'
        },
      ]
      },
      {
        label: '(A052)林业服务业',
        children: [
          {
          label: '(A0521)林业有害生物防治服务'
        },
        {
          label: '(A0522)森林防火服务'
        },
        {
          label: '(A0523)林产品初级加工服务'
        },
        {
          label: '(A0529)其他林业服务'
        },
      ]
      },
      {
        label: '(A0530)畜牧服务业'
      },
      {
        label: '(A0540)渔业服务业'
      },
  ]
  },
]
},
 {
  label: '(B)采矿业',
  children: [
    {
    label: '(B06)煤炭开采和洗选业',
    children: [
      {
      label: '(B0610)烟煤和无烟煤开采洗选'
    },
    {
      label: '(B0620)褐煤开采洗选'
    },
    {
      label: '(B0690)其他煤炭采选'
    },
  ]
  }, 
  {
    label: '(B07)石油和天然气开采业',
    children: [
      {
      label: '(B0710)石油开采'
    },
    {
      label: '(B0720)天然气开采'
    },
  ]
  },
  {
    label: '(B08)黑色金属矿采选业',
    children: [
      {
      label: '(B0810)铁矿采选'
    },
    {
      label: '(B0820)锰矿、铬矿采选'
    },
    {
      label: '(B0890)其他黑色金属矿采选'
    },
  ]
  },
  {
    label: '(B09)有色金属矿采选业',
    children: [
      {
      label: '(B091)常用有色金属矿采选',
      children: [
        {
        label: '(B0911)铜矿采选'
      },
      {
        label: '(B0912)铅锌矿采选'
      },
      {
        label: '(B0913)镍钴矿采选'
      },
      {
        label: '(B0914)锡矿采选'
      },
      {
        label: '(B0915)锑矿采选'
      },
      {
        label: '(B0916)铝矿采选'
      },
      {
        label: '(B0917)镁矿采选'
      },
      {
        label: '(B0919)其他常用有色金属矿采选'
      },
    ]
    },
    {
      label: '(B092)贵金属矿采选',
      children: [
        {
          label: '(B0921)金矿采选'
        },
        {
          label: '(B0922)银矿采选'
        },
        {
          label: '(B0929)其他贵金属矿采选'
        }
      ]
    },
    {
      label: '(B093)稀有稀土金属矿采选',
      children: [
        {
        label: '(B0931)钨钼矿采选'
      },
      {
        label: '(B0932)稀土金属矿采选'
      },
      {
        label: '(B0933)放射性金属矿采选'
      },
      {
        label: '(B0939)其他稀有金属矿采选'
      },
    ]
    },
  ]
  },
  {
    label: '(B10)非金属矿采选业',
    children: [
      {
      label: '(B101)土砂石开采',
      children: [
        {
          label:'(B1011)石灰石、石膏开采'
        },
        {
          label:'(B1012)建筑装饰用石开采'
        },
        {
          label:'(B1013)耐火土石开采'
        },
        {
          label:'(B1019)粘土及其他土砂石开采'
        },
   
      ]
    },
    {
      label:'(B1020)化学矿开采'
    },
    {
      label:'(B1030)采盐'
    },
    {
      label: '(B109)石棉及其他非金属矿采选',
      children: [
        {
        label: '(B1091)石棉、云母矿采选'
      },
      {
        label: '(B1092)石墨、滑石采选'
      },
      {
        label: '(B1093)宝石、玉石采选'
      },
      {
        label: '(B1099)其他未列明非金属矿采选'
      },
    ]
    },
  ]
  },
  {
    label: '(B11)开采辅助活动',
    children: [
      {
      label: '(B1110)煤炭开采和洗选辅助活动'
    },
    {
      label: '(B1120)石油和天然气开采辅助活动'
    },
    {
      label: '(B1190)其他开采辅助活动'
    },
  ]
  },
  {
    label: '(B12)其他采矿业',
    children: [{
      label: '(B1200)其他采矿业'
    }]
  },
]
}, 
{
  label: '(C)制造业',
  children: [{
    label: '(C13)农副食品加工业',
    children: [
      {
      label: '(C1310)谷物磨制'
    },
    {
      label: '(C1320)饲料加工'
    },
    {
      label: '(C133)植物油加工',
         children: [
      {
      label: '(C1331)食用植物油加工'
    },
    {
      label: '(C1332)非食用植物油加工'
    },
  ]
    },
    {
      label: '(C1340)制糖业'
    },
    {
      label: '(C135)屠宰及肉类加工',
         children: [
      {
      label: '(C1351)牲畜屠宰'
    },
    {
      label: '(C1352)禽类屠宰'
    },
    {
      label: '(C1353)肉制品及副产品加工'
    },
  ]
    },
    {
      label: '(C136)水产品加工',
         children: [
      {
      label: '(C1361)水产品冷冻加工'
    },
    {
      label: '(C1362)鱼糜制品及水产品干腌制加工'
    },
    {
      label: '(C1363)水产饲料制造'
    },
    {
      label: '(C1364)鱼油提取及制品制造'
    },
    {
      label: '(C1369)其他水产品加工'
    },
  ]
    },
    {
      label: '(C137)蔬菜、水果和坚果加工',
         children: [
      {
      label: '(C1371)蔬菜加工'
    },
    {
      label: '(C1372)水果和坚果加工'
    },
  
  ]
    },
    {
      label: '(C139)其他农副食品加工',
         children: [
      {
      label: '(C1391)淀粉及淀粉制品制造'
    },
    {
      label: '(C1392)豆制品制造'
    },
    {
      label: '(C1393)蛋品加工'
    },
    {
      label: '(C1399)其他未列明农副食品加工'
    },
  ]
    },
  ]
  },
   {
    label: '(C14)食品制造业',
    children: [
      {
      label: '(C141)焙烤食品制造',
      children: [
        {
        label: '(C1411)糕点、面包制造'
      },
      {
        label: '(C1419)饼干及其他焙烤食品制造'
      },
    ]
    },
    {
      label: '(C142)糖果、巧克力及蜜饯制造',
      children: [
        {
        label: '(C1421)糖果、巧克力制造'
      },
      {
        label: '(C1422)蜜饯制作'
      },
    ]
    },
    {
      label: '(C143)方便食品制造',
      children: [
        {
        label: '(C1431)米、面制品制造'
      },
      {
        label: '(C1432)速冻食品制造'
      },
      {
        label: '(C1439)方便面及其他方便食品制造'
      },
    ]
    },
    {
      label: '(C1440)乳制品制造'
    },
    {
      label: '(C145)罐头食品制造',
      children: [
        {
        label: '(C1451)肉、禽类罐头制造'
      },
      {
        label: '(C1452)水产品罐头制造'
      },
      {
        label: '(C1453)蔬菜、水果罐头制造'
      },
      {
        label: '(C1459)其他罐头食品制造'
      },
    ]
    },
    {
      label: '(C146)调味品、发酵制品制造',
      children: [
        {
          label: '(C1461)味精制造'
        },
        {
          label: '(C1462)酱油、食醋及类似制品制造'
        },
        {
          label: '(C1469)其他调味品、发酵制品制造'
        },
      ]
    },
    {
      label: '(C149)其他食品制造',
      children: [
        {
        label: '(C1491)营养食品制造'
      },
      {
        label: '(C1492)保健食品制造'
      },
      {
        label: '(C1493)冷冻饮品及食用冰制造'
      },
      {
        label: '(C1494)盐加工'
      },
      {
        label: '(C1495)食品及饲料添加剂制造'
      },
      {
        label: '(C1499)其他未列明食品制造'
      },
    ]
    },
  ]
  },
  {
    label: '(C15)酒、饮料和精制茶制造业',
    children: [
      {
      label: '(C151)酒的制造',
      children: [
        {
        label: '(C1511)酒精制造'
      },
      {
        label: '(C1512)白酒制造'
      },
      {
        label: '(C1513)啤酒制造'
      },
      {
        label: '(C1514)黄酒制造'
      },
      {
        label: '(C1515)葡萄酒制造'
      },
      {
        label: '(C1519)其他酒制造'
      },
    ]
    },
    {
      label: '(C152)饮料制造',
      children: [
        {
        label: '(C1521)碳酸饮料制造'
      },
      {
        label: '(C1522)瓶（罐）装饮用水制造'
      },
      {
        label: '(C1523)果菜汁及果菜汁饮料制造'
      },
      {
        label: '(C1524)含乳饮料和植物蛋白饮料制造'
      },
      {
        label: '(C1525)固体饮料制造'
      },
      {
        label: '(C1529)茶饮料及其他饮料制造'
      },
    ]
    },
    {
      label: '(C1530)精制茶加工'
    },
  ]
  },
  {
    label: '(C16)烟草制品业',
    children: [
      {
        label: '(C1610)烟叶复烤'
      },
      {
        label: '(C1620)卷烟制造'
      },
      {
        label: '(C1690)其他烟草制品制造'
      },
  ]
  },
  {
    label: '(C17)纺织业',
    children: [
      {
      label: '(C171)棉纺织及印染精加工',
      children: [
        {
        label: '(C1711)棉纺纱加工'
      },
      {
        label: '(C1712)棉织造加工'
      },
      {
        label: '(C1713)棉印染精加工'
      },
    ]
    },
    {
      label: '(C172)毛纺织及染整精加工',
      children: [
        {
        label: '(C1721)毛条和毛纱线加工'
      },
      {
        label: '(C1722)毛织造加工'
      },
      {
        label: '(C1723)毛染整精加工'
      },
    ]
    },
    {
      label: '(C173)麻纺织及染整精加工',
      children: [
        {
        label: '(C1731)麻纤维纺前加工和纺纱'
      },
      {
        label: '(C1732)麻织造加工'
      },
      {
        label: '(C1733)麻染整精加工'
      },
    ]
    },
    {
      label: '(C174)丝绢纺织及印染精加工',
      children: [
        {
        label: '(C1741)缫丝加工'
      },
      {
        label: '(C1742)绢纺和丝织加工'
      },
      {
        label: '(C1743)丝印染精加工'
      },
    ]
    },
    {
      label: '(C175)化纤织造及印染精加工',
      children: [
        {
        label: '(C1751)化纤织造加工'
      },
      {
        label: '(C1752)化纤织物染整精加工'
      },
    ]
    },
    {
      label: '(C176)针织或钩针编织物及其制品制造',
      children: [
        {
        label: '(C1761)针织或钩针编织物织造'
      },
      {
        label: '(C1762)针织或钩针编织物印染精加工'
      },
      {
        label: '(C1763)针织或钩针编织品制造'
      },
    ]
    },
    {
      label: '(C177)家用纺织制成品制造',
      children: [
        {
        label: '(C1771)床上用品制造'
      },
      {
        label: '(C1772)毛巾类制品制造'
      },
      {
        label: '(C1773)窗帘、布艺类产品制造'
      },
      {
        label: '(C1779)其他家用纺织制成品制造'
      },
    ]
    },
    {
      label: '(C178)非家用纺织制成品制造',
      children: [
        {
        label: '(C1781)非织造布制造'
      },
      {
        label: '(C1782)绳、索、缆制造'
      },
      {
        label: '(C1783)纺织带和帘子布制造'
      },
      {
        label: '(C1784)篷、帆布制造'
      },
      {
        label: '(C1789)其他非家用纺织制成品制造'
      },
    ]
    },
    
  ]
  },
  {
    label: '(C18)纺织服装、服饰业',
    children: [
      {
      label: '(C1810)机织服装制造'
    },
    {
      label: '(C1820)针织或钩针编织服装制造'
    },
    {
      label: '(C1830)服饰制造'
    },
  ]
  },
  {
    label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
    children: [
      {
      label: '(C1910)皮革鞣制加工'
    },
    {
      label: '(C192)皮革制品制造',
      children: [
        {
        label: '(C1921)皮革服装制造'
      },
      {
        label: '(C1922)皮箱、包（袋）制造'
      },
      {
        label: '(C1923)皮手套及皮装饰制品制造'
      },
      {
        label: '(C1929)其他皮革制品制造'
      },
    ]
    },
    {
      label: '(C193)毛皮鞣制及制品加工',
      children: [
        {
        label: '(C1931)毛皮鞣制加工'
      },
      {
        label: '(C1932)毛皮服装加工'
      },
      {
        label: '(C1939)其他毛皮制品加工'
      },
      
    ]
    },
    {
      label: '(C194)羽毛(绒)加工及制品制造',
      children: [
        {
        label: '(C1941)羽毛（绒）加工'
      },
      {
        label: '(C1942)羽毛（绒）制品加工'
      },
    ]
    },
    {
      label: '(C195)制鞋业',
      children: [
        {
        label: '(C1951)纺织面料鞋制造'
      },
      {
        label: '(C1952)皮鞋制造'
      },
      {
        label: '(C1953)塑料鞋制造'
      },
      {
        label: '(C1954)橡胶鞋制造'
      },
      {
        label: '(C1959)其他制鞋业'
      },
    ]
    },

  ]
  },
  {
    label: '(C20)木材加工和木、竹、藤、棕、草制品业',
    children: [
      {
      label: '(C201)木材加工',
      children: [
        {
        label: '(C2011)锯材加工'
      },
      {
        label: '(C2012)木片加工'
      },
      {
        label: '(C2013)单板加工'
      },
      {
        label: '(C2019)其他木材加工'
      },
    ]
    },
    {
      label: '(C202)人造板制造',
      children: [
        {
        label: '(C2021)胶合板制造'
      },
      {
        label: '(C2022)纤维板制造'
      },
      {
        label: '(C2023)刨花板制造'
      },
      {
        label: '(C2029)其他人造板制造'
      },
    ]
    },
    {
      label: '(C203)木制品制造',
      children: [
        {
        label: '(C2031)建筑用木料及木材组件加工'
      },
      {
        label: '(C2032)木门窗、楼梯制造'
      },
      {
        label: '(C2033)地板制造'
      },
      {
        label: '(C2034)木制容器制造'
      },
      {
        label: '(C2039)软木制品及其他木制品制造'
      },
    ]
    },
    {
      label: '(C204)竹、藤、棕、草等制品制造',
      children: [
        {
        label: '(C2041)竹制品制造'
      },
      {
        label: '(C2042)藤制品制造'
      },
      {
        label: '(C2043)棕制品制造'
      },
      {
        label: '(C2049)草及其他制品制造'
      },
    ]
    },
  ]
  },
  {
    label: '(C21)家具制造业',
    children: [
      {
      label: '(C2110)木质家具制造'
    },
    {
      label: '(C2120)竹、藤家具制造'
    },
    {
      label: '(C2130)金属家具制造'
    },
    {
      label: '(C2140)塑料家具制造'
    },
    {
      label: '(C2190)其他家具制造'
    },
  ]
  },
  {
    label: '(C22)造纸和纸制品业',
    children: [  
         {
      label: '(C221)纸浆制造',
      children: [
        {
        label: '(C2211)木竹浆制造'
      },
      {
        label: '(C2212)非木竹浆制造'
      },
    ]
    },
    {
      label: '(C222)造纸',
      children: [
        {
        label: '(C2221)机制纸及纸板制造'
      },
      {
        label: '(C2222)手工纸制造'
      },
      {
        label: '(C2223)加工纸制造'
      },
    ]
    },
    {
      label: '(C223)纸制品制造',
      children: [
        {
        label: '(C2231)纸和纸板容器制造'
      },
      {
        label: '(C2239)其他纸制品制造'
      },
    ]
    },
  ]
  },
  {
    label: '(C23)印刷和记录媒介复制业',
    children: [
      {
        label: '(C231)印刷',
        children: [
          {
          label: '(C2311)书、报刊印刷'
        },
        {
          label: '(C2312)本册印制'
        },
        {
          label: '(C2319)包装装潢及其他印刷'
        },
      ]
      },
      {
        label: '(C2320)装订及印刷相关服务'
      },
      {
        label: '(C2330)记录媒介复制'
      },
    ]
  },
  {
    label: '(C24)文教、工美、体育和娱乐用品制造业',
    children: [
      {
        label: '(C241)文教办公用品制造',
        children: [
          {
          label: '(C2411)文具制造'
        },
        {
          label: '(C2412)笔的制造'
        },
        {
          label: '(C2413)教学用模型及教具制造'
        },
        {
          label: '(C2414)墨水、墨汁制造'
        },
        {
          label: '(C2419)其他文教办公用品制造'
        },
      ]
      },
      {
        label: '(C242)乐器制造',
        children: [
          {
          label: '(C2421)中乐器制造'
        },
        {
          label: '(C2422)西乐器制造'
        },
        {
          label: '(C2423)电子乐器制造'
        },
        {
          label: '(C2429)其他乐器及零件制造'
        },
      ]
      },
      {
        label: '(C243)工艺美术品制造',
        children: [
          {
          label: '(C2431)雕塑工艺品制造'
        },
        {
          label: '(C2432)金属工艺品制造'
        },
        {
          label: '(C2433)漆器工艺品制造'
        },
        {
          label: '(C2434)花画工艺品制造'
        },
        {
          label: '(C2435)天然植物纤维编织工艺品制造'
        },
        {
          label: '(C2436)抽纱刺绣工艺品制造'
        },
        {
          label: '(C2437)地毯、挂毯制造'
        },
        {
          label: '(C2438)珠宝首饰及有关物品制造'
        },
        {
          label: '(C2439)其他工艺美术品制造'
        },
      ]
      },
      {
        label: '(C244)体育用品制造',
        children: [
          {
          label: '(C2441)球类制造'
        },
        {
          label: '(C2442)体育器材及配件制造'
        },
        {
          label: '(C2443)训练健身器材制造'
        },
        {
          label: '(C2444)运动防护用具制造'
        },
        {
          label: '(C2449)其他体育用品制造'
        },
      ]
      },
      {
        label: '(C2450)玩具制造',
      },
      {
        label: '(C246)游艺器材及娱乐用品制造',
        children: [
          {
          label: '(C2461)露天游乐场所游乐设备制造'
        },
        {
          label: '(C2462)游艺用品及室内游艺器材制造'
        },
        {
          label: '(C2469)其他娱乐用品制造'
        },
      ]
      },
    ]
  },
  {
    label: '(C25)石油加工、炼焦和核燃料加工业',
    children: [
      {
        label: '(C251)精炼石油产品制造',
        children: [
          {
          label: '(C2511)原油加工及石油制品制造'
        },
        {
          label: '(C2512)人造原油制造'
        },
      ]
      },
      {
        label: '(C2520)炼焦'
      },
      {
        label: '(C2530)核燃料加工'
      }
    ]
  },
  {
    label: '(C26)化学原料和化学制品制造业',
    children: [
      {
        label: '(C261)基础化学原料制造',
        children: [
          {
          label: '(C2611)无机酸制造'
        },
        {
          label: '(C2612)无机碱制造'
        },
        {
          label: '(C2613)无机盐制造'
        },
        {
          label: '(C2614)有机化学原料制造'
        },
        {
          label: '(C2619)其他基础化学原料制造'
        },
      ]
      },
      {
        label: '(C262)肥料制造',
        children: [
          {
          label: '(C2621)氮肥制造'
        },
        {
          label: '(C2622)磷肥制造'
        },
        {
          label: '(C2623)钾肥制造'
        },
        {
          label: '(C2624)复混肥料制造'
        },
        {
          label: '(C2625)有机肥料及微生物肥料制造'
        },
        {
          label: '(C2629)其他肥料制造'
        },
      ]
      },
      {
        label: '(C263)农药制造',
        children: [
          {
          label: '(C2631)化学农药制造'
        },
        {
          label: '(C2632)生物化学农药及微生物农药制造'
        },
      ]
      },
      {
        label: '(C264)涂料、油墨、颜料及类似产品制造',
        children: [
          {
          label: '(C2641)涂料制造'
        },
        {
          label: '(C2642)油墨及类似产品制造'
        },
        {
          label: '(C2643)颜料制造'
        },
        {
          label: '(C2644)染料制造'
        },
        {
          label: '(C2645)密封用填料及类似品制造'
        },
      ]
      },
      {
        label: '(C265)合成材料制造',
        children: [
          {
          label: '(C2651)初级形态塑料及合成树脂制造'
        },
        {
          label: '(C2652)合成橡胶制造'
        },
        {
          label: '(C2653)合成纤维单（聚合）体制造'
        },
        {
          label: '(C2659)其他合成材料制造'
        },
      ]
      },
      {
        label: '(C266)专用化学产品制造',
        children: [
          {
          label: '(C2661)化学试剂和助剂制造'
        },
        {
          label: '(C2662)专项化学用品制造'
        },
        {
          label: '(C2663)林产化学产品制造'
        },
        {
          label: '(C2664)信息化学品制造'
        },
        {
          label: '(C2665)环境污染处理专用药剂材料制造'
        },
        {
          label: '(C2666)动物胶制造'
        },
        {
          label: '(C2669)其他专用化学产品制造'
        },
      ]
      },
      {
        label: '(C267)炸药、火工及焰火产品制造',
        children: [
          {
          label: '(C2671)炸药及火工产品制造'
        },
        {
          label: '(C2672)焰火、鞭炮产品制造'
        },
      ]
      },
      {
        label: '(C268)日用化学产品制造',
        children: [
          {
          label: '(C2681)肥皂及合成洗涤剂制造'
        },
        {
          label: '(C2682)化妆品制造'
        },
        {
          label: '(C2683)口腔清洁用品制造'
        },
        {
          label: '(C2684)香料、香精制造'
        },
        {
          label: '(C2689)其他日用化学产品制造'
        },
      ]
      },
                
    ]
  },
  {
    label: '(C27)医药制造业',
    children: [
      {
      label: '(C2710)化学药品原料药制造'
    },
    {
      label: '(C2720)化学药品制剂制造'
    },
    {
      label: '(C2730)中药饮片加工'
    },
    {
      label: '(C2740)中成药生产'
    },
    {
      label: '(C2750)兽用药品制造'
    },
    {
      label: '(C2760)生物药品制造'
    },
    {
      label: '(C2770)卫生材料及医药用品制造'
    },
  ]
  },
  {
    label: '(C28)化学纤维制造业',
    children: [
      {
        label: '(C281)纤维素纤维原料及纤维制造',
        children: [
          {
          label: '(C2811)化纤浆粕制造'
        },
        {
          label: '(C2812)人造纤维（纤维素纤维）制造'
        },
      ]
      },
      {
        label: '(C282)合成纤维制造',
        children: [
          {
          label: '(C2821)锦纶纤维制造'
        },
        {
          label: '(C2822)涤纶纤维制造'
        },
        {
          label: '(C2823)腈纶纤维制造'
        },
        {
          label: '(C2824)维纶纤维制造'
        },
        {
          label: '(C2825)丙纶纤维制造'
        },
        {
          label: '(C2826)氨纶纤维制造'
        },
        {
          label: '(C2829)其他合成纤维制造'
        },
      ]
      },
  
    ]
  },
  {
    label: '(C29)橡胶和塑料制品业',
    children: [
      {
        label: '(C291)橡胶制品业',
        children: [
          {
          label: '(C2911)轮胎制造'
        },
        {
          label: '(C2912)橡胶板、管、带制造'
        },
        {
          label: '(C2913)橡胶零件制造'
        },
        {
          label: '(C2914)再生橡胶制造'
        },
        {
          label: '(C2915)日用及医用橡胶制品制造'
        },
        {
          label: '(C2919)其他橡胶制品制造'
        },
      ]
      },
      {
        label: '(C292)塑料制品业',
        children: [
          {
          label: '(C2921)塑料薄膜制造'
        },
        {
          label: '(C2922)塑料板、管、型材制造'
        },
        {
          label: '(C2923)塑料丝、绳及编织品制造'
        },
        {
          label: '(C2924)泡沫塑料制造'
        },
        {
          label: '(C2925)塑料人造革、合成革制造'
        },
        {
          label: '(C2926)塑料包装箱及容器制造'
        },
        {
          label: '(C2927)日用塑料制品制造'
        },
        {
          label: '(C2928)塑料零件制造'
        },
        {
          label: '(C2929)其他塑料制品制造'
        },
      ]
      },
  
    ]
  },
  {
    label: '(C30)非金属矿物制品业',
    children: [
      {
        label: '(C301)水泥、石灰和石膏制造',
        children: [
          {
          label: '(C3011)水泥制造'
        },  {
          label: '(C3012)石灰和石膏制造'
        },
      ]
      },
      {
        label: '(C302)石膏、水泥制品及类似制品制造',
        children: [
          {
          label: '(C3021)水泥制品制造'
        },
        {
          label: '(C3022)砼结构构件制造'
        },
        {
          label: '(C3023)石棉水泥制品制造'
        },
        {
          label: '(C3024)轻质建筑材料制造'
        },
        {
          label: '(C3029)其他水泥类似制品制造'
        },
      ]
      },
      {
        label: '(C303)砖瓦、石材等建筑材料制造',
        children: [
          {
          label: '(C3031)粘土砖瓦及建筑砌块制造'
        },
        {
          label: '(C3032)建筑陶瓷制品制造'
        },
        {
          label: '(C3033)建筑用石加工'
        },
        {
          label: '(C3034)防水建筑材料制造'
        },
        {
          label: '(C3035)隔热和隔音材料制造'
        },
        {
          label: '(C3039)其他建筑材料制造'
        },
      ]
      },
      {
        label: '(C304)玻璃制造',
        children: [
          {
          label: '(C3041)平板玻璃制造'
        },
        {
          label: '(C3049)其他玻璃制造'
        },
      ]
      },
      {
        label: '(C305)玻璃制品制造',
        children: [
          {
          label: '(C3051)技术玻璃制品制造'
        },  {
          label: '(C3052)光学玻璃制造'
        },
        {
          label: '(C3053)玻璃仪器制造'
        },
        {
          label: '(C3054)日用玻璃制品制造'
        },
        {
          label: '(C3055)玻璃包装容器制造'
        },
        {
          label: '(C3056)玻璃保温容器制造'
        },
        {
          label: '(C3057)制镜及类似品加工'
        },
        {
          label: '(C3059)其他玻璃制品制造'
        },
      ]
      },
      {
        label: '(C306)玻璃纤维和玻璃纤维增强塑料制品制造',
        children: [
          {
          label: '(C3061)玻璃纤维及制品制造'
        },
        {
          label: '(C3062)玻璃纤维增强塑料制品制造'
        },
      ]
      },
      {
        label: '(C307)陶瓷制品制造',
        children: [
          {
          label: '(C3071)卫生陶瓷制品制造'
        },
        {
          label: '(C3072)特种陶瓷制品制造'
        },
        {
          label: '(C3073)日用陶瓷制品制造'
        },
        {
          label: '(C3079)园林、陈设艺术及其他陶瓷制品制造'
        },
      ]
      },
      {
        label: '(C308)耐火材料制品制造',
        children: [
          {
          label: '(C3081)石棉制品制造'
        },
        {
          label: '(C3082)云母制品制造'
        },
        {
          label: '(C3089)耐火陶瓷制品及其他耐火材料制造'
        },
      ]
      },
      {
        label: '(C309)石墨及其他非金属矿物制品制造',
        children: [
          {
          label: '(C3091)石墨及碳素制品制造'
        },
        {
          label: '(C3099)其他非金属矿物制品制造'
        },
      ]
      },
    ]
  },
  {
    label: '(C31)黑色金属冶炼和压延加工业',
    children: [
      {
      label: '(C3110)炼铁'
    },
    {
      label: '(C3120)炼钢'
    },
    {
      label: '(C3130)黑色金属铸造'
    },
    {
      label: '(C3140)钢压延加工'
    },
    {
      label: '(C3150)铁合金冶炼'
    },
  ]
  },
  {
    label: '(C32)有色金属冶炼和压延加工业',
    children: [
      {
        label: '(C321)常用有色金属冶炼',
        children: [
          {
          label: '(C3211)铜冶炼'
        },
        {
          label: '(C3212)铅锌冶炼'
        },
        {
          label: '(C3213)镍钴冶炼'
        },
        {
          label: '(C3214)锡冶炼'
        },
        {
          label: '(C3215)锑冶炼'
        },
        {
          label: '(C3216)铝冶炼'
        },
        {
          label: '(C3217)镁冶炼'
        },
        {
          label: '(C3219)其他常用有色金属冶炼'
        },
      ]
      },
      {
        label: '(C322)贵金属冶炼',
        children: [
          {
          label: '(C3221)金冶炼'
        },
        {
          label: '(C3222)银冶炼'
        },
        {
          label: '(C3229)其他贵金属冶炼'
        },
      ]
      },
      {
        label: '(C323)稀有稀土金属冶炼',
        children: [
          {
          label: '(C3231)钨钼冶炼'
        },
        {
          label: '(C3232)稀土金属冶炼'
        },
        {
          label: '(C3239)其他稀有金属冶炼'
        },
      ]
      },
      {
        label: '(C3240)有色金属合金制造',
      },
      {
        label: '(C3250)有色金属铸造',
      },
      {
        label: '(C326)有色金属压延加工',
        children: [
          {
          label: '(C3261)铜压延加工'
        },
        {
          label: '(C3262)铝压延加工'
        },
        {
          label: '(C3263)贵金属压延加工'
        },
        {
          label: '(C3264)稀有稀土金属压延加工'
        },
        {
          label: '(C3269)其他有色金属压延加工'
        },
      ]
      },

    ]
  },
  {
    label: '(C33)金属制品业',
    children: [
      {
        label: '(C331)结构性金属制品制造',
        children: [
          {
          label: '(C3311)金属结构制造'
        },
        {
          label: '(C3312)金属门窗制造'
        },
      ]
      },
      {
        label: '(C332)金属工具制造',
        children: [
          {
          label: '(C3321)切削工具制造'
        },
        {
          label: '(C3322)手工具制造'
        },
        {
          label: '(C3323)农用及园林用金属工具制造'
        },
        {
          label: '(C3324)刀剪及类似日用金属工具制造'
        },
        {
          label: '(C3329)其他金属工具制造'
        },
      ]
      },
      {
        label: '(C333)集装箱及金属包装容器制造',
        children: [
          {
          label: '(C3331)集装箱制造'
        },
        {
          label: '(C3332)金属压力容器制造'
        },
        {
          label: '(C3333)金属包装容器制造'
        },
      ]
      },
      {
        label: '(C3340)金属丝绳及其制品制造',
      },
      {
        label: '(C335)建筑、安全用金属制品制造',
        children: [
          {
          label: '(C3351)建筑、家具用金属配件制造'
        },
        {
          label: '(C3352)建筑装饰及水暖管道零件制造'
        },
        {
          label: '(C3353)安全、消防用金属制品制造'
        },
        {
          label: '(C3359)其他建筑、安全用金属制品制造'
        },
      ]
      },
      {
        label: '(C3360)金属表面处理及热处理加工',
      },
      {
        label: '(C337)搪瓷制品制造',
        children: [
          {
          label: '(C3371)生产专用搪瓷制品制造'
        },
        {
          label: '(C3372)建筑装饰搪瓷制品制造'
        },
        {
          label: '(C3373)搪瓷卫生洁具制造'
        },
        {
          label: '(C3379)搪瓷日用品及其他搪瓷制品制造'
        },
      ]
      },
      {
        label: '(C338)金属制日用品制造',
        children: [
          {
          label: '(C3381)金属制厨房用器具制造'
        },
        {
          label: '(C3382)金属制餐具和器皿制造'
        },
        {
          label: '(C3383)金属制卫生器具制造'
        },
        {
          label: '(C3389)其他金属制日用品制造'
        },
      ]
      },
      {
        label: '(C339)其他金属制品制造',
        children: [
          {
          label: '(C3391)锻件及粉末冶金制品制造'
        },
        {
          label: '(C3392)交通及公共管理用金属标牌制造'
        },
        {
          label: '(C3399)其他未列明金属制品制造'
        },
      ]
      },
                  
    ]
  },
  {
    label: '(C34)通用设备制造业',
    children: [
      {
        label: '(C341)锅炉及原动设备制造',
        children: [
          {
          label: '(C3411)锅炉及辅助设备制造'
        },
        {
          label: '(C3412)内燃机及配件制造'
        },
        {
          label: '(C3413)汽轮机及辅机制造'
        },
        {
          label: '(C3414)水轮机及辅机制造'
        },
        {
          label: '(C3415)风能原动设备制造'
        },
        {
          label: '(C3419)其他原动设备制造'
        },
      ]
      },{
        label: '(C342)金属加工机械制造',
        children: [
          {
          label: '(C3421)金属切削机床制造'
        },
        {
          label: '(C3422)金属成形机床制造'
        },
        {
          label: '(C3423)铸造机械制造'
        },
        {
          label: '(C3424)金属切割及焊接设备制造'
        },
        {
          label: '(C3425)机床附件制造'
        },
        {
          label: '(C3429)其他金属加工机械制造'
        },
      ]
      },
      {
        label: '(C343)物料搬运设备制造',
        children: [
          {
          label: '(C3431)轻小型起重设备制造'
        },
        {
          label: '(C3432)起重机制造'
        },
        {
          label: '(C3433)生产专用车辆制造'
        },
        {
          label: '(C3434)连续搬运设备制造'
        },
        {
          label: '(C3435)电梯、自动扶梯及升降机制造'
        },
        {
          label: '(C3439)其他物料搬运设备制造'
        },
      ]
      },
      {
        label: '(C344)泵、阀门、压缩机及类似机械制造',
        children: [
          {
          label: '(C3441)泵及真空设备制造'
        },
        {
          label: '(C3442)气体压缩机械制造'
        },
        {
          label: '(C3443)阀门和旋塞制造'
        },
        {
          label: '(C3444)液压和气压动力机械及元件制造'
        },
      ]
      },
      {
        label: '(C345)轴承、齿轮和传动部件制造',
        children: [
          {
          label: '(C3451)轴承制造'
        },
        {
          label: '(C3452)齿轮及齿轮减、变速箱制造'
        },
        {
          label: '(C3459)其他传动部件制造'
        },
      ]
      },
      {
        label: '(C346)烘炉、风机、衡器、包装等设备制造',
        children: [
          {
          label: '(C3461)烘炉、熔炉及电炉制造'
        },
        {
          label: '(C3462)风机、风扇制造'
        },
        {
          label: '(C3463)气体、液体分离及纯净设备制造'
        },
        {
          label: '(C3464)制冷、空调设备制造'
        },
        {
          label: '(C3465)风动和电动工具制造'
        },
        {
          label: '(C3466)喷枪及类似器具制造'
        },
        {
          label: '(C3467)衡器制造'
        },
        {
          label: '(C3468)包装专用设备制造'
        },
      ]
      },
      {
        label: '(C347)文化、办公用机械制造',
        children: [
          {
          label: '(C3471)电影机械制造'
        },
        {
          label: '(C3472)幻灯及投影设备制造'
        },
        {
          label: '(C3473)照相机及器材制造'
        },
        {
          label: '(C3474)复印和胶印设备制造'
        },
        {
          label: '(C3475)计算器及货币专用设备制造'
        },
        {
          label: '(C3479)其他文化、办公用机械制造'
        },
      ]
      },
      {
        label: '(C348)通用零部件制造',
        children: [
          {
          label: '(C3481)金属密封件制造'
        },
        {
          label: '(C3482)紧固件制造'
        },
        {
          label: '(C3483)弹簧制造'
        },
        {
          label: '(C3484)机械零部件加工'
        },
        {
          label: '(C3489)其他通用零部件制造'
        },
        
      ]
      },
      {
        label: '(C3490)其他通用设备制造业',
      },
    ]
  },
  {
    label: '(C35)专用设备制造业',
    children: [
      {
        label: '(C351)采矿、冶金、建筑专用设备制造',
        children: [
          {
          label: '(C3511)矿山机械制造'
        },
        {
          label: '(C3512)石油钻采专用设备制造'
        },
        {
          label: '(C3513)建筑工程用机械制造'
        },
        {
          label: '(C3514)海洋工程专用设备制造'
        },
        {
          label: '(C3515)建筑材料生产专用机械制造'
        },
        {
          label: '(C3516)冶金专用设备制造'
        },
      ]
      },
      {
        label: '(C352)化工、木材、非金属加工专用设备制造',
        children: [
          {
          label: '(C3521)炼油、化工生产专用设备制造'
        },
        {
          label: '(C3522)橡胶加工专用设备制造'
        },
        {
          label: '(C3523)塑料加工专用设备制造'
        },
        {
          label: '(C3524)木材加工机械制造'
        },
        {
          label: '(C3525)模具制造'
        },
        {
          label: '(C3529)其他非金属加工专用设备制造'
        },
      ]
      },
      {
        label: '(C353)食品、饮料、烟草及饲料生产专用设备制造',
        children: [
          {
          label: '(C3531)食品、酒、饮料及茶生产专用设备制造'
        },
        {
          label: '(C3532)农副食品加工专用设备制造'
        },
        {
          label: '(C3533)烟草生产专用设备制造'
        },
        {
          label: '(C3534)饲料生产专用设备制造'
        },
      ]
      },
      {
        label: '(C354)印刷、制药、日化及日用品生产专用设备制造',
        children: [
          {
          label: '(C3541)制浆和造纸专用设备制造'
        },
        {
          label: '(C3542)印刷专用设备制造'
        },
        {
          label: '(C3543)日用化工专用设备制造'
        },
        {
          label: '(C3544)制药专用设备制造'
        },
        {
          label: '(C3545)照明器具生产专用设备制造'
        },
        {
          label: '(C3546)玻璃、陶瓷和搪瓷制品生产专用设备制造'
        },
        {
          label: '(C3549)其他日用品生产专用设备制造'
        },
      ]
      },
      {
        label: '(C355)纺织、服装和皮革加工专用设备制造',
        children: [
          {
          label: '(C3551)纺织专用设备制造'
        },
        {
          label: '(C3552)皮革、毛皮及其制品加工专用设备制造'
        },
        {
          label: '(C3553)缝制机械制造'
        },
        {
          label: '(C3554)洗涤机械制造'
        },
      ]
      },
      {
        label: '(C356)电子和电工机械专用设备制造',
        children: [
          {
          label: '(C3561)电工机械专用设备制造'
        },
        {
          label: '(C3562)电子工业专用设备制造'
        },
      ]
      },
      {
        label: '(C357)农、林、牧、渔专用机械制造',
        children: [
          {
          label: '(C3571)拖拉机制造'
        },
        {
          label: '(C3572)机械化农业及园艺机具制造'
        },
        {
          label: '(C3573)营林及木竹采伐机械制造'
        },
        {
          label: '(C3574)畜牧机械制造'
        },
        {
          label: '(C3575)渔业机械制造'
        },
        {
          label: '(C3576)农林牧渔机械配件制造'
        },
        {
          label: '(C3577)棉花加工机械制造'
        },
        {
          label: '(C3579)其他农、林、牧、渔业机械制造'
        },
      ]
      },
      {
        label: '(C358)医疗仪器设备及器械制造',
        children: [
          {
          label: '(C3581)医疗诊断、监护及治疗设备制造'
        },
        {
          label: '(C3582)口腔科用设备及器具制造'
        },
        {
          label: '(C3583)医疗实验室及医用消毒设备和器具制造'
        },
        {
          label: '(C3584)医疗、外科及兽医用器械制造'
        },
        {
          label: '(C3585)机械治疗及病房护理设备制造'
        },
        {
          label: '(C3586)假肢、人工器官及植（介）入器械制造'
        },
        {
          label: '(C3589)其他医疗设备及器械制造'
        }
      ]
      },
      {
        label: '(C359)环保、社会公共服务及其他专用设备制造',
        children: [
          {
          label: '(C3591)环境保护专用设备制造'
        },
        {
          label: '(C3592)地质勘查专用设备制造'
        },
        {
          label: '(C3593)邮政专用机械及器材制造'
        },
        {
          label: '(C3594)商业、饮食、服务专用设备制造'
        },
        {
          label: '(C3595)社会公共安全设备及器材制造'
        },
        {
          label: '(C3596)交通安全、管制及类似专用设备制造'
        },
        {
          label: '(C3597)水资源专用机械制造'
        },
        {
          label: '(C3599)其他专用设备制造'
        },
      ]
      },
    ]
  },
  {
    label: '(C36)汽车制造业',
    children: [
      {
      label: '(C3610)汽车整车制造'
    },
    {
      label: '(C3620)改装汽车制造'
    },
    {
      label: '(C3630)低速载货汽车制造'
    },
    {
      label: '(C3640)电车制造'
    },  {
      label: '(C3650)汽车车身、挂车制造'
    }, 
     {
      label: '(C3660)汽车零部件及配件制造'
    },
  ]
  },
  {
    label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
    children: [
      {
        label: '(C371)铁路运输设备制造',
        children: [
          {
          label: '(C3711)铁路机车车辆及动车组制造'
        },
        {
          label: '(C3712)窄轨机车车辆制造'
        },
        {
          label: '(C3713)铁路机车车辆配件制造'
        },
        {
          label: '(C3714)铁路专用设备及器材、配件制造'
        },
        {
          label: '(C3719)其他铁路运输设备制造'
        },
      ]
      },
      {
        label: '(C3720)城市轨道交通设备制造',
      },
      {
        label: '(C373)船舶及相关装置制造',
        children: [
          {
          label: '(C3731)金属船舶制造'
        },
        {
          label: '(C3732)非金属船舶制造'
        },
        {
          label: '(C3733)娱乐船和运动船制造'
        },
        {
          label: '(C3734)船用配套设备制造'
        },
        {
          label: '(C3735)船舶改装与拆除'
        },
        {
          label: '(C3739)航标器材及其他相关装置制造'
        },

      ]
      },
      {
        label: '(C374)航空、航天器及设备制造',
        children: [
          {
          label: '(C3741)飞机制造'
        },
        {
          label: '(C3742)航天器制造'
        },
        {
          label: '(C3743)航空、航天相关设备制造'
        },
        {
          label: '(C3749)其他航空航天器制造'
        },
      ]
      },
      {
        label: '(C375)摩托车制造',
        children: [
          {
          label: '(C3751)摩托车整车制造'
        },
        {
          label: '(C3752)摩托车零部件及配件制造'
        },
      ]
      },
      {
        label: '(C376)自行车制造',
        children: [
          {
          label: '(C3761)脚踏自行车及残疾人座车制造'
        },
        {
          label: '(C3762)助动自行车制造'
        },
      ]
      },
      {
        label: '(C3770)非公路休闲车及零配件制造',
      },
      {
        label: '(C379)潜水救捞及其他未列明运输设备制造',
        children: [
          {
          label: '(C3791)潜水及水下救捞装备制造'
        },
        {
          label: '(C3799)其他未列明运输设备制造'
        },
      ]
      },
    ]
  },
  {
    label: '(C38)电气机械和器材制造业',
    children: [
      {
        label: '(C381)电机制造',
        children: [
          {
          label: '(C3811)发电机及发电机组制造'
        },
        {
          label: '(C3812)电动机制造'
        },
        {
          label: '(C3819)微电机及其他电机制造'
        },
      ]
      },
      {
        label: '(C382)输配电及控制设备制造',
        children: [
          {
          label: '(C3821)变压器、整流器和电感器制造'
        },
        {
          label: '(C3822)电容器及其配套设备制造'
        },
        {
          label: '(C3823)配电开关控制设备制造'
        },
        {
          label: '(C3824)电力电子元器件制造'
        },
        {
          label: '(C3825)光伏设备及元器件制造'
        },
        {
          label: '(C3829)其他输配电及控制设备制造'
        },
      ]
      },
      {
        label: '(C383)电线、电缆、光缆及电工器材制造',
        children: [
          {
          label: '(C3831)电线、电缆制造'
        },
        {
          label: '(C3832)光纤、光缆制造'
        },
        {
          label: '(C3833)绝缘制品制造'
        },
        {
          label: '(C3839)其他电工器材制造'
        },
      ]
      },
      {
        label: '(C384)电池制造',
        children: [
          {
          label: '(C3841)锂离子电池制造'
        },
        {
          label: '(C3842)镍氢电池制造'
        },
        {
          label: '(C3849)其他电池制造'
        },
      ]
      },
      {
        label: '(C385)家用电力器具制造',
        children: [
          {
          label: '(C3851)家用制冷电器具制造'
        },
        {
          label: '(C3852)家用空气调节器制造'
        },
        {
          label: '(C3853)家用通风电器具制造'
        },
        {
          label: '(C3854)家用厨房电器具制造'
        },  {
          label: '(C3855)家用清洁卫生电器具制造'
        },
        {
          label: '(C3856)家用美容、保健电器具制造'
        },
        {
          label: '(C3857)家用电力器具专用配件制造'
        },
        {
          label: '(C3859)其他家用电力器具制造'
        },
      ]
      },
      {
        label: '(C386)非电力家用器具制造',
        children: [
          {
          label: '(C3861)燃气、太阳能及类似能源家用器具制造'
        },
        {
          label: '(C3869)其他非电力家用器具制造'
        },
      ]
      },
      {
        label: '(C387)照明器具制造',
        children: [
          {
          label: '(C3871)电光源制造'
        },
        {
          label: '(C3872)照明灯具制造'
        },
        {
          label: '(C3879)灯用电器附件及其他照明器具制造'
        },
      ]
      },
      {
        label: '(C389)其他电气机械及器材制造',
        children: [
          {
          label: '(C3891)电气信号设备装置制造'
        },
        {
          label: '(C3899)其他未列明电气机械及器材制造'
        },
      ]
      },
  
    ]
  },
  {
    label: '(C39)计算机、通信和其他电子设备制造业',
    children: [
      {
        label: '(C391)计算机制造',
        children: [
          {
          label: '(C3911)计算机整机制造'
        },
        {
          label: '(C3912)计算机零部件制造'
        },
        {
          label: '(C3913)计算机外围设备制造'
        },
        {
          label: '(C3919)其他计算机制造'
        },
      ]
      },
      {
        label: '(C392)通信设备制造',
        children: [
          {
          label: '(C3921)通信系统设备制造'
        },
        {
          label: '(C3922)通信终端设备制造'
        },
      ]
      },
      {
        label: '(C393)广播电视设备制造',
        children: [
          {
          label: '(C3931)广播电视节目制作及发射设备制造'
        },
        {
          label: '(C3932)广播电视接收设备及器材制造'
        },
        {
          label: '(C3939)应用电视设备及其他广播电视设备制造'
        },
      ]
      },
      {
        label: '(C3940)雷达及配套设备制造',
      },
      {
        label: '(C395)视听设备制造',
        children: [
          {
          label: '(C3951)电视机制造'
        },
        {
          label: '(C3952)音响设备制造'
        },
        {
          label: '(C3953)影视录放设备制造'
        },
      ]
      },
      {
        label: '(C396)电子器件制造',
        children: [
          {
          label: '(C3961)电子真空器件制造'
        },
        {
          label: '(C3962)半导体分立器件制造'
        },
        {
          label: '(C3963)集成电路制造'
        },
        {
          label: '(C3969)光电子器件及其他电子器件制造'
        },
      ]
      },
      {
        label: '(C397)电子元件制造',
        children: [
          {
          label: '(C3971)电子元件及组件制造'
        },
        {
          label: '(C3972)印制电路板制造'
        },
      ]
      },
      {
        label: '(C3990)其他电子设备制造',
      },
  
    ]
  },
  {
    label: '(C40)仪器仪表制造业',
    children: [
      {
        label: '(C401)通用仪器仪表制造',
        children: [
          {
          label: '(C4011)工业自动控制系统装置制造'
        },
        {
          label: '(C4012)电工仪器仪表制造'
        },
        {
          label: '(C4013)绘图、计算及测量仪器制造'
        },
        {
          label: '(C4014)实验分析仪器制造'
        },
        {
          label: '(C4015)试验机制造'
        },
        {
          label: '(C4019)供应用仪表及其他通用仪器制造'
        },
      ]
      },
      {
        label: '(C402)专用仪器仪表制造',
        children: [
          {
          label: '(C4021)环境监测专用仪器仪表制造'
        },
        {
          label: '(C4022)运输设备及生产用计数仪表制造'
        },
        {
          label: '(C4023)导航、气象及海洋专用仪器制造'
        },
        {
          label: '(C4024)农林牧渔专用仪器仪表制造'
        },
        {
          label: '(C4025)地质勘探和地震专用仪器制造'
        },
        {
          label: '(C4026)教学专用仪器制造'
        },
        {
          label: '(C4027)核子及核辐射测量仪器制造'
        },
        {
          label: '(C4028)电子测量仪器制造'
        },
        {
          label: '(C4029)其他专用仪器制造'
        },
      ]
      },
      {
        label: '(C4030)钟表与计时仪器制造',
      },
      {
        label: '(C404)光学仪器及眼镜制造',
        children: [
          {
          label: '(C4041)光学仪器制造'
        },
        {
          label: '(C4042)眼镜制造'
        },
      ]
      },
      {
        label: '(C4090)其他仪器仪表制造业',
      },
    ]
  },
  {
    label: '(C41)其他制造业',
    children: [
      {
        label: '(C411)日用杂品制造',
        children: [
          {
          label: '(C4111)鬃毛加工、制刷及清扫工具制造'
        },
        {
          label: '(C4119)其他日用杂品制造'
        },
      ]
      },
      {
        label: '(C4120)煤制品制造'
      },
      {
        label: '(C4130)核辐射加工'
      },
      {
        label: '(C4190)其他未列明制造业'
      },
  
    ]
  },
  {
    label: '(C42)废弃资源综合利用业',
    children: [
      {
      label: '(C4210)金属废料和碎屑加工处理'
    },
    {
      label: '(C4220)非金属废料和碎屑加工处理'
    },
  ]
  },
  {
    label: '(C43)金属制品、机械和设备修理业',
    children: [
      {
      label: '(C4310)金属制品修理'
    },
    {
      label: '(C4320)通用设备修理'
    },
    {
      label: '(C4330)专用设备修理'
    },
    {
      label: '(C434)铁路、船舶、航空航天等运输设备修理',
      children: [
        {
        label: '(C4341)铁路运输设备修理'
      },
      {
        label: '(C4342)船舶修理'
      },
      {
        label: '(C4343)航空航天器修理'
      },
      {
        label: '(C4349)其他运输设备修理'
      },
    ]
    },
    {
      label: '(C4350)电气设备修理'
    },
    {
      label: '(C4360)仪器仪表修理'
    },
    {
      label: '(C4390)其他机械和设备修理业'
    },
    
  ]
  },
]
},
{
  label: '(D)电力、热力、燃气及水生产和供应业',
  children: [
    {
    label: '(D44)电力、热力生产和供应业',
    children: [
      {
      label: '(D441)电力生产',
      children: [
        {
        label: '(D4411)火力发电'
      },
      {
        label: '(D4412)水力发电'
      },
      {
        label: '(D4413)核力发电'
      },
      {
        label: '(D4414)风力发电'
      },
      {
        label: '(D4415)太阳能发电'
      },
      {
        label: '(D4419)其他电力生产'
      },
    ]
    },
    {
      label: '(D4420)电力供应',
    },
    {
      label: '(D4430)热力生产和供应',
    },
  ]
  }, 
  {
    label: '(D45)燃气生产和供应业',
    children: [
      {
      label: '(D4500)燃气生产和供应业'
    }]
  },
  {
    label: '(D46)水的生产和供应业',
    children: [
      {
      label: '(D4610)自来水生产和供应'
    },
    {
      label: '(D4620)污水处理及其再生利用'
    },
    {
      label: '(D4690)其他水的处理、利用与分配'
    },
  ]
  }]
},
{
  label: '(E)建筑业',
  children: [
    {
    label: '(E47)房屋建筑业',
    children: [{
      label: '(E4700)房屋建筑业'
    }]
  },
  {
    label: '(E48)土木工程建筑业',
    children: [
      {
        label: '(E481)铁路、道路、隧道和桥梁工程建筑',
        children: [
          {
          label: '(E4811)铁路工程建筑'
        },
        {
          label: '(E4812)公路工程建筑'
        },
        {
          label: '(E4813)市政道路工程建筑'
        },
        {
          label: '(E4819)其他道路、隧道和桥梁工程建筑'
        },
      ]
      },
      {
        label: '(E482)水利和内河港口工程建筑',
        children: [
          {
          label: '(E4821)水源及供水设施工程建筑'
        },
        {
          label: '(E4822)河湖治理及防洪设施工程建筑'
        },
        {
          label: '(E4823)港口及航运设施工程建筑'
        },
      ]
      },
      {
        label: '(E4830)海洋工程建筑'
      },
      {
        label: '(E4840)工矿工程建筑'
      },
      {
        label: '(E485)架线和管道工程建筑',
        children: [
          {
          label: '(E4851)架线及设备工程建筑'
        },
        {
          label: '(E4852)管道工程建筑'
        },
      ]
      },
      {
        label: '(E4890)其他土木工程建筑'
      },
    ]
  },
  {
    label: '(E49)建筑安装业',
    children: [
      {
        label: '(E4910)电气安装'
      },
      {
        label: '(E4920)管道和设备安装'
      },
      {
        label: '(E4990)其他建筑安装业'
      },
    ]
  },
   {
    label: '(E50)建筑装饰和其他建筑业',
    children: [
      {
      label: '(E5010)建筑装饰业'
    },
    {
      label: '(E502)工程准备活动',
      children: [
        {
        label: '(E5021)建筑物拆除活动'
      },
      {
        label: '(E5029)其他工程准备活动'
      },
    ]
    },
    {
      label: '(E5030)提供施工设备服务'
    },
    {
      label: '(E5090)其他未列明建筑业'
    },
  ]
  }]
},
{
  label: '(F)批发和零售业',
  children: [{
    label: '(F51)批发业',
    children: [
      {
        label: '(F511)农、林、牧产品批发',
        children: [
          {
          label: '(F5111)谷物、豆及薯类批发'
        },
        {
          label: '(F5112)种子批发'
        },
        {
          label: '(F5113)饲料批发'
        },
        {
          label: '(F5114)棉、麻批发'
        },
        {
          label: '(F5115)林业产品批发'
        },
        {
          label: '(F5116)牲畜批发'
        },
        {
          label: '(F5119)其他农牧产品批发'
        },
      ]
      },
      {
        label: '(F512)食品、饮料及烟草制品批发',
        children: [
          {
          label: '(F5121)米、面制品及食用油批发'
        },
        {
          label: '(F5122)糕点、糖果及糖批发'
        },
        {
          label: '(F5123)果品、蔬菜批发'
        },
        {
          label: '(F5124)肉、禽、蛋、奶及水产品批发'
        },
        {
          label: '(F5125)盐及调味品批发'
        },
        {
          label: '(F5126)营养和保健品批发'
        },
        {
          label: '(F5127)酒、饮料及茶叶批发'
        },
        {
          label: '(F5128)烟草制品批发'
        },
        {
          label: '(F5129)其他食品批发'
        },
      ]
      },
      {
        label: '(F513)纺织、服装及家庭用品批发',
        children: [
          {
          label: '(F5131)纺织品、针织品及原料批发'
        },
        {
          label: '(F5132)服装批发'
        },
        {
          label: '(F5133)鞋帽批发'
        },
        {
          label: '(F5134)化妆品及卫生用品批发'
        },
        {
          label: '(F5135)厨房、卫生间用具及日用杂货批发'
        },
        {
          label: '(F5136)灯具、装饰物品批发'
        },
        {
          label: '(F5137)家用电器批发'
        },
        {
          label: '(F5139)其他家庭用品批发'
        },
      ]
      },
      {
        label: '(F514)文化、体育用品及器材批发',
        children: [
          {
          label: '(F5141)文具用品批发'
        },
        {
          label: '(F5142)体育用品及器材批发'
        },
        {
          label: '(F5143)图书批发'
        },
        {
          label: '(F5144)报刊批发'
        },
        {
          label: '(F5145)音像制品及电子出版物批发'
        },
        {
          label: '(F5146)首饰、工艺品及收藏品批发'
        },
        {
          label: '(F5149)其他文化用品批发'
        },
      ]
      },
      {
        label: '(F515)医药及医疗器材批发',
        children: [
          {
          label: '(F5151)西药批发'
        },
        {
          label: '(F5152)中药批发'
        },
        {
          label: '(F5153)医疗用品及器材批发'
        },
      ]
      },
      {
        label: '(F516)矿产品、建材及化工产品批发',
        children: [
          {
          label: '(F5161)煤炭及制品批发'
        },
        {
          label: '(F5162)石油及制品批发'
        },
        {
          label: '(F5163)非金属矿及制品批发'
        },
        {
          label: '(F5164)金属及金属矿批发'
        },
        {
          label: '(F5165)建材批发'
        },
        {
          label: '(F5166)化肥批发'
        },
        {
          label: '(F5167)农药批发'
        },
        {
          label: '(F5168)农用薄膜批发'
        },
        {
          label: '(F5169)其他化工产品批发'
        },
      ]
      },
      {
        label: '(F517)机械设备、五金产品及电子产品批发',
        children: [
          {
          label: '(F5171)农业机械批发'
        },
        {
          label: '(F5172)汽车批发'
        },
        {
          label: '(F5173)汽车零配件批发'
        },
        {
          label: '(F5174)摩托车及零配件批发'
        },
        {
          label: '(F5175)五金产品批发'
        },
        {
          label: '(F5176)电气设备批发'
        },
        {
          label: '(F5177)计算机、软件及辅助设备批发'
        },
        {
          label: '(F5178)通讯及广播电视设备批发'
        },
        {
          label: '(F5179)其他机械设备及电子产品批发'
        },
      ]
      },
      {
        label: '(F518)贸易经纪与代理',
        children: [
          {
          label: '(F5181)贸易代理'
        },
        {
          label: '(F5182)拍卖'
        },
        {
          label: '(F5189)其他贸易经纪与代理'
        },
      ]
      },
      {
        label: '(F519)其他批发业',
        children: [
          {
          label: '(F5191)再生物资回收与批发'
        },
        {
          label: '(F5199)其他未列明批发业'
        },
      ]
      },
  
    ]
  },
  {
    label: '(F52)零售业',
    children: [
      {
        label: '(F521)综合零售',
        children: [
          {
          label: '(F5211)百货零售'
        },
        {
          label: '(F5212)超级市场零售'
        },
        {
          label: '(F5219)其他综合零售'
        },
      ]
      },
      {
        label: '(F522)食品、饮料及烟草制品专门零售',
        children: [
          {
          label: '(F5221)粮油零售'
        },
        {
          label: '(F5222)糕点、面包零售'
        },
        {
          label: '(F5223)果品、蔬菜零售'
        },
        {
          label: '(F5224)肉、禽、蛋、奶及水产品零售'
        },
        {
          label: '(F5225)营养和保健品零售'
        },
        {
          label: '(F5226)酒、饮料及茶叶零售'
        },
        {
          label: '(F5227)烟草制品零售'
        },{
          label: '(F5229)其他食品零售'
        },
      ]
      },
      {
        label: '(F523)纺织、服装及日用品专门零售',
        children: [
          {
          label: '(F5231)纺织品及针织品零售'
        },
        {
          label: '(F5232)服装零售'
        },
        {
          label: '(F5233)鞋帽零售'
        },
        {
          label: '(F5234)化妆品及卫生用品零售'
        },
        {
          label: '(F5235)钟表、眼镜零售'
        },
        {
          label: '(F5236)箱、包零售'
        },
        {
          label: '(F5237)厨房用具及日用杂品零售'
        },
        {
          label: '(F5238)自行车零售'
        }, 
        {
          label: '(F5239)其他日用品零售'
        },

      ]
      },
      {
        label: '(F524)文化、体育用品及器材专门零售',
        children: [
          {
          label: '(F5241)文具用品零售'
        },
        {
          label: '(F5242)体育用品及器材零售'
        },
        {
          label: '(F5243)图书、报刊零售'
        },
        {
          label: '(F5244)音像制品及电子出版物零售'
        },
        {
          label: '(F5245)珠宝首饰零售'
        }, 
        {
          label: '(F5246)工艺美术品及收藏品零售'
        }, 
        {
          label: '(F5247)乐器零售'
        }, 
        {
          label: '(F5248)照相器材零售'
        }, 
        {
          label: '(F5249)其他文化用品零售'
        },

      ]
      },
      {
        label: '(F525)医药及医疗器材专门零售',
        children: [
          {
          label: '(F5251)药品零售'
        },
        {
          label: '(F5252)医疗用品及器材零售'
        },
      ]
      },
      {
        label: '(F526)汽车、摩托车、燃料及零配件专门零售',
        children: [
          {
          label: '(F5261)汽车零售'
        },
        {
          label: '(F5262)汽车零配件零售'
        },
        {
          label: '(F5263)摩托车及零配件零售'
        },
        {
          label: '(F5264)机动车燃料零售'
        },

      ]
      },
      {
        label: '(F527)家用电器及电子产品专门零售',
        children: [
          {
          label: '(F5271)家用视听设备零售'
        },
        {
          label: '(F5272)日用家电设备零售'
        },
        {
          label: '(F5273)计算机、软件及辅助设备零售'
        },
        {
          label: '(F5274)通信设备零售'
        },
        {
          label: '(F5279)其他电子产品零售'
        },
      ]
      },
      {
        label: '(F528)五金、家具及室内装饰材料专门零售',
        children: [
          {
          label: '(F5281)五金零售'
        },
        {
          label: '(F5282)灯具零售'
        },
        {
          label: '(F5283)家具零售'
        },
        {
          label: '(F5284)涂料零售'
        },
        {
          label: '(F5285)卫生洁具零售'
        },
        {
          label: '(F5286)木质装饰材料零售'
        },
        {
          label: '(F5287)陶瓷、石材装饰材料零售'
        },
        {
          label: '(F5289)其他室内装饰材料零售'
        },
      ]
      },
      {
        label: '(F529)货摊、无店铺及其他零售业',
        children: [
          {
          label: '(F5291)货摊食品零售'
        },
        {
          label: '(F5292)货摊纺织、服装及鞋零售'
        },
        {
          label: '(F5293)货摊日用品零售'
        },
        {
          label: '(F5294)互联网零售'
        },
        {
          label: '(F5295)邮购及电视、电话零售'
        },
        {
          label: '(F5296)旧货零售'
        },
        {
          label: '(F5297)生活用燃料零售'
        },
        {
          label: '(F5299)其他未列明零售业'
        },
      ]
      },
    ]
  },
   {
    label: '(F53)商业贸易',
}]
},
{
  label: '(G)交通运输、仓储和邮政业',
  children: [
    {
    label: '(G53)铁路运输业',
    children: [
      {
      label: '(G5310)铁路旅客运输'
    },
    {
      label: '(G5320)铁路货物运输'
    },
    {
      label: '(G533)铁路运输辅助活动',
      children: [
        {
        label: '(G5331)客运火车站'
      },
      {
        label: '(G5332)货运火车站'
      },
      {
        label: '(G5339)其他铁路运输辅助活动'
      },
    ]
    },
  ]
  },
  {
    label: '(G54)道路运输业',
    children: [
      {
        label: '(G541)城市公共交通运输',
        children: [
          {
          label: '(G5411)公共电汽车客运'
        },
        {
          label: '(G5412)城市轨道交通'
        },
        {
          label: '(G5413)出租车客运'
        },
        {
          label: '(G5419)其他城市公共交通运输'
        },
      ]
      },
      {
        label: '(G5420)公路旅客运输'
      },

      {
        label: '(G5430)道路货物运输'
      },

      {
        label: '(G544)道路运输辅助活动',
        children: [
          {
          label: '(G5441)客运汽车站'
        },
        {
          label: '(G5442)公路管理与养护'
        },
        {
          label: '(G5449)其他道路运输辅助活动'
        },
      ]
      },
    ]
  },
  {
    label: '(G55)水上运输业',
    children: [
      {
        label: '(G551)水上旅客运输',
        children: [
          {
          label: '(G5511)海洋旅客运输'
        },
        {
          label: '(G5512)内河旅客运输'
        },
        {
          label: '(G5513)客运轮渡运输'
        },
      ]
      },
      {
        label: '(G552)水上货物运输',
        children: [
          {
          label: '(G5521)远洋货物运输'
        },
        {
          label: '(G5522)沿海货物运输'
        },
        {
          label: '(G5523)内河货物运输'
        },
      ]
      },
      {
        label: '(G553)水上运输辅助活动',
        children: [
          {
          label: '(G5531)客运港口'
        },
        {
          label: '(G5532)货运港口'
        },
        {
          label: '(G5539)其他水上运输辅助活动'
        },
      ]
      },
    
    ]
  },
  {
    label: '(G56)航空运输业',
    children: [
      {
        label: '(G561)航空客货运输',
        children: [
          {
          label: '(G5611)航空旅客运输'
        },
        {
          label: '(G5612)航空货物运输'
        },
      ]
      },
      {
        label: '(G5620)通用航空服务'
      },
      {
        label: '(G563)航空运输辅助活动',
        children: [
          {
          label: '(G5631)机场'
        },
        {
          label: '(G5632)空中交通管理'
        },
        {
          label: '(G5639)其他航空运输辅助活动'
        },
      ]
      },
    ]
  },
  {
    label: '(G57)管道运输业',
    children: [{
      label: '(G5700)管道运输业'
    }]
  },
  {
    label: '(G58)装卸搬运和运输代理业',
    children: [{
      label: '(G5810)装卸搬运'
    },
    {
      label: '(G582)运输代理业',
      children: [
        {
        label: '(G5821)货物运输代理'
      },
      {
        label: '(G5822)旅客票务代理'
      },
      {
        label: '(G5829)其他运输代理业'
      },
    ]
    },
  ]
  },
  {
    label: '(G59)仓储业',
    children: [
      {
        label: '(G591)谷物、棉花等农产品仓储',
        children: [
          {
          label: '(G5911)谷物仓储'
        },
        {
          label: '(G5912)棉花仓储'
        },
        {
          label: '(G5919)其他农产品仓储'
        },
      ]
      },
      {
        label: '(G5990)其他仓储业'
      },

  
    ]
  },
  {
    label: '(G60)邮政业',
    children: [
      {
      label: '(G6010)邮政基本服务'
    },
    {
      label: '(G6020)快递服务'
    },
  ]
  }]
},
{
  label: '(H)住宿和餐饮业',
  children: [{
    label: '(H61)住宿业',
    children: [
      {
      label: '(H6110)旅游饭店'
    },
    {
      label: '(H6120)一般旅馆'
    },
    {
      label: '(H6190)其他住宿业'
    },
  ]
  }, {
    label: '(H62)餐饮业',
    children: [
      {
      label: '(H6210)正餐服务'
    },
    {
      label: '(H6220)快餐服务'
    },
    {
      label: '(H623)饮料及冷饮服务',
      children: [
        {
        label: '(H6231)茶馆服务'
      },
      {
        label: '(H6232)咖啡馆服务'
      },
      {
        label: '(H6233)酒吧服务'
      },
      {
        label: '(H6239)其他饮料及冷饮服务'
      },
    ]
    },
    {
      label: '(H629)其他餐饮业',
      children: [
        {
        label: '(H6291)小吃服务'
      },
      {
        label: '(H6292)餐饮配送服务'
      },
      {
        label: '(H6299)其他未列明餐饮业'
      },
    ]
    },
  ]
  }]
},
{
  label: '(I)信息传输、软件和信息技术服务业',
  children: [
    {
    label: '(I63)电信、广播电视和卫星传输服务',
    children: [
      {
        label: '(I631)电信',
        children: [
          {
          label: '(I6311)固定电信服务'
        },
        {
          label: '(I6312)移动电信服务'
        },
        {
          label: '(I6319)其他电信服务'
        },
      ]
      },
      {
        label: '(I632)广播电视传输服务',
        children: [
          {
          label: '(I6321)有线广播电视传输服务'
        },
        {
          label: '(I6322)无线广播电视传输服务'
        },
      ]
      },
      {
        label: '(I6330)卫星传输服务',
        children: [
          {
          label: ''
        },
      ]
      },
      
    ]
  }, 
  {
    label: '(I64)互联网和相关服务',
    children: [
      {
        label: '(I6410)互联网接入及相关服务'
      },
      {
        label: '(I6420)互联网信息服务'
      },
      {
        label: '(I6490)其他互联网服务'
      },
    ]
  },
  {
    label: '(I65)软件和信息技术服务业',
    children: [
      {
        label: '(I6510)软件开发'
      },
      {
        label: '(I6520)信息系统集成服务'
      },
      {
        label: '(I6530)信息技术咨询服务'
      },
      {
        label: '(I6540)数据处理和存储服务'
      },
      {
        label: '(I6550)集成电路设计'
      },
      {
        label: '(I659)其他信息技术服务业',
        children: [
          {
          label: '(I6591)数字内容服务'
        },
        {
          label: '(I6592)呼叫中心'
        },
        {
          label: '(I6599)其他未列明信息技术服务业'
        },
      ]
      },
    ]
  }]
},
{
  label: '(J)金融业',
  children: [
    {
      label: '(J66)货币金融服务',
      children: [
        {
          label: '(J6610)中央银行服务'
        },
        {
          label: '(J6620)货币银行服务'
        },
        {
          label: '(J663)非货币银行服务',
     children: [
      {
      label: '(J6631)金融租赁服务'
    },
    {
      label: '(J6632)财务公司'
    },
    {
      label: '(J6633)典当'
    },
    {
      label: '(J6639)其他非货币银行服务'
    },
  ]
        },
        {
          label: '(J6640)银行监管服务'
        },
      ]
    },
    {
    label: '(J67)资本市场服务',
    children: [
      {
        label: '(J671)证券市场服务',
        children: [
          {
          label: '(J6711)证券市场管理服务'
        },
        {
          label: '(J6712)证券经纪交易服务'
        },
        {
          label: '(J6713)基金管理服务'
        },
      ]
      },
      {
        label: '(J672)期货市场服务',
        children: [
          {
          label: '(J6721)期货市场管理服务'
        },
        {
          label: '(J6729)其他期货市场服务'
        },
      ]
      },
      {
        label: '(J6730)证券期货监管服务'
      },
      {
        label: '(J6740)资本投资服务'
      },
      {
        label: '(J6790)其他资本市场服务'
      },
    ]
  }, 
  {
    label: '(J68)保险业',
    children: [
      {
        label: '(J681)人身保险',
        children: [
          {
          label: '(J6811)人寿保险'
        },
        {
          label: '(J6812)健康和意外保险'
        },
      ]
      },
      {
        label: '(J6820)财产保险'
      },
      {
        label: '(J6830)再保险'
      },
      {
        label: '(J6840)养老金'
      },
      {
        label: '(J6850)保险经纪与代理服务'
      },
      {
        label: '(J6860)保险监管服务'
      },
        {
      label: '(J689)其他保险活动',
      children: [
        {
        label: '(J6891)风险和损失评估'
      },
      {
        label: '(J6899)其他未列明保险活动'
      },
    ]
    },
    ]
  }, 
  {
    label: '(J69)其他金融业',
    children: [
      {
        label: '(J6910)金融信托与管理服务'
      },
      {
        label: '(J6920)控股公司服务'
      },
      {
        label: '(J6930)非金融机构支付服务'
      },
      {
        label: '(J6940)金融信息服务'
      },
      {
        label: '(J6990)其他未列明金融业'
      },
    ]
  }, 
 ]
},  {
  label: '(K)房地产业',
  children: [{
    label: '(K70)房地产业',
    children: [
      {
        label: '(K7010)房地产开发经营'
      },
      {
        label: '(K7020)物业管理'
      },
      {
        label: '(K7030)房地产中介服务'
      },
      {
        label: '(K7040)自有房地产经营活动'
      },
      {
        label: '(K7090)其他房地产业'
      },

    ]
  }, ]
},  {
  label: '(L)租赁和商务服务业',
  children: [{
    label: '(L71)租赁业',
    children: [
      {
        label: '(L711)机械设备租赁',
        children: [
          {
          label: '(L7111)汽车租赁'
        },
        {
          label: '(L7112)农业机械租赁'
        },
        {
          label: '(L7113)建筑工程机械与设备租赁'
        },
        {
          label: '(L7114)计算机及通讯设备租赁'
        },
        {
          label: '(L7119)其他机械与设备租赁'
        },
      ]
      },
      {
        label: '(L712)文化及日用品出租',
        children: [
          {
          label: '(L7121)娱乐及体育设备出租'
        },
        {
          label: '(L7122)图书出租'
        },
        {
          label: '(L7123)音像制品出租'
        },
        {
          label: '(L7129)其他文化及日用品出租'
        },
      ]
      },
    ]
  }, {
    label: '(L72)商务服务业',
    children: [
      {
        label: '(L721)企业管理服务',
        children: [
          {
          label: '(L7211)企业总部管理'
        },
        {
          label: '(L7212)投资与资产管理'
        },
        {
          label: '(L7213)单位后勤管理服务'
        },
        {
          label: '(L7219)其他企业管理服务'
        },
      ]
      },
      {
        label: '(L722)法律服务',
        children: [
          {
          label: '(L7221)律师及相关法律服务'
        },
        {
          label: '(L7222)公证服务'
        },
        {
          label: '(L7229)其他法律服务'
        },
      ]
      },
      {
        label: '(L723)咨询与调查',
        children: [
          {
          label: '(L7231)会计、审计及税务服务'
        },
        {
          label: '(L7232)市场调查'
        },
        {
          label: '(L7233)社会经济咨询'
        },
        {
          label: '(L7239)其他专业咨询'
        },
      ]
      },
      {
        label: '(L7240)广告业',
      },
      {
        label: '(L7250)知识产权服务',
      },
      {
        label: '(L726)人力资源服务',
        children: [
          {
          label: '(L7261)公共就业服务'
        },
        {
          label: '(L7262)职业中介服务'
        },
        {
          label: '(L7263)劳务派遣服务'
        },
        {
          label: '(L7269)其他人力资源服务'
        },
      ]
      },
      {
        label: '(L727)旅行社及相关服务',
        children: [
          {
          label: '(L7271)旅行社服务'
        },
        {
          label: '(L7272)旅游管理服务'
        },
        {
          label: '(L7279)其他旅行社相关服务'
        },
      ]
      },
      {
        label: '(L728)安全保护服务',
        children: [
          {
          label: '(L7281)安全服务'
        },
        {
          label: '(L7282)安全系统监控服务'
        },
        {
          label: '(L7289)其他安全保护服务'
        },
      ]
      },
      {
        label: '(L729)其他商务服务业',
        children: [
          {
          label: '(L7291)市场管理'
        },
        {
          label: '(L7292)会议及展览服务'
        },
        {
          label: '(L7293)包装服务'
        },
        {
          label: '(L7294)办公服务'
        },
        {
          label: '(L7295)信用服务'
        },
        {
          label: '(L7296)担保服务'
        },
        {
          label: '(L7299)其他未列明商务服务业'
        },
      ]
      },
    ]
  }]
},
{
  label: '(M)科学研究和技术服务业',
  children: [{
    label: '(M73)研究和试验发展',
    children: [
      {
        label: '(M7310)自然科学研究和试验发展'
      },
      {
        label: '(M7320)工程和技术研究和试验发展'
      },
      {
        label: '(M7330)农业科学研究和试验发展'
      },
      {
        label: '(M7340)医学研究和试验发展'
      },
      {
        label: '(M7350)社会人文科学研究'
      },
    ]
  },
   {
    label: '(M74)专业技术服务业',
    children: [
      {
      label: '(M7410)气象服务'
    },
    {
      label: '(M7420)地震服务'
    },
    {
      label: '(M7430)海洋服务'
    },
    {
      label: '(M7440)测绘服务'
    },
    {
      label: '(M7450)质检技术服务'
    },
    {
      label: '(M746)环境与生态监测',
      children: [
        {
        label: '(M7461)环境保护监测'
      },
      {
        label: '(M7462)生态监测'
      },
    ]
    },

    {
      label: '(M747)地质勘查',
      children: [
        {
        label: '(M7471)能源矿产地质勘查'
      }, {
        label: '(M7472)固体矿产地质勘查'
      },
      {
        label: '(M7473)水、二氧化碳等矿产地质勘查'
      },
      {
        label: '(M7474)基础地质勘查'
      },
      {
        label: '(M7475)地质勘查技术服务'
      },
    ]
    },

    {
      label: '(M748)工程技术',
      children: [
        {
        label: '(M7481)工程管理服务'
      },
      {
        label: '(M7482)工程勘察设计'
      },
      {
        label: '(M7483)规划管理'
      },
    ]
    },

    {
      label: '(M749)其他专业技术服务业',
      children: [
        {
        label: '(M7491)专业化设计服务'
      },
      {
        label: '(M7492)摄影扩印服务'
      },
      {
        label: '(M7493)兽医服务'
      },
      {
        label: '(M7499)其他未列明专业技术服务业'
      },
    ]
    },

  ]
  },
  {
    label: '(M75)科技推广和应用服务业',
    children: [
      {
        label: '(M751)技术推广服务',
        children: [
          {
          label: '(M7511)农业技术推广服务'
        },
        {
          label: '(M7512)生物技术推广服务'
        },
        {
          label: '(M7513)新材料技术推广服务'
        },
        {
          label: '(M7514)节能技术推广服务'
        },
        {
          label: '(M7519)其他技术推广服务'
        },
      ]
      },
      {
        label: '(M7520)科技中介服务'
      },
      {
        label: '(M7590)其他科技推广和应用服务业'
      },
  
    ]
  },
]
},
{
  label: '(N)水利、环境和公共设施管理业',
  children: [{
    label: '(N76)水利管理业',
    children: [
      {
        label: '(N7610)防洪除涝设施管理'
      },

      {
        label: '(N7620)水资源管理'
      },

      {
        label: '(N7630)天然水收集与分配'
      },

      {
        label: '(N7640)水文服务'
      },

      {
        label: '(N7690)其他水利管理业'
      },

    ]
  },
   {
    label: '(N77)生态保护和环境治理业',
    children: [
      {
        label: '(N771)生态保护',
        children: [
          {
          label: '(N7711)自然保护区管理'
        },
        {
          label: '(N7712)野生动物保护'
        },
        {
          label: '(N7713)野生植物保护'
        },
        {
          label: '(N7719)其他自然保护'
        },
      ]
      },
      {
        label: '(N772)环境治理业',
        children: [
          {
          label: '(N7721)水污染治理'
        },
        {
          label: '(N7722)大气污染治理'
        },
        {
          label: '(N7723)固体废物治理'
        },
        {
          label: '(N7724)危险废物治理'
        },
        {
          label: '(N7725)放射性废物治理'
        },
        {
          label: '(N7729)其他污染治理'
        },
      ]
      },
    ]
  },
  {
    label: '(N78)公共设施管理业',
    children: [
      {
        label: '(N7810)市政设施管理'
      },
      {
        label: '(N7820)环境卫生管理'
      },
      {
        label: '(N7830)城乡市容管理'
      },
      {
        label: '(N7840)绿化管理'
      },
      {
        label: '(N785)公园和游览景区管理',
        children: [
          {
          label: '(N7851)公园管理'
        },
        {
          label: '(N7852)游览景区管理'
        },
      ]
      },
    ]
  },
]
},
{
  label: '(O)居民服务、修理和其他服务业',
  children: [{
    label: '(O79)居民服务业',
    children: [
      {
        label: '(O7910)家庭服务'
      },
      {
        label: '(O7920)托儿所服务'
      },
      {
        label: '(O7930)洗染服务'
      },
      {
        label: '(O7940)理发及美容服务'
      },
      {
        label: '(O7950)洗浴服务'
      },
      {
        label: '(O7960)保健服务'
      },
      {
        label: '(O7970)婚姻服务'
      },
      {
        label: '(O7980)殡葬服务'
      },
      {
        label: '(O7990)其他居民服务业'
      },
    ]
  }, {
    label: '(O80)机动车、电子产品和日用产品修理业',
    children: [
      {
        label: '(O801)汽车、摩托车修理与维护',
        children: [
          {
          label: '(O8011)汽车修理与维护'
        },
        {
          label: '(O8012)摩托车修理与维护'
        },
      ]
      },
      {
        label: '(O802)计算机和办公设备维修',
        children: [
          {
          label: '(O8021)计算机和辅助设备修理'
        },
        {
          label: '(O8022)通讯设备修理'
        },
        {
          label: '(O8029)其他办公设备维修'
        },
      ]
      },
      {
        label: '(O803)家用电器修理',
        children: [
          {
          label: '(O8031)家用电子产品修理'
        },
        {
          label: '(O8032)日用电器修理'
        },
      ]
      },
      {
        label: '(O809)其他日用产品修理业',
        children: [
          {
          label: '(O8091)自行车修理'
        },
        {
          label: '(O8092)鞋和皮革修理'
        },
        {
          label: '(O8093)家具和相关物品修理'
        },
        {
          label: '(O8099)其他未列明日用产品修理业'
        },
      ]
      },
    ]
  },
  {
    label: '(O81)其他服务业',
    children: [
      {
        label: '(O811)清洁服务',
        children: [
          {
          label: '(O8111)建筑物清洁服务'
        },
        {
          label: '(O8119)其他清洁服务'
        },
      ]
      },
      {
        label: '(O8190)其他未列明服务业'
      },

    ]
  },
]
},
{
  label: '(P)教育',
  children: [{
    label: '(P82)教育',
    children: [
      {
        label: '(P8210)学前教育',
      },
      {
        label: '(P822)初等教育',
        children: [
          {
          label: '(P8221)普通小学教育'
        },
        {
          label: '(P8222)成人小学教育'
        },
      ]
      },
      {
        label: '(P823)中等教育',
        children: [
          {
          label: '(P8231)普通初中教育'
        },
        {
          label: '(P8232)职业初中教育'
        },
        {
          label: '(P8233)成人初中教育'
        },
        {
          label: '(P8234)普通高中教育'
        },
        {
          label: '(P8235)成人高中教育'
        },
        {
          label: '(P8236)中等职业学校教育'
        },
      ]
      },
      {
        label: '(P824)高等教育',
        children: [
          {
          label: '(P8241)普通高等教育'
        },
        {
          label: '(P8242)成人高等教育'
        },
      ]
      },
      {
        label: '(P8250)特殊教育',
      },
      {
        label: '(P829)技能培训、教育辅助及其他教育',
        children: [
          {
          label: '(P8291)职业技能培训'
        },
        {
          label: '(P8292)体校及体育培训'
        },
        {
          label: '(P8293)文化艺术培训'
        },
        {
          label: '(P8294)教育辅助服务'
        },
        {
          label: '(P8299)其他未列明教育'
        },
      ]
      },
    ]
  }, ]
},
{
  label: '(Q)卫生和社会工作',
  children: [{
    label: '(Q83)卫生',
    children: [
      {
        label: '(Q831)医院',
        children: [
          {
          label: '(Q8311)综合医院'
        },
        {
          label: '(Q8312)中医医院'
        },
        {
          label: '(Q8313)中西医结合医院'
        },
        {
          label: '(Q8314)民族医院'
        },
        {
          label: '(Q8315)专科医院'
        },
        {
          label: '(Q8316)疗养院'
        },
      ]
      },
      {
        label: '(Q832)社区医疗与卫生院',
        children: [
          {
          label: '(Q8321)社区卫生服务中心（站）'
        },
        {
          label: '(Q8322)街道卫生院'
        },
        {
          label: '(Q8323)乡镇卫生院'
        },
      ]
      },
      {
        label: '(Q8330)门诊部（所）'
      },
      {
        label: '(Q8340)计划生育技术服务活动'
      },
      {
        label: '(Q8350)妇幼保健院（所、站）'
      },
      {
        label: '(Q8360)专科疾病防治院（所、站）'
      },
      {
        label: '(Q8370)疾病预防控制中心'
      },
      {
        label: '(Q8390)其他卫生活动'
      },
    ]
  }, {
    label: '(Q84)社会工作',
    children: [
      {
        label: '(Q841)提供住宿社会工作',
        children: [
          {
          label: '(Q8411)干部休养所'
        },
        {
          label: '(Q8412)护理机构服务'
        },
        {
          label: '(Q8413)精神康复服务'
        },
        {
          label: '(Q8414)老年人、残疾人养护服务'
        },
        {
          label: '(Q8415)孤残儿童收养和庇护服务'
        },
        {
          label: '(Q8419)其他提供住宿社会救助'
        },
      ]
      },
      {
        label: '(Q842)不提供住宿社会工作',
        children: [
          {
          label: '(Q8421)社会看护与帮助服务'
        },
        {
          label: '(Q8429)其他不提供住宿社会工作'
        },
      ]
      },
    ]
  }]
},
{
  label: '(R)文化、体育和娱乐业',
  children: [{
    label: '(R85)新闻和出版业',
    children: [
      {
        label: '(R8510)新闻业'
      },
      {
        label: '(R852)出版业',
        children: [
          {
          label: '(R8521)图书出版'
        },
        {
          label: '(R8522)报纸出版'
        },
        {
          label: '(R8523)期刊出版'
        },
        {
          label: '(R8524)音像制品出版'
        },
        {
          label: '(R8525)电子出版物出版'
        },
        {
          label: '(R8529)其他出版业'
        },
      ]
      },
    ]
  },
   {
    label: '(R86)广播、电视、电影和影视录音制作业',
    children: [{
      label: '三级 3-2-1'
    }]
  },
  {
    label: '(R87)文化艺术业',
    children: [
      {
        label: '(R8710)文艺创作与表演'
      },
      {
        label: '(R8720)艺术表演场馆'
      },
      {
        label: '(R873)图书馆与档案馆',
        children: [
          {
          label: '(R8731)图书馆'
        },
        {
          label: '(R8732)档案馆'
        },
      ]
      },
      {
        label: '(R8740)文物及非物质文化遗产保护'
      },
      {
        label: '(R8750)博物馆'
      },
      {
        label: '(R8760)烈士陵园、纪念馆'
      },
      {
        label: '(R8770)群众文化活动'
      },
      {
        label: '(R8790)其他文化艺术业'
      },
    ]
  },
  {
    label: '(R88)体育',
    children: [
      {
        label: '(R8810)体育组织'
      },
      {
        label: '(R8820)体育场馆'
      },
      {
        label: '(R8830)休闲健身活动'
      },
      {
        label: '(R8890)其他体育'
      },
    ]
  },
  {
    label: '(R89)娱乐业',
    children: [
      {
        label: '(R891)室内娱乐活动',
        children: [
          {
          label: '(R8911)歌舞厅娱乐活动'
        },
        {
          label: '(R8912)电子游艺厅娱乐活动'
        },
        {
          label: '(R8913)网吧活动'
        },
        {
          label: '(R8919)其他室内娱乐活动'
        },
      ]
      },
      {
        label: '(R8920)游乐园'
      },
      {
        label: '(R8930)彩票活动'
      },
      {
        label: '(R894)文化、娱乐、体育经纪代理',
        children: [
          {
          label: '(R8941)文化娱乐经纪人'
        },
        {
          label: '(R8942)体育经纪人'
        },
        {
          label: '(R8949)其他文化艺术经纪代理'
        },
      ]
      },
      {
        label: '(R8990)其他娱乐业'
      },
    ]
  },
]
},
{
  label: '(S)公共管理、社会保障和社会组织',
  children: [{
    label: '(S90)中国共产党机关',
    children: [
      {
        label: '(S9000)中国共产党机关'
      },

    ]
  }, 
  {
    label: '(S91)国家机构',
    children: [
      {
        label: '(S9110)国家权力机构',
      },
      {
        label: '(S912)国家行政机构',
        children: [
          {
          label: '(S9121)综合事务管理机构'
        },
        {
          label: '(S9122)对外事务管理机构'
        },
        {
          label: '(S9123)公共安全管理机构'
        },
        {
          label: '(S9124)社会事务管理机构'
        },
        {
          label: '(S9125)经济事务管理机构'
        },
        {
          label: '(S9126)行政监督检查机构'
        },
      ]
      },
      {
        label: '(S913)人民法院和人民检察院',
        children: [
          {
          label: '(S9131)人民法院'
        },
        {
          label: '(S9132)人民检察院'
        },
      ]
      },
      {
        label: '(S9190)其他国家机构',
      },
    ]
  },
  {
    label: '(S92)人民政协、民主党派',
    children: [
      {
        label: '(S9210)人民政协'
      },
      {
        label: '(S9220)民主党派'
      },
    ]
  },
  {
    label: '(S93)社会保障',
    children: [ 
    {
      label: '(S9300)社会保障'
    },
    ]
  },
  {
    label: '(S94)群众团体、社会团体和其他成员组织',
    children: [
      {
        label: '(S941)群众团体',
        children: [
          {
          label: '(S9411)工会'
        },
        {
          label: '(S9412)妇联'
        },
        {
          label: '(S9413)共青团'
        },
        {
          label: '(S9419)其他群众团体'
        },
      ]
      },
      {
        label: '(S942)社会团体',
        children: [
          {
          label: '(S9421)专业性团体'
        },
        {
          label: 'S9422)行业性团体'
        },
        {
          label: '(S9429)其他社会团体'
        },
      ]
      },
      {
        label: '(S9430)基金会'
      },
      {
        label: '(S9440)宗教组织'
      },
    ]
  },
  {
    label: '(S95)基层群众自治组织',
    children: [
      {
        label: '(S9510)社区自治组织'
      },
      {
        label: '(S9520)村民自治组织'
      },
    ]
  },
]
},
{
  label: '(T)国际组织',
  children: [{
    label: '(T96)国际组织',
    children: [{
      label: '(T9600)国际组织'
    },]
  }, ]
},
{
  label: '(Z)综合',
},
]
let data1=[
  {
    label: '(A)农、林、牧、渔业',
    children: [
      {
      label: '(A01)农业',
    },
    {
      label: '(A02)林业',
      children: [
      {
        label: '(A0230)森林经营和管护', 
      },
    ]
  },
    {
      label: '(A03)畜牧业',
    },
    {
      label: '(A04)渔业',
    },
  ]
  },
   {
    label: '(B)采矿业',
    children: [
      {
      label: '(B06)煤炭开采和洗选业',
    }, 
    {
      label: '(B07)石油和天然气开采业',
      children: [
        {
        label: '(B0710)石油开采'
      },
      {
        label: '(B0720)天然气开采'
      },
    ]
    },
    {
      label: '(B08)黑色金属矿采选业',
      children: [
        {
        label: '(B0810)铁矿采选'
      },
      {
        label: '(B0820)锰矿、铬矿采选'
      },
      {
        label: '(B0890)其他黑色金属矿采选'
      },
    ]
    },
    {
      label: '(B09)有色金属矿采选业',
      children: [
        {
        label: '(B091)常用有色金属矿采选',
        children: [
          {
          label: '(B0911)铜矿采选'
        },
        {
          label: '(B0912)铅锌矿采选'
        },
        {
          label: '(B0913)镍钴矿采选'
        },
        {
          label: '(B0914)锡矿采选'
        },
        {
          label: '(B0915)锑矿采选'
        },
        {
          label: '(B0916)铝矿采选'
        },
        {
          label: '(B0917)镁矿采选'
        },
        {
          label: '(B0919)其他常用有色金属矿采选'
        },
      ]
      },
    ]
    },
    {
      label: '(B10)非金属矿采选业',
      children: [
        {
        label: '(B101)土砂石开采',
        children: [
          {
            label:'(B1011)石灰石、石膏开采'
          },
          {
            label:'(B1012)建筑装饰用石开采'
          },
          {
            label:'(B1013)耐火土石开采'
          },
        ]
      },
      {
        label:'(B1020)化学矿开采'
      },
      {
        label:'(B1030)采盐'
      },
      {
        label: '(B109)石棉及其他非金属矿采选',
        children: [
          {
          label: '(B1091)石棉、云母矿采选'
        },
        {
          label: '(B1092)石墨、滑石采选'
        },
        {
          label: '(B1093)宝石、玉石采选'
        },
        {
          label: '(B1099)其他未列明非金属矿采选'
        },
      ]
      },
    ]
    },
    {
      label: '(B12)其他采矿业',
      children: [{
        label: '(B1200)其他采矿业'
      }]
    },
  ]
  }, 
  {
    label: '(C)制造业',
    children: [{
      label: '(C13)农副食品加工业',
      children: [
      {
        label: '(C1320)饲料加工'
      },
      {
        label: '(C133)植物油加工',
           children: [
        {
        label: '(C1331)食用植物油加工'
      },
      {
        label: '(C1332)非食用植物油加工'
      },
    ]
      },
      {
        label: '(C1340)制糖业'
      },
      {
        label: '(C135)屠宰及肉类加工',
           children: [
        {
        label: '(C1351)牲畜屠宰'
      },
      {
        label: '(C1352)禽类屠宰'
      },
      {
        label: '(C1353)肉制品及副产品加工'
      },
    ]
      },
      {
        label: '(C136)水产品加工',
           children: [
        {
        label: '(C1361)水产品冷冻加工'
      },
      {
        label: '(C1362)鱼糜制品及水产品干腌制加工'
      },
      {
        label: '(C1363)水产饲料制造'
      },
      {
        label: '(C1364)鱼油提取及制品制造'
      },
      {
        label: '(C1369)其他水产品加工'
      },
    ]
      },
      {
        label: '(C137)蔬菜、水果和坚果加工',
           children: [
        {
        label: '(C1371)蔬菜加工'
      },
      {
        label: '(C1372)水果和坚果加工'
      },
    
    ]
      },
      {
        label: '(C139)其他农副食品加工',
      },
    ]
    },
     {
      label: '(C14)食品制造业',
      children: [
        {
        label: '(C141)焙烤食品制造',
        children: [
          {
          label: '(C1411)糕点、面包制造'
        },
      ]
      },
      {
        label: '(C142)糖果、巧克力及蜜饯制造',
        children: [
          {
          label: '(C1421)糖果、巧克力制造'
        },
        {
          label: '(C1422)蜜饯制作'
        },
      ]
      },
      {
        label: '(C143)方便食品制造',
      },
      {
        label: '(C1440)乳制品制造'
      },
      {
        label: '(C145)罐头食品制造',
      },
      {
        label: '(C146)调味品、发酵制品制造',
      },
      {
        label: '(C149)其他食品制造',
        children: [
        {
          label: '(C1494)盐加工'
        },
      ]
      },
    ]
    },
    {
      label: '(C15)酒、饮料和精制茶制造业',
      children: [
        {
        label: '(C151)酒的制造',
        children: [
          {
          label: '(C1511)酒精制造'
        },
        {
          label: '(C1512)白酒制造'
        },
        {
          label: '(C1513)啤酒制造'
        },
        {
          label: '(C1514)黄酒制造'
        },
        {
          label: '(C1515)葡萄酒制造'
        },
        {
          label: '(C1519)其他酒制造'
        },
      ]
      },
      {
        label: '(C152)饮料制造',
        children: [
          {
          label: '(C1521)碳酸饮料制造'
        },
        {
          label: '(C1522)瓶（罐）装饮用水制造'
        },
        {
          label: '(C1523)果菜汁及果菜汁饮料制造'
        },
      ]
      },
    ]
    },
    {
      label: '(C16)烟草制品业',
      children: [
        {
          label: '(C1610)烟叶复烤'
        },
        {
          label: '(C1620)卷烟制造'
        },
        {
          label: '(C1690)其他烟草制品制造'
        },
    ]
    },
    {
      label: '(C17)纺织业',
      children: [
        {
        label: '(C171)棉纺织及印染精加工',
        children: [
          {
          label: '(C1711)棉纺纱加工'
        },
        {
          label: '(C1712)棉织造加工'
        },
        {
          label: '(C1713)棉印染精加工'
        },
      ]
      },
      {
        label: '(C172)毛纺织及染整精加工',
        children: [
          {
          label: '(C1721)毛条和毛纱线加工'
        },
        {
          label: '(C1722)毛织造加工'
        },
        {
          label: '(C1723)毛染整精加工'
        },
      ]
      },
      {
        label: '(C173)麻纺织及染整精加工',
        children: [
          {
          label: '(C1731)麻纤维纺前加工和纺纱'
        },
        {
          label: '(C1732)麻织造加工'
        },
        {
          label: '(C1733)麻染整精加工'
        },
      ]
      },
      {
        label: '(C174)丝绢纺织及印染精加工',
        children: [
          {
          label: '(C1741)缫丝加工'
        },
        {
          label: '(C1742)绢纺和丝织加工'
        },
        {
          label: '(C1743)丝印染精加工'
        },
      ]
      },
    ]
    },
    {
      label: '(C18)纺织服装、服饰业',
      children: [
        {
        label: '(C1810)机织服装制造'
      },

      {
        label: '(C1830)服饰制造'
      },
    ]
    },
    {
      label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
      children: [
        {
        label: '(C1910)皮革鞣制加工'
      },
      {
        label: '(C192)皮革制品制造',
        children: [
          {
          label: '(C1921)皮革服装制造'
        },
        {
          label: '(C1922)皮箱、包（袋）制造'
        },
        {
          label: '(C1923)皮手套及皮装饰制品制造'
        },
        {
          label: '(C1929)其他皮革制品制造'
        },
      ]
      },
    ]
    },
    {
      label: '(C20)木材加工和木、竹、藤、棕、草制品业',
      children: [
        {
        label: '(C201)木材加工',
        children: [
          {
          label: '(C2011)锯材加工'
        },
        {
          label: '(C2012)木片加工'
        },
      ]
      },
      {
        label: '(C202)人造板制造',
      },
      {
        label: '(C203)木制品制造',
      },
      {
        label: '(C204)竹、藤、棕、草等制品制造',
        children: [
          {
          label: '(C2041)竹制品制造'
        },
        {
          label: '(C2042)藤制品制造'
        },
      ]
      },
    ]
    },
    {
      label: '(C21)家具制造业',
      children: [
        {
        label: '(C2110)木质家具制造'
      },
      {
        label: '(C2120)竹、藤家具制造'
      },
      {
        label: '(C2130)金属家具制造'
      },
      {
        label: '(C2140)塑料家具制造'
      },
      {
        label: '(C2190)其他家具制造'
      },
    ]
    },
    {
      label: '(C22)造纸和纸制品业',
      children: [  
           {
        label: '(C221)纸浆制造',
      },
      {
        label: '(C222)造纸',
      },
      {
        label: '(C223)纸制品制造',
      },
    ]
    },
    {
      label: '(C23)印刷和记录媒介复制业',
      children: [
        {
          label: '(C231)印刷',
          children: [
            {
            label: '(C2311)书、报刊印刷'
          },
          {
            label: '(C2319)包装装潢及其他印刷'
          },
        ]
        },
        {
          label: '(C2330)记录媒介复制'
        },
      ]
    },
    {
      label: '(C24)文教、工美、体育和娱乐用品制造业',
      children: [
        {
          label: '(C241)文教办公用品制造',
          children: [
            {
            label: '(C2411)文具制造'
          },
          {
            label: '(C2412)笔的制造'
          },
        ]
        },
        {
          label: '(C243)工艺美术品制造',
        },
        {
          label: '(C244)体育用品制造',
        },
      ]
    },
    {
      label: '(C25)石油加工、炼焦和核燃料加工业',
      children: [
        {
          label: '(C251)精炼石油产品制造',
          children: [
            {
            label: '(C2511)原油加工及石油制品制造'
          },
          {
            label: '(C2512)人造原油制造'
          },
        ]
        },
        {
          label: '(C2520)炼焦'
        },
      ]
    },
    {
      label: '(C26)化学原料和化学制品制造业',
      children: [
        {
          label: '(C261)基础化学原料制造',
          children: [
            {
            label: '(C2611)无机酸制造'
          },
          {
            label: '(C2612)无机碱制造'
          },
          {
            label: '(C2613)无机盐制造'
          },
          {
            label: '(C2614)有机化学原料制造'
          },
        ]
        },
        {
          label: '(C262)肥料制造',
          children: [
            {
            label: '(C2621)氮肥制造'
          },
          {
            label: '(C2622)磷肥制造'
          },
          {
            label: '(C2623)钾肥制造'
          },
          {
            label: '(C2624)复混肥料制造'
          },
        ]
        },
        {
          label: '(C263)农药制造',
          children: [
            {
            label: '(C2631)化学农药制造'
          },
          {
            label: '(C2632)生物化学农药及微生物农药制造'
          },
        ]
        },
       
        {
          label: '(C268)日用化学产品制造',
          children: [
            {
            label: '(C2681)肥皂及合成洗涤剂制造'
          },
          {
            label: '(C2682)化妆品制造'
          },
          {
            label: '(C2683)口腔清洁用品制造'
          },
          {
            label: '(C2684)香料、香精制造'
          },
        ]
        },
                  
      ]
    },
    {
      label: '(C27)医药制造业',
      children: [
        {
        label: '(C2710)化学药品原料药制造'
      },
      {
        label: '(C2720)化学药品制剂制造'
      },
      {
        label: '(C2730)中药饮片加工'
      },
      {
        label: '(C2740)中成药生产'
      },
      {
        label: '(C2750)兽用药品制造'
      },
      {
        label: '(C2760)生物药品制造'
      },
      {
        label: '(C2770)卫生材料及医药用品制造'
      },
    ]
    },
    {
      label: '(C28)化学纤维制造业',
      children: [
        {
          label: '(C281)纤维素纤维原料及纤维制造',
          children: [
            {
            label: '(C2811)化纤浆粕制造'
          },
          {
            label: '(C2812)人造纤维（纤维素纤维）制造'
          },
        ]
        },
      ]
    },
    {
      label: '(C29)橡胶和塑料制品业',
      children: [
        {
          label: '(C291)橡胶制品业',
          children: [
            {
            label: '(C2911)轮胎制造'
          },
          {
            label: '(C2912)橡胶板、管、带制造'
          },
          {
            label: '(C2915)日用及医用橡胶制品制造'
          },
        ]
        },
        {
          label: '(C292)塑料制品业',
          children: [
            {
            label: '(C2921)塑料薄膜制造'
          },
          {
            label: '(C2922)塑料板、管、型材制造'
          },
          {
            label: '(C2923)塑料丝、绳及编织品制造'
          },
          {
            label: '(C2924)泡沫塑料制造'
          },
          {
            label: '(C2925)塑料人造革、合成革制造'
          },
          {
            label: '(C2926)塑料包装箱及容器制造'
          },
          {
            label: '(C2927)日用塑料制品制造'
          },
          {
            label: '(C2928)塑料零件制造'
          },
          {
            label: '(C2929)其他塑料制品制造'
          },
        ]
        },
    
      ]
    },
    {
      label: '(C30)非金属矿物制品业',
      children: [
        {
          label: '(C301)水泥、石灰和石膏制造',
          children: [
            {
            label: '(C3011)水泥制造'
          }, 
        ]
        },
        {
          label: '(C302)石膏、水泥制品及类似制品制造',
        },
        {
          label: '(C303)砖瓦、石材等建筑材料制造',
          children: [
          {
            label: '(C3032)建筑陶瓷制品制造'
          },
          {
            label: '(C3033)建筑用石加工'
          },
          {
            label: '(C3035)隔热和隔音材料制造'
          },
          {
            label: '(C3039)其他建筑材料制造'
          },
        ]
        },
        {
          label: '(C304)玻璃制造',
          children: [
            {
            label: '(C3041)平板玻璃制造'
          },
        ]
        },
        {
          label: '(C305)玻璃制品制造',
          children: [
            {
            label: '(C3051)技术玻璃制品制造'
          },  {
            label: '(C3052)光学玻璃制造'
          },
          {
            label: '(C3054)日用玻璃制品制造'
          },
          {
            label: '(C3056)玻璃保温容器制造'
          },
          {
            label: '(C3057)制镜及类似品加工'
          },
        ]
        },
        {
          label: '(C306)玻璃纤维和玻璃纤维增强塑料制品制造',
        },
      ]
    },
    {
      label: '(C31)黑色金属冶炼和压延加工业',
      children: [
        {
        label: '(C3110)炼铁'
      },
      {
        label: '(C3120)炼钢'
      },
      {
        label: '(C3140)钢压延加工'
      },
      {
        label: '(C3150)铁合金冶炼'
      },
    ]
    },
    {
      label: '(C32)有色金属冶炼和压延加工业',
      children: [
        {
          label: '(C321)常用有色金属冶炼',
          children: [
            {
            label: '(C3211)铜冶炼'
          },
          {
            label: '(C3212)铅锌冶炼'
          },
          {
            label: '(C3213)镍钴冶炼'
          },
          {
            label: '(C3214)锡冶炼'
          },
          {
            label: '(C3215)锑冶炼'
          },
          {
            label: '(C3216)铝冶炼'
          },
          {
            label: '(C3217)镁冶炼'
          },
          {
            label: '(C3219)其他常用有色金属冶炼'
          },
        ]
        },
        {
          label: '(C322)贵金属冶炼',
          children: [
            {
            label: '(C3221)金冶炼'
          },
          {
            label: '(C3222)银冶炼'
          },
          {
            label: '(C3229)其他贵金属冶炼'
          },
        ]
        },
        {
          label: '(C323)稀有稀土金属冶炼',
          children: [
            {
            label: '(C3231)钨钼冶炼'
          },
          {
            label: '(C3232)稀土金属冶炼'
          },
          {
            label: '(C3239)其他稀有金属冶炼'
          },
        ]
        },
        {
          label: '(C3240)有色金属合金制造',
        },
        {
          label: '(C3250)有色金属铸造',
        },
        {
          label: '(C326)有色金属压延加工',
          children: [
            {
            label: '(C3261)铜压延加工'
          },
          {
            label: '(C3262)铝压延加工'
          },
          {
            label: '(C3263)贵金属压延加工'
          },
          {
            label: '(C3264)稀有稀土金属压延加工'
          },
          {
            label: '(C3269)其他有色金属压延加工'
          },
        ]
        },
  
      ]
    },
    {
      label: '(C33)金属制品业',
      children: [
        {
          label: '(C331)结构性金属制品制造',
          children: [
            {
            label: '(C3311)金属结构制造'
          },
          {
            label: '(C3312)金属门窗制造'
          },
        ]
        },
        {
          label: '(C332)金属工具制造',
          children: [
            {
            label: '(C3321)切削工具制造'
          },
          {
            label: '(C3322)手工具制造'
          },
        ]
        },
        {
          label: '(C333)集装箱及金属包装容器制造',
        },
       
        {
          label: '(C335)建筑、安全用金属制品制造',
          children: [
          {
            label: '(C3352)建筑装饰及水暖管道零件制造'
          },
        ]
        },
        {
          label: '(C337)搪瓷制品制造',
        },             
      ]
    },
    {
      label: '(C34)通用设备制造业',
      children: [
        {
          label: '(C341)锅炉及原动设备制造',
          children: [
            {
            label: '(C3411)锅炉及辅助设备制造'
          },
          {
            label: '(C3412)内燃机及配件制造'
          },
          {
            label: '(C3413)汽轮机及辅机制造'
          },
          {
            label: '(C3414)水轮机及辅机制造'
          },
        ]
        },{
          label: '(C342)金属加工机械制造',
          children: [
            {
            label: '(C3421)金属切削机床制造'
          },
          {
            label: '(C3422)金属成形机床制造'
          },
          {
            label: '(C3423)铸造机械制造'
          },
          {
            label: '(C3425)机床附件制造'
          },
        ]
        },
        {
          label: '(C344)泵、阀门、压缩机及类似机械制造',
          children: [
            {
            label: '(C3441)泵及真空设备制造'
          },
          {
            label: '(C3442)气体压缩机械制造'
          },
          {
            label: '(C3443)阀门和旋塞制造'
          },
        ]
        },
        {
          label: '(C345)轴承、齿轮和传动部件制造',
          children: [
            {
            label: '(C3451)轴承制造'
          },
        ]
        },
        {
          label: '(C346)烘炉、风机、衡器、包装等设备制造',
          children: [
          {
            label: '(C3462)风机、风扇制造'
          },
          {
            label: '(C3463)气体、液体分离及纯净设备制造'
          },
          {
            label: '(C3464)制冷、空调设备制造'
          },
          {
            label: '(C3465)风动和电动工具制造'
          },
        ]
        },
        {
          label: '(C347)文化、办公用机械制造',
          children: [
            {
            label: '(C3471)电影机械制造'
          },
          {
            label: '(C3472)幻灯及投影设备制造'
          },
          {
            label: '(C3473)照相机及器材制造'
          },
          {
            label: '(C3474)复印和胶印设备制造'
          },
          {
            label: '(C3479)其他文化、办公用机械制造'
          },
        ]
        },
        {
          label: '(C348)通用零部件制造',
        },
        {
          label: '(C3490)其他通用设备制造业',
        },
      ]
    },
    {
      label: '(C35)专用设备制造业',
      children: [
        {
          label: '(C351)采矿、冶金、建筑专用设备制造',
        },
        {
          label: '(C352)化工、木材、非金属加工专用设备制造',
          children: [
            {
            label: '(C3521)炼油、化工生产专用设备制造'
          },
          {
            label: '(C3522)橡胶加工专用设备制造'
          },
          {
            label: '(C3523)塑料加工专用设备制造'
          },
          {
            label: '(C3524)木材加工机械制造'
          },
          {
            label: '(C3525)模具制造'
          },
          {
            label: '(C3529)其他非金属加工专用设备制造'
          },
        ]
        },
        {
          label: '(C354)印刷、制药、日化及日用品生产专用设备制造',
          children: [
          {
            label: '(C3542)印刷专用设备制造'
          },
        ]
        },
        {
          label: '(C355)纺织、服装和皮革加工专用设备制造',
        },
        {
          label: '(C357)农、林、牧、渔专用机械制造',
          children: [
            {
            label: '(C3571)拖拉机制造'
          },
          {
            label: '(C3572)机械化农业及园艺机具制造'
          },
          {
            label: '(C3573)营林及木竹采伐机械制造'
          },
          {
            label: '(C3574)畜牧机械制造'
          },
          {
            label: '(C3575)渔业机械制造'
          },
          {
            label: '(C3576)农林牧渔机械配件制造'
          },
          {
            label: '(C3579)其他农、林、牧、渔业机械制造'
          },
        ]
        },
        {
          label: '(C358)医疗仪器设备及器械制造',
        },
        {
          label: '(C359)环保、社会公共服务及其他专用设备制造',
          children: [
          {
            label: '(C3596)交通安全、管制及类似专用设备制造'
          },
        ]
        },
      ]
    },
    {
      label: '(C36)汽车制造业',
      children: [
        {
        label: '(C3610)汽车整车制造'
      },
      {
        label: '(C3620)改装汽车制造'
      },
      {
        label: '(C3640)电车制造'
      },  {
        label: '(C3650)汽车车身、挂车制造'
      }, 
       {
        label: '(C3660)汽车零部件及配件制造'
      },
    ]
    },
    {
      label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
      children: [
        {
          label: '(C371)铁路运输设备制造',
          children: [
            {
            label: '(C3711)铁路机车车辆及动车组制造'
          },
          {
            label: '(C3713)铁路机车车辆配件制造'
          },
          {
            label: '(C3714)铁路专用设备及器材、配件制造'
          },
        ]
        },
        {
          label: '(C373)船舶及相关装置制造',
          children: [
            {
            label: '(C3731)金属船舶制造'
          },
          {
            label: '(C3732)非金属船舶制造'
          },
  
        ]
        },
        {
          label: '(C374)航空、航天器及设备制造',
          children: [
          {
            label: '(C3742)航天器制造'
          },
        ]
        },
        {
          label: '(C375)摩托车制造',
          children: [
            {
            label: '(C3751)摩托车整车制造'
          },
          {
            label: '(C3752)摩托车零部件及配件制造'
          },
        ]
        },
        {
          label: '(C376)自行车制造',
        },
      ]
    },
    {
      label: '(C38)电气机械和器材制造业',
      children: [
        {
          label: '(C381)电机制造',
          children: [
            {
            label: '(C3811)发电机及发电机组制造'
          },
          {
            label: '(C3812)电动机制造'
          },
          {
            label: '(C3819)微电机及其他电机制造'
          },
        ]
        },
        {
          label: '(C382)输配电及控制设备制造',
          children: [
            {
            label: '(C3821)变压器、整流器和电感器制造'
          },
          {
            label: '(C3822)电容器及其配套设备制造'
          },
          {
            label: '(C3823)配电开关控制设备制造'
          },
          {
            label: '(C3824)电力电子元器件制造'
          },
        ]
        },
        {
          label: '(C383)电线、电缆、光缆及电工器材制造',
          children: [
            {
            label: '(C3831)电线、电缆制造'
          },
          {
            label: '(C3833)绝缘制品制造'
          },
          {
            label: '(C3839)其他电工器材制造'
          },
        ]
        },
        {
          label: '(C385)家用电力器具制造',
          children: [
          {
            label: '(C3852)家用空气调节器制造'
          },
          {
            label: '(C3853)家用通风电器具制造'
          },
          {
            label: '(C3855)家用清洁卫生电器具制造'
          },
        ]
        },
        {
          label: '(C387)照明器具制造',
          children: [
            {
            label: '(C3871)电光源制造'
          },
          {
            label: '(C3872)照明灯具制造'
          },
          {
            label: '(C3879)灯用电器附件及其他照明器具制造'
          },
        ]
        },
        {
          label: '(C389)其他电气机械及器材制造',
        },
    
      ]
    },
    {
      label: '(C39)计算机、通信和其他电子设备制造业',
      children: [
        {
          label: '(C391)计算机制造',
          children: [
            {
            label: '(C3911)计算机整机制造'
          },
          {
            label: '(C3912)计算机零部件制造'
          },
          {
            label: '(C3913)计算机外围设备制造'
          },
          {
            label: '(C3919)其他计算机制造'
          },
        ]
        },
        {
          label: '(C392)通信设备制造',
        },
        {
          label: '(C393)广播电视设备制造',
          children: [
            {
            label: '(C3931)广播电视节目制作及发射设备制造'
          },
          {
            label: '(C3932)广播电视接收设备及器材制造'
          },
          {
            label: '(C3939)应用电视设备及其他广播电视设备制造'
          },
        ]
        },
        {
          label: '(C3940)雷达及配套设备制造',
        },
        {
          label: '(C395)视听设备制造',
          children: [
            {
            label: '(C3951)电视机制造'
          },
          {
            label: '(C3953)影视录放设备制造'
          },
        ]
        },
        {
          label: '(C396)电子器件制造',
          children: [
            {
            label: '(C3961)电子真空器件制造'
          },
          {
            label: '(C3962)半导体分立器件制造'
          },
          {
            label: '(C3963)集成电路制造'
          },
        ]
        },
        {
          label: '(C397)电子元件制造',
          children: [
            {
            label: '(C3971)电子元件及组件制造'
          },
        ]
        },
    
      ]
    },
    {
      label: '(C40)仪器仪表制造业',
      children: [
        {
          label: '(C401)通用仪器仪表制造',
          children: [
            {
            label: '(C4011)工业自动控制系统装置制造'
          },
          {
            label: '(C4012)电工仪器仪表制造'
          },
          {
            label: '(C4013)绘图、计算及测量仪器制造'
          },
          {
            label: '(C4014)实验分析仪器制造'
          },
          {
            label: '(C4015)试验机制造'
          },
        ]
        },
        {
          label: '(C402)专用仪器仪表制造',
          children: [
            {
            label: '(C4021)环境监测专用仪器仪表制造'
          },
          {
            label: '(C4023)导航、气象及海洋专用仪器制造'
          },
          {
            label: '(C4026)教学专用仪器制造'
          },
          {
            label: '(C4028)电子测量仪器制造'
          },
        ]
        },
        {
          label: '(C4030)钟表与计时仪器制造',
        },
      ]
    },
  ]
  },
  {
    label: '(D)电力、热力、燃气及水生产和供应业',
    children: [
      {
      label: '(D44)电力、热力生产和供应业',
      children: [
        {
        label: '(D441)电力生产',
        children: [
          {
          label: '(D4411)火力发电'
        },
        {
          label: '(D4412)水力发电'
        },
        {
          label: '(D4413)核力发电'
        },
      ]
      },
      {
        label: '(D4420)电力供应',
      },
    ]
    }, 
    {
      label: '(D45)燃气生产和供应业',
      children: [
        {
        label: '(D4500)燃气生产和供应业'
      }]
    },
    {
      label: '(D46)水的生产和供应业',
    }]
  },
  {
    label: '(E)建筑业',
    children: [
      {
      label: '(E47)房屋建筑业',
      children: [{
        label: '(E4700)房屋建筑业'
      }]
    },
    {
      label: '(E48)土木工程建筑业',
      children: [
        {
          label: '(E481)铁路、道路、隧道和桥梁工程建筑',
          children: [
            {
            label: '(E4811)铁路工程建筑'
          },
          {
            label: '(E4812)公路工程建筑'
          },
          {
            label: '(E4819)其他道路、隧道和桥梁工程建筑'
          },
        ]
        },
        {
          label: '(E482)水利和内河港口工程建筑',
          children: [
          {
            label: '(E4823)港口及航运设施工程建筑'
          },
        ]
        },
      ]
    },
    {
      label: '(E49)建筑安装业',
      children: [
        {
          label: '(E4910)电气安装'
        },
        {
          label: '(E4920)管道和设备安装'
        },
        {
          label: '(E4990)其他建筑安装业'
        },
      ]
    },]
  },
  {
    label: '(F)批发和零售业',
    children: [{
      label: '(F51)批发业',
      children: [
        {
          label: '(F511)农、林、牧产品批发',
          children: [
            {
            label: '(F5111)谷物、豆及薯类批发'
          },
          {
            label: '(F5112)种子批发'
          },
        ]
        },
        {
          label: '(F512)食品、饮料及烟草制品批发',
          children: [
            {
            label: '(F5121)米、面制品及食用油批发'
          },
          {
            label: '(F5124)肉、禽、蛋、奶及水产品批发'
          },
          {
            label: '(F5128)烟草制品批发'
          },
          {
            label: '(F5129)其他食品批发'
          },
        ]
        },
        {
          label: '(F513)纺织、服装及家庭用品批发',
        },
        {
          label: '(F514)文化、体育用品及器材批发',
          children: [
            {
            label: '(F5141)文具用品批发'
          },
          {
            label: '(F5142)体育用品及器材批发'
          },
          {
            label: '(F5143)图书批发'
          },
          {
            label: '(F5144)报刊批发'
          },
        ]
        },
        {
          label: '(F515)医药及医疗器材批发',
          children: [
            {
            label: '(F5151)西药批发'
          },
          {
            label: '(F5152)中药批发'
          },
          {
            label: '(F5153)医疗用品及器材批发'
          },
        ]
        },
        {
          label: '(F516)矿产品、建材及化工产品批发',
          children: [
            {
            label: '(F5161)煤炭及制品批发'
          },
          {
            label: '(F5162)石油及制品批发'
          },
          {
            label: '(F5164)金属及金属矿批发'
          },
          {
            label: '(F5165)建材批发'
          },
          {
            label: '(F5169)其他化工产品批发'
          },
        ]
        },
        {
          label: '(F517)机械设备、五金产品及电子产品批发',
          children: [
          {
            label: '(F5172)汽车批发'
          },
          {
            label: '(F5173)汽车零配件批发'
          },
          {
            label: '(F5174)摩托车及零配件批发'
          },
          {
            label: '(F5179)其他机械设备及电子产品批发'
          },
        ]
        },

        {
          label: '(F519)其他批发业',
          children: [
            {
            label: '(F5191)再生物资回收与批发'
          },
        ]
        },
    
      ]
    },
    {
      label: '(F52)零售业',
      children: [
        {
          label: '(F521)综合零售',
        },
        {
          label: '(F522)食品、饮料及烟草制品专门零售',
          children: [
            {
            label: '(F5221)粮油零售'
          },
          {
            label: '(F5227)烟草制品零售'
          },{
            label: '(F5229)其他食品零售'
          },
        ]
        },
        {
          label: '(F523)纺织、服装及日用品专门零售',
        },
        {
          label: '(F524)文化、体育用品及器材专门零售',
          children: [
            {
            label: '(F5241)文具用品零售'
          },
          {
            label: '(F5242)体育用品及器材零售'
          },
          {
            label: '(F5243)图书、报刊零售'
          },
        ]
        },
        {
          label: '(F525)医药及医疗器材专门零售',
          children: [
            {
            label: '(F5251)药品零售'
          },
          {
            label: '(F5252)医疗用品及器材零售'
          },
        ]
        },
        {
          label: '(F526)汽车、摩托车、燃料及零配件专门零售',
          children: [
            {
            label: '(F5261)汽车零售'
          },
          {
            label: '(F5262)汽车零配件零售'
          },
          {
            label: '(F5263)摩托车及零配件零售'
          },
  
        ]
        },
      ]
    },
     {
      label: '(F53)商业贸易',
  }]
  },
  {
    label: '(G)交通运输、仓储和邮政业',
    children: [
      {
      label: '(G53)铁路运输业',
      children: [
        {
        label: '(G5310)铁路旅客运输'
      },
      {
        label: '(G5320)铁路货物运输'
      },
    ]
    },
    {
      label: '(G54)道路运输业',
      children: [
        {
          label: '(G541)城市公共交通运输',
          children: [
            {
            label: '(G5411)公共电汽车客运'
          },
          {
            label: '(G5412)城市轨道交通'
          },
          {
            label: '(G5413)出租车客运'
          },
          {
            label: '(G5419)其他城市公共交通运输'
          },
        ]
        },
        {
          label: '(G5420)公路旅客运输'
        },
  
        {
          label: '(G5430)道路货物运输'
        },

      ]
    },
    {
      label: '(G55)水上运输业',
      children: [
        {
          label: '(G551)水上旅客运输',
          children: [
            {
            label: '(G5511)海洋旅客运输'
          },
          {
            label: '(G5512)内河旅客运输'
          },
          {
            label: '(G5513)客运轮渡运输'
          },
        ]
        },
        {
          label: '(G552)水上货物运输',
          children: [
            {
            label: '(G5521)远洋货物运输'
          },
          {
            label: '(G5522)沿海货物运输'
          },
          {
            label: '(G5523)内河货物运输'
          },
        ]
        },
        {
          label: '(G553)水上运输辅助活动',
          children: [
            {
            label: '(G5531)客运港口'
          },
        ]
        },
      
      ]
    },
    {
      label: '(G56)航空运输业',
      children: [
        {
          label: '(G561)航空客货运输',
          children: [
            {
            label: '(G5611)航空旅客运输'
          },
          {
            label: '(G5612)航空货物运输'
          },
        ]
        },
      ]
    },
    {
      label: '(G59)仓储业',
      children: [
        {
          label: '(G591)谷物、棉花等农产品仓储',
          children: [
            {
            label: '(G5911)谷物仓储'
          },
          {
            label: '(G5912)棉花仓储'
          },
          {
            label: '(G5919)其他农产品仓储'
          },
        ]
        },
        {
          label: '(G5990)其他仓储业'
        },
      ]
    },
    ]
  },
  {
    label: '(H)住宿和餐饮业',
    children: [{
      label: '(H61)住宿业',
      children: [
        {
        label: '(H6110)旅游饭店'
      },
      {
        label: '(H6120)一般旅馆'
      },
    ]
    }, {
      label: '(H62)餐饮业',
      children: [
        {
        label: '(H6210)正餐服务'
      },
      {
        label: '(H6220)快餐服务'
      },
      {
        label: '(H623)饮料及冷饮服务',
        children: [
        {
          label: '(H6239)其他饮料及冷饮服务'
        },
      ]
      },
      {
        label: '(H629)其他餐饮业',
      },
    ]
    }]
  },
  {
    label: '(I)信息传输、软件和信息技术服务业',
    children: [
      {
      label: '(I63)电信、广播电视和卫星传输服务',
      children: [
        {
          label: '(I631)电信',
          children: [
            {
            label: '(I6311)固定电信服务'
          },
          {
            label: '(I6312)移动电信服务'
          },
          {
            label: '(I6319)其他电信服务'
          },
        ]
        },
        
      ]
    }, 
    {
      label: '(I65)软件和信息技术服务业',
    }]
  },
  {
    label: '(K)房地产业',
    children: [{
      label: '(K70)房地产业',
      children: [
        {
          label: '(K7010)房地产开发经营'
        },
        {
          label: '(K7020)物业管理'
        },
        {
          label: '(K7030)房地产中介服务'
        },
        {
          label: '(K7040)自有房地产经营活动'
        },
        {
          label: '(K7090)其他房地产业'
        },
  
      ]
    }, ]
  },  {
    label: '(L)租赁和商务服务业',
    children: [ {
      label: '(L72)商务服务业',
      children: [
        {
          label: '(L723)咨询与调查',
          children: [
          {
            label: '(L7233)社会经济咨询'
          },
        ]
        },
      ]
    }]
  },
  {
    label: '(M)科学研究和技术服务业',
    children: [
      {
        label: '(M747)地质勘查',
      },
      {
        label: '(M748)工程技术',
        children: [
        {
          label: '(M7482)工程勘察设计'
        },
        {
          label: '(M7483)规划管理'
        },
      ]
      },
     {
      label: '(N77)生态保护和环境治理业',
      children: [
        {
          label: '(N771)生态保护',
          children: [
            {
            label: '(N7711)自然保护区管理'
          },
          {
            label: '(N7712)野生动物保护'
          },
          {
            label: '(N7713)野生植物保护'
          },
          {
            label: '(N7719)其他自然保护'
          },
        ]
        },
        {
          label: '(N772)环境治理业',
          children: [
            {
            label: '(N7721)水污染治理'
          },
          {
            label: '(N7722)大气污染治理'
          },
          {
            label: '(N7723)固体废物治理'
          },
          {
            label: '(N7724)危险废物治理'
          },
          {
            label: '(N7725)放射性废物治理'
          },
          {
            label: '(N7729)其他污染治理'
          },
        ]
        },
      ]
    },
    {
      label: '(N78)公共设施管理业',
      children: [
        {
          label: '(N7810)市政设施管理'
        },
        {
          label: '(N7840)绿化管理'
        },
        {
          label: '(N785)公园和游览景区管理',
          children: [
          {
            label: '(N7852)游览景区管理'
          },
        ]
        },
      ]
    },
  ]
  },
  {
    label: '(Q)卫生和社会工作',
    children: [ {
      label: '(Q84)社会工作',
    }]
  },
  {
    label: '(R)文化、体育和娱乐业',
    children: [
    {
      label: '(R87)文化艺术业',
    },
  ]
  },
]
let data2=[

]
let data3=[

]
let data4=[
 
]

let data5=[
  {
    label: '(B)采矿业',
    children: [
    {
      label: '(B07)石油和天然气开采业',
    },
    {
      label: '(B08)黑色金属矿采选业',
      children: [
      {
        label: '(B0890)其他黑色金属矿采选'
      },
    ]
    },
    {
      label: '(B09)有色金属矿采选业',
    },
    {
      label: '(B10)非金属矿采选业',
    },
    {
      label: '(B11)开采辅助活动',
    },
  ]
  }, 
  {
    label: '(B12)其他采矿业',
    children: [{
      label: '(B1200)其他采矿业'
    }]
  },
    {
      label: '(C)制造业',
      children: [{
        label: '(C13)农副食品加工业',
      },
      {
        label: '(C14)食品制造业',
      },
      {
        label: '(C15)酒、饮料和精制茶制造业',
      },
      {
        label: '(C16)烟草制品业',
      },
      {
        label: '(C17)纺织业',
       
      },
      {
        label: '(C18)纺织服装、服饰业',
      },
      {
        label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
      },
      {
        label: '(C20)木材加工和木、竹、藤、棕、草制品业',
      },
      {
        label: '(C21)家具制造业',
      },
      {
        label: '(C22)造纸和纸制品业',
      },
      {
        label: '(C23)印刷和记录媒介复制业',
      },
      {
        label: '(C24)文教、工美、体育和娱乐用品制造业',
      },
      {
        label: '(C25)石油加工、炼焦和核燃料加工业',
      },
       {
    label: '(C26)化学原料和化学制品制造业',
  },
   {
    label: '(C27)医药制造业',
  },
    {
    label: '(C28)化学纤维制造业',
  },
  {
    label: '(C29)橡胶和塑料制品业',
  },
  {
    label: '(C30)非金属矿物制品业',
  },
    {
    label: '(C31)黑色金属冶炼和压延加工业',
  },
    {
    label: '(C32)有色金属冶炼和压延加工业',
  },
  {
    label: '(C33)金属制品业',
  },
   {
    label: '(C34)通用设备制造业',
  },
  {
    label: '(C35)专用设备制造业',
  },
  {
    label: '(C36)汽车制造业',
  },
  {
    label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
  },
   {
    label: '(C39)计算机、通信和其他电子设备制造业',
  },
  {
    label: '(C40)仪器仪表制造业',
  },
  {
    label: '(C41)其他制造业',
  },
{
    label: '(C42)废弃资源综合利用业',
  },
  {
    label: '(C43)金属制品、机械和设备修理业',
  }
    ]
    
  },
  {
    label: '(D)电力、热力、燃气及水生产和供应业',
    children: [
      {
      label: '(D44)电力、热力生产和供应业',
    }, 
    {
      label: '(D45)燃气生产和供应业',
    },
    {
      label: '(D46)水的生产和供应业',
    }]},
    {
      label: '(E)建筑业',
      children: [
        {
        label: '(E47)房屋建筑业',
      },
      {
        label: '(E48)土木工程建筑业',
      },
      {
        label: '(E49)建筑安装业',
      },
       {
        label: '(E50)建筑装饰和其他建筑业',
      }]
    },
    {
      label: '(F)批发和零售业',
      children: [{
        label: '(F51)批发业',
      },
      {
        label: '(F52)零售业',
      },]
    },
   
    {
      label: '(H)住宿和餐饮业',
      children: [{
        label: '(H61)住宿业',
      }, {
        label: '(H62)餐饮业',
      }]
    },
    {
      label: '(G)交通运输、仓储和邮政业',
      children: [
        {
        label: '(G53)铁路运输业',
        
      },
      {
        label: '(G54)道路运输业',
      
      },
      {
        label: '(G55)水上运输业',
       
      },
      {
        label: '(G56)航空运输业',
       
      },
      {
        label: '(G57)管道运输业',
        children: [{
          label: '(G5700)管道运输业'
        }]
      },
      {
        label: '(G58)装卸搬运和运输代理业',
      },
      {
        label: '(G59)仓储业',
      },
      {
        label: '(G60)邮政业',
      }]
    },
    {
      label: '(I)信息传输、软件和信息技术服务业',
      children: [
        {
        label: '(I63)电信、广播电视和卫星传输服务',
      }, 
      {
        label: '(I64)互联网和相关服务',
      },
      {
        label: '(I65)软件和信息技术服务业',
      }]
    },
    {
      label: '(K)房地产业',
      children: [{
        label: '(K70)房地产业',
        children: [
          {
            label: '(K7020)物业管理'
          },
          {
            label: '(K7030)房地产中介服务'
          },
          {
            label: '(K7040)自有房地产经营活动'
          },
          {
            label: '(K7090)其他房地产业'
          },
    
        ]
      }, ]
    },
    {
      label: '(L)租赁和商务服务业',
      children: [{
        label: '(L71)租赁业',
        
      }, {
        label: '(L72)商务服务业',
      }]
    },
    {
      label: '(M)科学研究和技术服务业',
      children: [{
        label: '(M73)研究和试验发展',
     
      },
       {
        label: '(M74)专业技术服务业',
        },
      {
        label: '(M75)科技推广和应用服务业',
       
      },
    ]
    },
    {
      label: '(N)水利、环境和公共设施管理业',
      children: [{
        label: '(N76)水利管理业',
      },
       {
        label: '(N77)生态保护和环境治理业',
       
      },
      {
        label: '(N78)公共设施管理业',
      },
    ]
    },
    {
      label: '(O)居民服务、修理和其他服务业',
      children: [{
        label: '(O79)居民服务业',
        
    },
    {
      label: '(O80)机动车、电子产品和日用产品修理业',
    },
    {
      label: '(O81)其他服务业',
    },
  ]
  },

  {
    label: '(P)教育',
    children: [{
      label: '(P82)教育',
    }, ]
  },
  {
    label: '(Q)卫生和社会工作',
    children: [{
      label: '(Q83)卫生',
    }, 
    {
      label: '(Q84)社会工作',}]
  },
      {
        label: '(R)文化、体育和娱乐业',
        children: [{
          label: '(R85)新闻和出版业',
          
        },
         {
          label: '(R86)广播、电视、电影和影视录音制作业',
        },
        {
          label: '(R87)文化艺术业',
         
        },
        {
          label: '(R88)体育',
         
        },
        {
        label: '(R89)娱乐业',}
      ]
      },
]
let tableData=[
{
  date: '一、利润表项目',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业收入',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
}, {
  date: '利润总额',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
}, 
{
  date: '归属于母公司净利润',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},{
  date: '管理费用',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
}, {
  date: '销售费用',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '财务费用',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业成本',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业税金及附加',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '资产减值损失',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '公允价值变动收益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '投资收益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '汇兑收益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业外收入',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业外支出',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '所得税费用',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他综合收益的税后净额',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '净利润',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '销售毛利',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业利润',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '营业外利润',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '资金平衡情况',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '期间费用',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '息税前收益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '二、资产负债表项目',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '货币资金',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '预付账款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他应收款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '短期借款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '长期借款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应收账款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '存货',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '净资产收益率',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应收款项周转率',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '存货周转率',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '归属于母公司所有者权益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '以公允价值计量且其变动计入当期损益的金融资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '衍生金融资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应收票据',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应收利息',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应收股利',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '划分为持有待售的资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '一年内到期的非流动资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他流动资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '可供出售金融资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},

{
  date: '发放贷款及垫款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '持有至到期投资',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '长期应收款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '长期股权投资',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '投资性房地产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '固定资产原值',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '在建工程',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '工程物资',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '固定资产清理',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '生产性生物资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '油气资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '无形资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '开发支出',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '商誉',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '长期待摊费用',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '递延所得税资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他非流动资产',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '以公允价值计量且其变动计入当期损益的金融负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '衍生金融负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应付票据',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应付账款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '预收款项',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应付职工薪酬',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应交税费',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应付利息',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应付股利',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他应付款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '划分为持有待售的负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '一年内到期的非流动负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他流动负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '应付债券',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '长期应付款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '长期应付职工薪酬',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '专项应付款',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '预计负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '递延收益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '递延所得税负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他非流动负债',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '实收资本',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他权益工具',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '资本公积',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '其他综合收益',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '专项储备',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '盈余公积',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '一般风险准备',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '未分配利润',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  
{
  date: '到期票据及投资',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
}, 
{
  date: '到期借款及票据',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '负债合计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '非流动负债合计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '非流动资产合计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '负债和股东权益总计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '股东权益合计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '资产总计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '流动资产合计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '流动负债合计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '固定成本',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},  {
  date: '三、现金流量表项目',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '筹资活动现金流入小计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '筹资活动现金流出小计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '经营活动现金流出小计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '经营活动现金流入小计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '投资活动现金流入小计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '投资活动现金流出小计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '经营活动现金净流量',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '投资活动现金净流量',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '筹资活动现金净流量',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '现金净流量',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '现金及现金等价物净额增加额',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},
{
  date: '现金流入总计',
  name: '0.00',
  address: '0.00',
  address1: '0.00',
  address2: '0.00',
  address3: '0.00',
  address4: '0.00',
  address5: '0.00',
  address6: '0.00',
  address7: '0.00',
  address8: '0.00',
  address9: '0.00',
},

]
let tableData1=[
{
field1:'营业收入或销售收入/占营业总收入比例',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'流动资产率预警预警高限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'固定资产比例预警高限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'长期投资比例预警高限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'主营业务成本高限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'主营业务成本底限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'存货占收入比率合理值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'固定资产保新判断值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'固定资产老化判断线值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'长期性资产革新值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'应收账款周转天数理论合理值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'其他应收款占收入比率合理值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'速动比率预警低限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'速动比率理论合理值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'流动比率预警低限值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'流动比率理论合理值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'其他应收款平均偿还期',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'短期借款平均偿还期',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'其他应付款平均偿还期',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'现金支付能力变化幅度值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'收入成本异动阀值',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'货币资金/营业收入比例',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'短期借款占营业收入',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'在建工程固定资产',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'在建工程/营业收入比例',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'预收账款/营业收入比例',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'预付账款营业成本',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'其它应收款营业收入',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'待摊费用/流动资产合计比例比例',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'经营活动产生的现金流量净额营业利润',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
{
field1:'销售商品提供劳务产生的现金/营业收入比例比例',
field2:'-0.050',
field3:'-0.005',
field4:'0.010',
field5:'0.050',
},
]
let tableData2=[
{
  field1:'短期借款偿还比例',
  field2:'0.80'
},
{
field1:'非流动负债偿还比例',
field2:'0.80'
},
{
field1:'应收账款可能增加值',
field2:'0.70'
},
{
field1:'应收账款可能减少值',
field2:'0.00'
},
{
field1:'其他应收款可能增加值',
field2:'0.00'
},
{
field1:'其他应收款可能减少值',
field2:'0.00'
},
{
field1:'存货可能增加值',
field2:'0.00'
},
{
field1:'存货可能减少值',
field2:'0.00'
},
{
field1:'应付账款可能下降值',
field2:'0.00'
},
{
field1:'应付账款可能上升值',
field2:'0.00'
},
{
field1:'营业利润可能增长值',
field2:'0.00'
},
{
field1:'新增短期贷款额度（万元）',
field2:'0.00'
},

]
let tableData3=[
{
field1:'营业收入',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'营业成本',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'营业利润',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'利润总额',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'销售毛利',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'其他应收款',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'营业外收入',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'营业外支出',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'货币资金',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'存货',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'应收账款',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'在建工程',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'短期借款',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'预付账款',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'资产减值损失',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'长短期借款占负债比重',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'经营活动产生的现金流量净额',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'投资活动产生的现金流量净额',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},{
field1:'现金净流量',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
{
field1:'现金及现金等价物净额增加额',
field2:'200',
field3:'-100',
field4:'60%',
field5:'-60%',
field6:'800%',
field7:'-800%',
field8:'0%',
},
]
let tableData4=[
{
  field1:'管理费用/销售(营业)收入占比',
  field2:'—',
  field3:'2%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'销售费用/销售(营业)收入占比',
  field2:'—',
  field3:'2%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'主营业务成本/销售(营业)收入占比',
  field2:'—',
  field3:'2%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'存货/销售(营业)收入占比',
  field2:'—',
  field3:'2%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收账款/销售(营业)收入占比',
  field2:'—',
  field3:'2%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'其他应收款/资产总计',
  field2:'—',
  field3:'5%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'待摊费用/资产总计',
  field2:'—',
  field3:'5%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'长期负债/资产总计',
  field2:'—',
  field3:'5%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'长经营活动现金流出合计/销售(营业)收入占比',
  field2:'—',
  field3:'5%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'在建工程',
  field2:'—',
  field3:'5%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},


]
let tableData5=[
{
  field1:'应收账款',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收账款占流动资产比重',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收票据',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收票据占流动资产比重',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'存货',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'存货占流动资产比重',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'其他应收款',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'短期借款',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'长期借款',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'长短期借款占负债比重',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应付票据',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'其他应付款',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'其一年内到期的非流动负债',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'资产负债率',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'所有者权益',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'销售（营业）收入',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业成本',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'销售毛利',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'期间费用',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'投资收益',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'资产减值损失',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业外收入',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业外支出',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'利润总额',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'经营活动产生的现金流量净额',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'投资活动产生的现金流量净额',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'筹资活动产生的现金流量净额',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'现金净流量',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'现金及现金等价物净增加额',
  field2:'—',
  field3:'30%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},

{
  field1:'主营业务利润',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业利润',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'净利润',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营运资本',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'经营活动现金流入合计',
  field2:'—',
  field3:'20%',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
]
let tableData6=[
{
  field1:'营业收入',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收账款增长率',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'投资收益',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业利润占利润总额的比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业利润',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'净利润',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'资产净利率[%]',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'利润总额',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
}
]
let tableData7=[
{
  field1:'实现利润增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},

{
  field1:'营业利润增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'投资收益增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'营业外利润增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'主营业务收入增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'主营业务收入净额增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'成本费用总额增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'主营业务成本增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'销售费用增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'财务费用增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'管理费用增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'管理费用/主营业务收入',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'营业费用/主营业务收入',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'资产总额增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'负债总额增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'所有者权益增长率(%)',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'资产负债率变化范围',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'流动比率变化范围',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'速动比率变化范围',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'利息保障倍数变化范围',
  field2:'5%',
  field3:'10%',
  field4:'20%',
  field5:'100%',
  field6:'-5%',
  field7:'-10%',
  field8:'-20%',
  field9:'-100%',
},
{
  field1:'现金支付能力变化范围',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'净资产收益率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'内部资产收益率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'对外投资收益率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},  {
  field1:'投资收益增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'主营业务利润率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'总资产报酬率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'息税前收益增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'成本费用利润率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'期间费用利润率增减百分点',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'存贷增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'固定资产增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'流动资产增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收账款增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应付账款增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'总资产增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业周期增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'营业安全水平',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'预收账款增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'预付账款增长率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'存货/主营业务收入增长额比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收账款/主营业务收入增长额比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'主营业务成本/主营业务收入增长额比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'主营业务利润/主营业务收入增长额比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'存货/固定资产原值增长率(%)比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'应收账款/固定资产原值增长率(%)比例',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'现金及现金等价物净额变化率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'经营活动产生的现金流量净额变化率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'投资活动产生的现金流量净额变化率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
{
  field1:'筹资活动产生的现金流量净额变化率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},

]
let tableData8=[
{
  field1:'筹资活动产生的现金流量净额变化率(%)',
  field2:'200',
  field3:'-100',
  field4:'60%',
  field5:'-60%',
  field6:'800%',
  field7:'-800%',
  field8:'0%',
},
]
let tableData9=[

{
  field1:'资产负债率%',
  field2:'2.4',
},
{
  field1:'资产负债率预警线%',
  field2:'2.4',
},
{
  field1:'损失贷款资产负债率',
  field2:'2.4',
},
{
  field1:'可疑贷款资产负债率',
  field2:'2.4',
},
{
  field1:'正常贷款资产负债率',
  field2:'2.4',
},
{
  field1:'可接受的还款期限（年）',
  field2:'2.4',
},
{
  field1:'不良资产比率合理值',
  field2:'2.4',
},
{
  field1:'存货增长幅度合理值',
  field2:'2.4',
},
{
  field1:'货币资金增长幅度合理值',
  field2:'2.4',
},
]
let data6=[
{
  label: '(A)农、林、牧、渔业',
  children: [
    {
    label: '(A01)农业',
  },
  {
    label: '(A02)林业',
  },
  {
    label: '(A03)畜牧业',
  },
  {
    label: '(A04)渔业',
  },
  {
    label: '(A05)农、林、牧、渔服务业',
  },
]
},
 {
  label: '(B)采矿业',
  children: [
    {
    label: '(B06)煤炭开采和洗选业',
  }, 
  {
    label: '(B07)石油和天然气开采业',
  },
  {
    label: '(B08)黑色金属矿采选业',
  },
  {
    label: '(B09)有色金属矿采选业',
  },
  {
    label: '(B10)非金属矿采选业',
  },
  {
    label: '(B11)开采辅助活动',
  },
]
}, 
{
  label: '(C)制造业',
  children: [{
    label: '(C13)农副食品加工业',
  },
   {
    label: '(C14)食品制造业',
  },
  {
    label: '(C15)酒、饮料和精制茶制造业',
  },
  {
    label: '(C17)纺织业',
   
  },
  {
    label: '(C18)纺织服装、服饰业',
  },
  {
    label: '(C19)皮革、毛皮、羽毛及其制品和制鞋业',
  },
  {
    label: '(C20)木材加工和木、竹、藤、棕、草制品业',
  },
  {
    label: '(C21)家具制造业',
  },
  {
    label: '(C22)造纸和纸制品业',
  },
  {
    label: '(C23)印刷和记录媒介复制业',
  },
  {
    label: '(C24)文教、工美、体育和娱乐用品制造业',
  },
  {
    label: '(C25)石油加工、炼焦和核燃料加工业',
  },
  {
    label: '(C26)化学原料和化学制品制造业',
  },
  {
    label: '(C27)医药制造业',
  },
  {
    label: '(C28)化学纤维制造业',
  },
  {
    label: '(C29)橡胶和塑料制品业',
  },
  {
    label: '(C30)非金属矿物制品业',
  },
  {
    label: '(C31)黑色金属冶炼和压延加工业',
  },
  {
    label: '(C32)有色金属冶炼和压延加工业',
  },
  {
    label: '(C33)金属制品业',
  },
  {
    label: '(C34)通用设备制造业',
  },
  {
    label: '(C35)专用设备制造业',
  },
  {
    label: '(C36)汽车制造业',
  },
  {
    label: '(C37)铁路、船舶、航空航天和其他运输设备制造业',
  },
  {
    label: '(C38)电气机械和器材制造业',
  },
  {
    label: '(C39)计算机、通信和其他电子设备制造业',
  },
  {
    label: '(C40)仪器仪表制造业',
  },
  {
    label: '(C41)其他制造业',
  },
  {
    label: '(C42)废弃资源综合利用业',
  },
]
},
{
  label: '(D)电力、热力、燃气及水生产和供应业',
  children: [
    {
    label: '(D44)电力、热力生产和供应业',
  }, 
  {
    label: '(D45)燃气生产和供应业',
  },
  {
    label: '(D46)水的生产和供应业',
  }]
},
{
  label: '(E)建筑业',
  children: [
    {
    label: '(E47)房屋建筑业',
  },
  {
    label: '(E48)土木工程建筑业',
  },
  {
    label: '(E49)建筑安装业',
  },
   {
    label: '(E50)建筑装饰和其他建筑业',
  }]
},
{
  label: '(F)批发和零售业',
  children: [{
    label: '(F51)批发业',
  },
  {
    label: '(F52)零售业',
  },]
},
{
  label: '(G)交通运输、仓储和邮政业',
  children: [
    {
    label: '(G53)铁路运输业',
    
  },
  {
    label: '(G54)道路运输业',
  
  },
  {
    label: '(G55)水上运输业',
   
  },
  {
    label: '(G56)航空运输业',
   
  },
  {
    label: '(G58)装卸搬运和运输代理业',
  },
  {
    label: '(G59)仓储业',
  },
  {
    label: '(G60)邮政业',
  }]
},
{
  label: '(H)住宿和餐饮业',
  children: [{
    label: '(H61)住宿业',
  }, {
    label: '(H62)餐饮业',
  }]
},
{
  label: '(I)信息传输、软件和信息技术服务业',
  children: [
    {
    label: '(I63)电信、广播电视和卫星传输服务',
  }, 
  {
    label: '(I64)互联网和相关服务',
  },
  {
    label: '(I65)软件和信息技术服务业',
  }]
},
{
  label: '(J)金融业',
  children: [
    {
      label: '(J66)货币金融服务',
      
    },
    {
    label: '(J67)资本市场服务',
   
  }, 
  {
    label: '(J68)保险业',
    
  }, 
  {
    label: '(J69)其他金融业',
   
  }, 
 ]
},  {
  label: '(K)房地产业',
  children: [{
    label: '(K70)房地产业',
  }, ]
},  {
  label: '(L)租赁和商务服务业',
  children: [{
    label: '(L71)租赁业',
    
  }, {
    label: '(L72)商务服务业',
  }]
},
{
  label: '(M)科学研究和技术服务业',
  children: [{
    label: '(M73)研究和试验发展',
 
  },
   {
    label: '(M74)专业技术服务业',
    },
  {
    label: '(M75)科技推广和应用服务业',
   
  },
]
},
{
  label: '(N)水利、环境和公共设施管理业',
  children: [
   {
    label: '(N77)生态保护和环境治理业',
   },
  {
    label: '(N78)公共设施管理业',
  },
]
},
{
  label: '(O)居民服务、修理和其他服务业',
  children: [
  {
    label: '(O80)机动车、电子产品和日用产品修理业',
  },
]
},
{
  label: '(P)教育',
  children: [{
    label: '(P82)教育',
  }, ]
},
{
  label: '(Q)卫生和社会工作',
  children: [{
    label: '(Q83)卫生',
  }, ]
},
{
  label: '(R)文化、体育和娱乐业',
  children: [{
    label: '(R85)新闻和出版业',
    
  },
   {
    label: '(R86)广播、电视、电影和影视录音制作业',
  },
  {
    label: '(R87)文化艺术业',
   
  },
  {
    label: '(R88)体育',
   
  },
]
},
{
  label: '(S)综合',
},
]
let tableData10=[
  {
    id:'应收账款',
    field2:'应收账款占营业收入比重',
  },
  {
    id:'应收账款',
    field2:'应收账款增加额占营业收入比重',
  },
  {
    id:'应收账款',
    field2:'应收账款增加额占营业收入增加额比重',
  },
  {
    id:'应收账款',
    field2:'应收账款增加额合理值',
  },
  {
    id:'应收账款',
    field2:'应收账款占总资产比重',
  },
  {
    id:'应收账款',
    field2:'应收账款周转率',
  },
  {
    id:'货币资金',
    field2:'',
  },
  {
    id:'存货',
    field2:'',
  },
  {
    id:'固定资产',
    field2:'',
  },
  {
    id:'在建工程',
    field2:'',
  },
  {
    id:'营业收入',
    field2:'',
  },
  {
    id:'营业成本',
    field2:'',
  },
  {
    id:'其他应收款',
    field2:'',
  },
  {
    id:'其他应付款',
    field2:'',
  },
  {
    id:'利润',
    field2:'',
  },
  {
    id:'经营活动现金流',
    field2:'',
  },
  {
    id:'商誉',
    field2:'',
  },
  {
    id:'毛利率',
    field2:'',
  },
  {
    id:'固定资产',
    field2:'',
  },
  {
    id:'无形资产',
    field2:'',
  },
  {
    id:'预付账款',
    field2:'',
  },
  {
    id:'应付职工薪酬',
    field2:'',
  },
  {
    id:'固定资产',
    field2:'',
  },
]
let tableData11=[
{
  no:'1',
  field1:'现金状况预警',
  field2:'净利实现率',
},
{
  no:'2',
  field1:'现金状况预警',
  field2:'现金比率',
},
{
  no:'3',
  field1:'现金状况预警',
  field2:'营运现金比率',
},
{
  no:'4',
  field1:'现金状况预警',
  field2:'现金保障倍率',
},
{
  no:'5',
  field1:'流动性预警',
  field2:'速动比率',
},
{
  no:'6',
  field1:'流动性预警',
  field2:'流动比率',
},
{
  no:'7',
  field1:'流动性预警',
  field2:'营运资金比率',
},
{
  no:'8',
  field1:'流动性预警',
  field2:'现金到期比率',
},
{
  no:'9',
  field1:'流动性预警',
  field2:'流动资产比率',
},
{
  no:'10',
  field1:'债务状况预警',
  field2:'资产负债率',
},
{
  no:'11',
  field1:'债务状况预警',
  field2:'短期负债比率',
},
{
  no:'12',
  field1:'债务状况预警',
  field2:'速冻负债占短期负债比率',
},
{
  no:'13',
  field1:'债务状况预警',
  field2:'已获利息倍数',
},
{
  no:'14',
  field1:'经营状况预警',
  field2:'销售或营业收入增长率',
},
{
  no:'15',
  field1:'经营状况预警',
  field2:'资金周转率',
},
{
  no:'16',
  field1:'经营状况预警',
  field2:'成本费用增长率',
},
{
  no:'17',
  field1:'信用状况预警',
  field2:'销售收现比',
},
{
  no:'18',
  field1:'信用状况预警',
  field2:'平均收款期',
},
{
  no:'19',
  field1:'信用状况预警',
  field2:'平均付款期',
},
{
  no:'20',
  field1:'信用状况预警',
  field2:'利息费用率增长率',
},
{
  no:'21',
  field1:'成本费用状况预警',
  field2:'成本盈利敏感系数',
},
{
  no:'22',
  field1:'成本费用状况预警',
  field2:'递延成本费用占总成本费用比率',
},

{
  no:'23',
  field1:'盈利状况预警',
  field2:'销售毛利率',
},
{
  no:'24',
  field1:'盈利状况预警',
  field2:'成本费用利润率',
},
{
  no:'25',
  field1:'盈利状况预警',
  field2:'投资报酬率',
},
{
  no:'26',
  field1:'盈利状况预警',
  field2:'总资产净利率',
},
{
  no:'27',
  field1:'盈利状况预警',
  field2:'权益资本净利率',
},
{
  no:'28',
  field1:'财务状况预警',
  field2:'应收账款占流动资产比重',
},
{
  no:'29',
  field1:'财务状况预警',
  field2:'资产负债率超过行业平均水平',
},
{
  no:'30',
  field1:'财务状况预警',
  field2:'其他资产占流动资产比重',
},
{
  no:'31',
  field1:'财务状况预警',
  field2:'应收账款增长率大于销售收入增长率',
},
]
let tableData12=[
{
  field1:'资产负债率',
  id:'财务预警',
  
},
{
  field1:'速动比率',
  id:'财务预警',
},
{
  field1:'现金流动负债比率',
  id:'财务预警',
},
{
  field1:'成本费用利润率',
  id:'财务预警',
},
{
  field1:'净资产收益率',
  id:'财务预警',
},
{
  field1:'销售（营业）增长率',
  id:'财务预警',
},
{
  field1:'销售（营业）利润增长率',
  id:'财务预警',
},
{
  field1:'盈余现金保障倍数下降',
  id:'财务预警',
},

]
let tableData13=[
{
  no:'1',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'流动比率',
},
{
  no:'2',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'速动比率',
},
{
  no:'3',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'资产负债率',
},
{
  no:'4',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'贷息负债比率',
},
{
  no:'5',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'担保净资产比',
},
{
  no:'6',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'已获利息倍数',
},
{
  no:'7',
  field1:'生存风险',
  field2:'偿债风险',
  field3:'贷款本息按期偿还率',
},
{
  no:'8',
  field1:'生存风险',
  field2:'现金流风险',
  field3:'经营现金流量与债务总额比'
},
{
  no:'9',
  field1:'生存风险',
  field2:'现金流风险',
  field3:'盈余现金保障倍数'
},
{
  no:'10',
  field1:'生存风险',
  field2:'现金流风险',
  field3:'资产现金回收率 '
},  
{
  no:'11',
  field1:'生存风险',
  field2:'现金流风险',
  field3:'营用指数'
},

{
  no:'12',
  field1:'效率风险',
  field2:'资产效率风险',
  field3:'总资产周转率'
},
{
  no:'13',
  field1:'效率风险',
  field2:'资产效率风险',
  field3:'流动资产周转率'
},
{
  no:'14',
  field1:'效率风险',
  field2:'资产效率风险',
  field3:'应收账款周转率'
},  
{
  no:'15',
  field1:'效率风险',
  field2:'资产效率风险',
  field3:'存货周转率'
},
{
  no:'16',
  field1:'效率风险',
  field2:'资产效率风险',
  field3:'不良资产比率'
},
{
  no:'17',
  field1:'效率风险',
  field2:'人员效率风险',
  field3:'人均营业收入增长率'
},
{
  no:'18',
  field1:'效率风险',
  field2:'人员效率风险',
  field3:'人均营业利润增长率'
},
{
  no:'19',
  field1:'效率风险',
  field2:'人员效率风险',
  field3:'人均资产增长率'
},
{
  no:'20',
  field1:'盈利风险',
  field2:'盈利能力风险',
  field3:'销售毛利率'
},
{
  no:'21',
  field1:'盈利风险',
  field2:'盈利能力风险',
  field3:'营业外利润率'
},
{
  no:'22',
  field1:'盈利风险',
  field2:'盈利能力风险',
  field3:'主营业务占总利润比'
},
 {
  no:'23',
  field1:'盈利风险',
  field2:'盈利能力风险',
  field3:'净资产收益率'
},
 {
  no:'24',
  field1:'盈利风险',
  field2:'盈利能力风险',
  field3:'总资产报酬率'
},
{
  no:'25',
  field1:'盈利风险',
  field2:'投资能力风险',
  field3:'金融类投资收益率'
},
{
  no:'26',
  field1:'盈利风险',
  field2:'投资能力风险',
  field3:'资产类投资收益率'
}, 
{
  no:'27',
  field1:'盈利风险',
  field2:'投资能力风险',
  field3:'投资现金收益率（%）'
},
{
  no:'28',
  field1:'发展风险',
  field2:'业务增长风险',
  field3:'主营业务收入增长率'
},
{
  no:'29',
  field1:'发展风险',
  field2:'业务增长风险',
  field3:'技术投入比率'
}, 
{
  no:'30',
  field1:'发展风险',
  field2:'业务增长风险',
  field3:'资本积累率'
},
{
  no:'31',
  field1:'发展风险',
  field2:'规模扩张风险',
  field3:'资产周转率'
},
{
  no:'32',
  field1:'发展风险',
  field2:'规模扩张风险',
  field3:'总资产周转率'
},


]
let tableData14=[
{
  field1:'经营风险预警指标',
  field2:'主营业务收入利润率',
  
},
{
  field1:'经营风险预警指标',
  field2:'营业利润比重',
},
{
  field1:'经营风险预警指标',
  field2:'主营业务收入增长率与应收账款增长率',
},
{
  field1:'经营风险预警指标',
  field2:'应收账款周转率',
},
{
  field1:'经营风险预警指标',
  field2:'净资产收益率',
},
{
  field1:'经营风险预警指标',
  field2:'现金流量预警',
},
{
  field1:'资金风险预警指标',
  field2:'资产负债率',
},
{
  field1:'经营风险预警指标',
  field2:'流动比率',
},
{
  field1:'经营风险预警指标',
  field2:'速动比率',
},
{
  field1:'经营风险预警指标',
  field2:'盈利现金比率',
},
{
  field1:'经营风险预警指标',
  field2:'强制性现金支付比率',
},
{
  field1:'关联方占用风险预警指标',
  field2:'资产关联方占用率',
},
{
  field1:'关联方占用风险预警指标',
  field2:'关联业务收入成本比率',
},
{
  field1:'筹集资金投资项目预警指标',
  field2:'投入产出比率',
},
{
  field1:'筹集资金投资项目预警指标',
  field2:'项目投资进度完成率',
},
{
  field1:'对外投资风险预警指标',
  field2:'长期股权投资比率',
},
{
  field1:'对外投资风险预警指标',
  field2:'长期股权投资收益率',
},

]
export{
  data,
  data1,
  data2,
  data3,
  data4,
  data5,
  data6,
  tableData,
  tableData1,
  tableData2,
  tableData3,
  tableData4,
  tableData5,
  tableData6,
  tableData7,
  tableData8,
  tableData9,
  tableData10,
  tableData11,
  tableData12,
  tableData13,
  tableData14
}