let chartData1 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393
        },
        {
            '日期': '1/2',
            '访问用户': 3530
        },
        {
            '日期': '1/3',
            '访问用户': 2923
        },
        {
            '日期': '1/4',
            '访问用户': 1723
        },
        {
            '日期': '1/5',
            '访问用户': 3792
        },
        {
            '日期': '1/6',
            '访问用户': 4593
        }
    ]
}
let chartData2 = {
    columns: ['日期', '数值'],
    rows: [{
            '日期': '货币资金',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },

        {
            '日期': '应收账款',
            '数值': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '应收票据',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '预付款项',
            '数值': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '其他应收款',
            '数值': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        },
        {
            '日期': '存货',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '持有待售资产',
            '数值': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
   
        {
            '日期': '债权投资',
            '数值': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },

        {
            '日期': '流动资产合计',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '长期应收款',
            '数值': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '在建工程',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '固定资产',
            '数值': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '资产总计',
            '数值': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartData22 = {
    columns: ['日期', '数值'],
    rows: [{
            '日期': '货币资金',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '交易性金融资产',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '应收票据及应收账款',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '应收账款',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '应收票据',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '预付款项',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },

        {
            '日期': '其他应收款',
            '数值': 2923,
            '下单用户': 2623,
            '下单率': 0.76
        },
        {
            '日期': '存货',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '持有待售资产',
            '数值': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '一年内到期的非流动资产',
            '数值': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        },
        {
            '日期': '流动资产合计',
            '数值': 1393,
            '下单用户': 1093,
            '下单率': 0.32
        },
        {
            '日期': '债权投资',
            '数值': 3530,
            '下单用户': 3230,
            '下单率': 0.26
        },
        {
            '日期': '长期应收款',
            '数值': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '长期股权投资',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '投资性房地产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '固定资产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '在建工程',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '生产性生物资产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '油气资产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '无形资产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '开发支出',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '商誉',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '固定资产',
            '数值': 3792,
            '下单用户': 3492,
            '下单率': 0.323
        },
        {
            '日期': '长期待摊费用',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '递延所得税资产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '其他非流动资产',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '非流动资产合计',
            '数值': 1723,
            '下单用户': 1423,
            '下单率': 0.49
        },
        {
            '日期': '资产总计',
            '数值': 4593,
            '下单用户': 4293,
            '下单率': 0.78
        }
    ]
}
let chartSettings1 = {
    area: true,
    showLine: ['天数'],
    axisSite: {
        right: ['净额']
    }
}
let chartData3 = {
    columns: ['日期', '净额', '天数'],
    rows: [{
            '日期': '2015年',
            '净额': 97913.45,
            '天数': 240,
        },
        {
            '日期': '2016年',
            '净额': 96993.82,
            '天数': 229,
            '营业毛利率': 11.44
        },
        {
            '日期': '2017年',
            '净额': 101021.28,
            '天数': 227,
            '营业毛利率': 11.07
        },
        {
            '日期': '2018年',
            '净额': 100432.16,
            '天数': 223,
            '营业毛利率': 11.24
        },
        {
            '日期': '2019年',
            '净额':100206.8,
            '天数': 222,
            '营业毛利率': 11.27
        }
    ]
}
let chartData4 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393
        },
        {
            '日期': '1/2',
            '访问用户': 3530
        },
        {
            '日期': '1/3',
            '访问用户': 2923
        },
        {
            '日期': '1/4',
            '访问用户': 1723
        },
        {
            '日期': '1/5',
            '访问用户': 3792
        },
        {
            '日期': '1/6',
            '访问用户': 4593
        }
    ]
}
let chartData5 = {
    columns: ['日期', '现金及现金等价物','现金性资产占总资产占比','应收账款占总资产占比'],
    rows: [{
            '日期': '1月',
            '本期': 1393,
            '现金及现金等价物': 1093,
            '现金性资产占总资产占比':133,
            '应收账款占总资产占比':125
        },
        {
            '日期': '2月',
            '本期': 3530,
            '现金及现金等价物': 3230,
            '现金性资产占总资产占比':433,
            '应收账款占总资产占比':545
        },
        {
            '日期': '3月',
            '本期': 2923,
            '现金及现金等价物': 2623,
            '现金性资产占总资产占比':1033,
            '应收账款占总资产占比':1045
        },
        {
            '日期': '4月',
            '本期': 1723,
            '现金及现金等价物': 1423,
            '现金性资产占总资产占比':1123,
            '应收账款占总资产占比':1005
        },
        {
            '日期': '5月',
            '本期': 3792,
            '现金及现金等价物': 3492,
            '现金性资产占总资产占比':833,
            '应收账款占总资产占比':945
        },
        {
            '日期': '6月',
            '本期': 4593,
            '现金及现金等价物': 4293,
            '现金性资产占总资产占比':563,
            '应收账款占总资产占比':645
        },
        {
            '日期': '7月',
            '本期': 1393,
            '现金及现金等价物': 1093,
            '现金性资产占总资产占比':533,
            '应收账款占总资产占比':645
        },
        {
            '日期': '8月',
            '本期': 3530,
            '现金及现金等价物': 3230,
            '现金性资产占总资产占比':1533,
            '应收账款占总资产占比':545
        },
        {
            '日期': '9月',
            '本期': 2923,
            '现金及现金等价物': 2623,
            '现金性资产占总资产占比':733,
            '应收账款占总资产占比':1045
        },
        {
            '日期': '10月',
            '本期': 1723,
            '现金及现金等价物': 1423,
            '现金性资产占总资产占比':1123,
            '应收账款占总资产占比':1245
        },
        {
            '日期': '11月',
            '本期': 3792,
            '现金及现金等价物': 3492,
            '现金性资产占总资产占比':1033,
            '应收账款占总资产占比':1245
        },
        {
            '日期': '12月',
            '本期': 4593,
            '现金及现金等价物': 4293,
            '现金性资产占总资产占比':533,
            '应收账款占总资产占比':1245
        }
    ]
}
let chartData6 = {
    columns: ['日期', '总资产周转率', '固定资产周转率', '应收账款周转率', '存货周转率'],
    rows: [{
            '日期': '1月',
            '总资产周转率': 61.72,
            '固定资产周转率': 149.85,
            '应收账款周转率': 2977.71,
            '存货周转率': 376.49
        },
        {
            '日期': '2月',
            '总资产周转率': 3530,
            '固定资产周转率': 3230,
            '应收账款周转率': 3530,
            '存货周转率': 1723
        },
        {
            '日期': '3月',
            '总资产周转率': 2923,
            '固定资产周转率': 2623,
            '应收账款周转率': 1423,
            '存货周转率': 1093
        },
        {
            '日期': '4月',
            '总资产周转率': 1723,
            '固定资产周转率': 1423,
            '应收账款周转率': 1723,
            '存货周转率': 3530
        },
        {
            '日期': '5月',
            '总资产周转率': 3792,
            '固定资产周转率': 3492,
            '应收账款周转率': 1093,
            '存货周转率': 1423
        },
        {
            '日期': '6月',
            '总资产周转率': 4593,
            '固定资产周转率': 4293,
            '应收账款周转率': 2923,
            '存货周转率': 3530
        },
        {
            '日期': '7月',
            '总资产周转率': 1393,
            '固定资产周转率': 1093,
            '应收账款周转率': 1723,
            '存货周转率': 1093
        },
        {
            '日期': '8月',
            '总资产周转率': 3530,
            '固定资产周转率': 3230,
            '应收账款周转率': 3530,
            '存货周转率': 1423
        },
        {
            '日期': '9月',
            '总资产周转率': 2923,
            '固定资产周转率': 2623,
            '应收账款周转率': 2923,
            '存货周转率': 3530
        },
        {
            '日期': '10月',
            '总资产周转率': 1723,
            '固定资产周转率': 1423,
            '应收账款周转率': 2923,
            '存货周转率': 1093
        },
        {
            '日期': '11月',
            '总资产周转率': 3792,
            '固定资产周转率': 3492,
            '应收账款周转率': 3530,
            '存货周转率': 1423
        },
        {
            '日期': '12月',
            '总资产周转率': 4593,
            '固定资产周转率': 4293,
            '应收账款周转率': 1093,
            '存货周转率': 1093
        }
    ]
}
let chartData7 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '流动资产合计',
            '访问用户': 100001
        },
        {
            '日期': '非流动资产合计',
            '访问用户': 124176
        },


    ]
}
let chartData8 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '流动负债合计',
            '访问用户': 1393
        },
        {
            '日期': '非流动负债合计',
            '访问用户': 3530
        },

    ]
}

let chartData9 = {
    columns: ['页面', '访问量'],
    rows: [{
            '页面': '资金占用',
            '访问量': 10000
        },
        {
            '页面': '资金来源',
            '访问量': 10000
        },
        {
            '页面': '流动资产合计',
            '访问量': 4000
        },
        {
            '页面': '非流动资产合计',
            '访问量': 6000
        },
        {
            '页面': '流动负债合计',
            '访问量': 2000
        },
        {
            '页面': '非流动负债合计',
            '访问量': 4500
        },
        {
            '页面': '所有者权益',
            '访问量': 3500
        }
    ]

}

let chartData10 = {
    columns: ['日期', '访问用户'],
    rows: [{
            '日期': '1/1',
            '访问用户': 1393
        },
        {
            '日期': '1/2',
            '访问用户': 3530
        },
        {
            '日期': '1/3',
            '访问用户': 2923
        },
        {
            '日期': '1/4',
            '访问用户': 1723
        },
        {
            '日期': '1/5',
            '访问用户': 3792
        },
        {
            '日期': '1/6',
            '访问用户': 4593
        }
    ]
}
let chartData11 = {
    columns: ['日期', '数值'],
    rows: [{
            '日期': '短期借款',
            '数值': 1393.01
        },
        {
            '日期': '交易性金融负债',
            '数值': 3530.00
        },
        {
            '日期': '负债合计',
            '数值': 2923.00
        },
        {
            '日期': '衍生金融负债',
            '数值': 1723.00
        },
        {
            '日期': '应付票据及应付账款',
            '数值': 3792.00
        },
        {
            '日期': '应付账款',
            '数值': 4593.00
        },
        {
            '日期': '应付票据',
            '数值': 1393.00
        },
        {
            '日期': '预收款项',
            '数值': 3530.00
        },
        {
            '日期': '其他流动负债',
            '数值': 2923.00
        },
        {
            '日期': '流动负债合计',
            '数值': 1723.00
        },
        {
            '日期': '应付票据及应付账款',
            '数值': 3792.00
        },
        {
            '日期': '长期借款',
            '数值': 4593.00
        },
        {
            '日期': '应付债券',
            '数值': 1723.00
        },
        {
            '日期': '长期应付款',
            '数值': 3792.00
        },
        {
            '日期': '预计负债',
            '数值': 4593.00
        }
    ]
}
let chartData12 = {
    columns: ['日期', '账款', '天数'],
    rows: [{
            '日期': '1月',
            '账款': 4199.95,
            '天数': 54,
            '下单率': 0.32
        },
        {
            '日期': '2月',
            '账款': 15896.03,
            '天数': 8,
            '下单率': 0.26
        },
        {
            '日期': '3月',
            '账款': 13818.63,
            '天数': 17,
            '下单率': 0.76
        },
        {
            '日期': '4月',
            '账款': 14316.52,
            '天数': 24,
            '下单率': 0.49
        },
        {
            '日期': '5月',
            '账款': 14086.29,
            '天数': 36,
            '下单率': 0.323
        },
    ]
}
let chartData13 = {
    columns: ['日期', '短期借款', '长期借款'],
    rows: [{
            '日期': '2015年',
            '短期借款': 57720.00,
            '长期借款': 11000.00,
            '下单率': 0.32
        },
        {
            '日期': '2016年',
            '短期借款': 65950.00,
            '长期借款': 19320.00,
            '下单率': 0.26
        },
        {
            '日期': '2017年',
            '短期借款': 76990.00,
            '长期借款': 14080.00,
            '下单率': 0.76
        },
        {
            '日期': '2018年',
            '短期借款': 91690.00,
            '长期借款': 8840.00,
            '下单率': 0.49
        },
        {
            '日期': '2019年',
            '短期借款': 91100.00,
            '长期借款': 3600.00,
            '下单率': 0.323
        },
    ]
}
let chartData14 = {
    columns: ['日期', '递延收益', '非流动负债'],
    rows: [{
            '日期': '2015年',
            '递延收益': 1393.00,
            '非流动负债': 21000.00,
            '下单率': 0.32
        },
        {
            '日期': '2016年',
            '递延收益': 3530.00,
            '非流动负债': 24320.00,
            '下单率': 0.26
        },
        {
            '日期': '2017年',
            '递延收益': 2923.00,
            '非流动负债': 14080.00,
            '下单率': 0.76
        },
        {
            '日期': '2018年',
            '递延收益': 1723.00,
            '非流动负债': 8840.00,
            '下单率': 0.49
        },
        {
            '日期': '2019年',
            '递延收益': 3792.00,
            '非流动负债': 3600.00,
            '下单率': 0.323
        },
    ]
}
let chartData15 = {
    columns: ['日期', '资产总计', '负债合计'],
    rows: [{
            '日期': '2015年',
            '资产总计': 128020.73,
            '负债合计': 111020.73,
            '下单率': 0.32
        },
        {
            '日期': '2016年',
            '资产总计': 166853.06,
            '负债合计': 116853.06,
            '下单率': 0.26
        },
        {
            '日期': '2017年',
            '资产总计': 145965.67,
            '负债合计': 125965.67,
            '下单率': 0.76
        },
        {
            '日期': '2018年',
            '资产总计': 135410.94,
            '负债合计': 111410.99,
            '下单率': 0.49
        },
        {
            '日期': '2019年',
            '资产总计': 116673.20,
            '负债合计': 116453.20,
            '下单率': 0.323
        },
    ]
}
let chartData16 = {
    columns: ['日期', '资产负债率', '资产金融负债率','净资产负债率'],
    rows: [{
            '日期': '2015年',
            '资产负债率': 57.10,
            '资产金融负债率': 51.10,
            '净资产负债率': 32
        },
        {
            '日期': '2016年',
            '资产负债率': 60.96,
            '资产金融负债率': 34.96,
            '净资产负债率': 26
        },
        {
            '日期': '2017年',
            '资产负债率': 55.31,
            '资产金融负债率':51.33,
            '净资产负债率': 76
        },
        {
            '日期': '2018年',
            '资产负债率': 51.11,
            '资产金融负债率':33.71,
            '净资产负债率': 49
        },
        {
            '日期': '2019年',
            '资产负债率': 43.71,
            '资产金融负债率': 25.67,
            '净资产负债率': 32.3
        },
    ]
}

export {
    chartSettings1,
    chartData1,
    chartData2,
    chartData22,
    chartData3,
    chartData4,
    chartData5,
    chartData6,
    chartData7,
    chartData8,
    chartData9,
    chartData10,
    chartData11,
    chartData12,
    chartData13,
    chartData14,
    chartData15,
    chartData16,
}