let chartData1 = {
    columns: ['企业', '本年', '上年'],
    rows: [
        { '企业': '中文在线 ', '本年': 50, '上年': 98},
        { '企业': '昆仑万维 ', '本年': 51, '上年': 15},
        { '企业': '浩丰科技 ', '本年': 130, '上年': 93},
        { '企业': '恒通科技 ', '本年': 141, '上年': 232},
        { '企业': '诚益通   ', '本年': 153, '上年': 88 },
        { '企业': '暴风集团 ', '本年': 10, '上年': 42 },
        { '企业': '汉邦高科 ', '本年': 15, '上年': 83 },
        { '企业': '双杰电气 ', '本年': 63, '上年': 59 },
        { '企业': '康斯特   ', '本年': 30, '上年': 24 },
        { '企业': '耐威科技', '本年': 18, '上年': 78 }
    ]
}
let chartData2 = {
    columns: ['企业', '规则模型触警得分', 'AI 模型触警得分'],
    rows: [
        { '企业': '中文在线 ', '规则模型触警得分': 97, 'AI 模型触警得分': 98},
        { '企业': '昆仑万维 ', '规则模型触警得分': 95, 'AI 模型触警得分': 93},
        { '企业': '浩丰科技 ', '规则模型触警得分': 93, 'AI 模型触警得分': 93},
        { '企业': '恒通科技 ', '规则模型触警得分': 92, 'AI 模型触警得分': 90},
        { '企业': '诚益通   ', '规则模型触警得分': 91, 'AI 模型触警得分': 88 },
        { '企业': '暴风集团 ', '规则模型触警得分': 89, 'AI 模型触警得分': 84 },
        { '企业': '汉邦高科 ', '规则模型触警得分': 88, 'AI 模型触警得分': 83 },
        { '企业': '双杰电气 ', '规则模型触警得分': 88, 'AI 模型触警得分': 80 },
        { '企业': '康斯特   ', '规则模型触警得分': 88, 'AI 模型触警得分': 79 },
        { '企业': '耐威科技', '规则模型触警得分': 84, 'AI 模型触警得分': 78 }
    ]
}
let tableData = [{ "no": "1", "field1": "中文在线", "field2": "97", "field3": "98", "field4": "是", "field5": "销售收入、销售成本", "field6": "2019年5月1日" },
{ "no": "2", "field1": "昆仑万维", "field2": "95", "field3": "93", "field4": "是", "field5": "营运资金变动、研发成本", "field6": "2019年5月1日" },
{ "no": "3", "field1": "浩丰科技", "field2": "93", "field3": "93", "field4": "是", "field5": "营运资金变动、销售成本", "field6": "2019年5月1日" },
{ "no": "4", "field1": "恒通科技", "field2": "92", "field3": "90", "field4": "是", "field5": "固定资产、折旧摊销费用、", "field6": "2019年5月1日" },
{ "no": "5", "field1": "诚益通", "field2": "91", "field3": "88", "field4": "否", "field5": "开发成本、出租开发产品折旧摊销", "field6": "2019年5月1日" },
{ "no": "6", "field1": "暴风集团", "field2": "89", "field3": "84", "field4": "是", "field5": "销售收入、自由现金流", "field6": "2019年5月1日" },
{ "no": "7", "field1": "汉邦高科", "field2": "88", "field3": "83", "field4": "否", "field5": "销售收入、销售成本、衍", "field6": "2019年5月1日" },
{ "no": "8", "field1": "双杰电气", "field2": "88", "field3": "80", "field4": "否", "field5": "营运资金变动、销售成本", "field6": "2019年5月1日" },
{ "no": "9", "field1": "康斯特", "field2": "88", "field3": "79", "field4": "否", "field5": "销售收入、销售成本", "field6": "2019年5月1日" },
{ "no": "10", "field1": "耐威科技", "field2": "84", "field3": "78", "field4": "是", "field5": "营运资金变动、销售成本", "field6": "2019年5月1日" }]

export {
    chartData1,
    chartData2,
    tableData
}