let chartData1 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData2 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData3 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData4 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a:70, b: 2 }
    ]
}
let chartData5 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 40, b: 2 }
    ]
}
let chartData6 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a:60, b: 2 }
    ]
}
let chartData7 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a:40, b: 2 }
    ]
}
let chartData8 = {
    columns: ['日期', '流动比率', '速动比率','现金比率'],
    rows: [
      { '日期': '2016年3月', '流动比率': 1393, '速动比率': 1093, '现金比率':2324 },
      { '日期': '2016年6月', '流动比率': 3530, '速动比率': 3230, '现金比率':345 },
      { '日期': '2016年9月', '流动比率': 2923, '速动比率': 2623, '现金比率': 4548},
      { '日期': '2016年12月', '流动比率': 1723, '速动比率': 1423, '现金比率': 7897 },
      { '日期': '2017年3月', '流动比率': 3792, '速动比率': 3492, '现金比率': 345 },
      { '日期': '2017年6月', '流动比率': 4593, '速动比率': 4293 , '现金比率': 123 },
      { '日期': '2017年9月', '流动比率': 4593, '速动比率': 4293, '现金比率': 546 },
      { '日期': '2017年12月', '流动比率': 4593, '速动比率': 4293, '现金比率': 345 },
      { '日期': '2018年3月', '流动比率': 4593, '速动比率': 4293, '现金比率': 256 },
      { '日期': '2018年6月', '流动比率': 4593, '速动比率': 4293, '现金比率': 765 },
      { '日期': '2018年9月', '流动比率': 4593, '速动比率': 4293, '现金比率': 128 },
      { '日期': '2018年12月', '流动比率': 4593, '速动比率': 4293, '现金比率': 345 },
    ]
}
let chartData9 = {
    columns: ['日期', '利息保障倍数', '利息负担率'],
    rows: [
      { '日期': '2016年3月', '利息保障倍数': 13.93, '利息负担率': 10.3,  },
      { '日期': '2016年6月', '利息保障倍数': 35.30, '利息负担率': 32.30,  },
      { '日期': '2016年9月', '利息保障倍数': 29.23, '利息负担率': 26.3, },
      { '日期': '2016年12月', '利息保障倍数': 17.23, '利息负担率': 12.3,  },
      { '日期': '2017年3月', '利息保障倍数': 37.92, '利息负担率': 34.92, },
      { '日期': '2017年6月', '利息保障倍数': 25.33, '利息负担率': 44.23},
      { '日期': '2017年9月', '利息保障倍数': 15.93, '利息负担率': 22.93},
      { '日期': '2017年12月', '利息保障倍数': 4.23, '利息负担率': 49.3},
      { '日期': '2018年3月', '利息保障倍数': 25.93, '利息负担率': 22.93},
      { '日期': '2018年6月', '利息保障倍数': 35.93, '利息负担率': 12.93},
      { '日期': '2018年9月', '利息保障倍数': 15.93, '利息负担率': 32.93},
      { '日期': '2018年12月', '利息保障倍数': 12, '利息负担率': 23},
    ]
}
let chartData10 = {
    columns: ['日期', '利息保障倍数', '到期债务本息偿还率', '收入短期借款比'],
    rows: [
      { '日期': '2016年3月', '利息保障倍数': 0.23, '到期债务本息偿还率': 10.93, '收入短期借款比': 2.36 },
      { '日期': '2016年6月', '利息保障倍数': 9.4, '到期债务本息偿还率': 32.30, '收入短期借款比': 15.6 },
      { '日期': '2016年9月', '利息保障倍数': 2.3, '到期债务本息偿还率': 26.23, '收入短期借款比': 45.6 },
      { '日期': '2016年12月', '利息保障倍数': 6.2, '到期债务本息偿还率': 14.23, '收入短期借款比': 78.6 },
      { '日期': '2017年3月', '利息保障倍数': 11.5, '到期债务本息偿还率': 34.92, '收入短期借款比':45.6 },
      { '日期': '2017年6月', '利息保障倍数': 22.3, '到期债务本息偿还率': 42.93, '收入短期借款比': 23.6},
      { '日期': '2017年9月', '利息保障倍数': 13.2, '到期债务本息偿还率': 15.3, '收入短期借款比': 15.6 },
      { '日期': '2017年12月', '利息保障倍数': 19.6, '到期债务本息偿还率': 6.3, '收入短期借款比': 85.3},
      { '日期': '2018年3月', '利息保障倍数': 85.3, '到期债务本息偿还率': 36.6, '收入短期借款比': 45.6 },
      { '日期': '2018年6月', '利息保障倍数': 33.6, '到期债务本息偿还率': 58.6, '收入短期借款比': 26.32 },
      { '日期': '2018年9月', '利息保障倍数': 53.6, '到期债务本息偿还率': 78.6, '收入短期借款比': 56.32 },
      { '日期': '2018年12月', '利息保障倍数': 37.2, '到期债务本息偿还率': 3.92, '收入短期借款比': 5.69 },

    ]
}
let chartData11 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData12 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData13 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData14 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData15 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData16 = {
    columns: ['日期', '经营还债能力', '现金还债能力'],
    rows: [
      { '日期': '2016年3月', '经营还债能力': 1393, '现金还债能力': 1093},
      { '日期': '2016年6月', '经营还债能力': 3530, '现金还债能力': 3230},
      { '日期': '2016年9月' , '经营还债能力': 2923, '现金还债能力': 2623},
      { '日期': '2016年12月', '经营还债能力': 1723, '现金还债能力': 1423},
      { '日期': '2017年3月', '经营还债能力': 3792, '现金还债能力': 3492},
      { '日期': '2017年6月', '经营还债能力': 4593, '现金还债能力': 4293},
	  { '日期': '2017年9月', '经营还债能力': 1393, '现金还债能力': 1093},
      { '日期': '2017年12月', '经营还债能力': 3530, '现金还债能力': 3230},
      { '日期': '2018年3月', '经营还债能力': 2923, '现金还债能力': 2623},
      { '日期': '2018年6月', '经营还债能力': 1723, '现金还债能力': 1423},
      { '日期': '2018年9月', '经营还债能力': 3792, '现金还债能力': 3492},
      { '日期': '2018年12月', '经营还债能力': 4593, '现金还债能力': 4293},
      
    ]
}
let chartData17 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData18 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData19 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData20 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}
let chartData21 = {
    columns: ['type', 'a', 'b', 'value'],
    rows: [
        { type: '速度', value: 80, a: 1, b: 2 }
    ]
}

export {
    chartData1,
    chartData2,
    chartData3,
    chartData4,
    chartData5,
    chartData6,
    chartData7,
    chartData8,
    chartData9,
    chartData10,
    chartData11,
    chartData12,
    chartData13,
    chartData14,
    chartData15,
    chartData16,
    chartData17,
    chartData18,
    chartData19,
    chartData20,
    chartData21,
}