let gridData = [
    {
    "field1": "流动资金贷款",
    "field2": "0.00",
},
{
    "field1": "固定资产贷款",
    "field2": "0.00",
},
{
    "field1": "票据承兑",
    "field2": "0.00",
},
{
    "field1": "非融资性保函",
    "field2": "0.00",
},
{
    "field1": "其他",
    "field2": "-0.01",
},
{
    "field1": "合计",
    "field2": "-0.01",
},
]
let gridData1 = [
    {
        "field1": "金额（万元）",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
    }
]
let gridData2 = [
    {
        "field1": "流动资金贷款",
        "field2": "0.00",
        "field3": "0.00",
    },
    {
        "field1": "固定资产贷款",
        "field2": "0.00",
        "field3": "0.22",
    },
    {
        "field1": "票据承兑",
        "field2": "0.00",
        "field3": "0.00",
    },
    {
        "field1": "非融资性保函",
        "field2": "0.00",
        "field3": "0.00",
    },
    {
        "field1": "票据贴现",
        "field2": "0.00",
        "field3": "0.00",
    },
    {
        "field1": "委托贷款",
        "field2": "0.00",
        "field3": "0.00",
    },
    {
        "field1": "为子公司担保",
        "field2": "0.00",
        "field3": "0.00",
    },

]
let gridData3 = [
    {
        "field1": "商业银行借款",
        "field2": "0.00",
    },
    {
        "field1": "财务公司借款",
        "field2": "0.00",
    },
    {
        "field1": "委托贷款",
        "field2": "0.00",
    },
    {
        "field1": "其它有息负债",
        "field2": "0.00",
    },
    {
        "field1": "合计",
        "field2": "0.00",
    },
]
let gridData4 = [
    {
        "field1": "货币资金",
        "field2": "1,433,928.68",
        "field3": "530,198.17",
        "field4": "1,433,928.68",
        "field5": "短期借款",
        "field6": "1,620,000.00",
        "field7": "1,555,000.00",
        "field8": "1,620,000.00",
    },
    {
        "field1": "应收票据",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "应付票据",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "应付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "预收账款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "预付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "预收账款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "其他应收款",
        "field2": "533,661.49",
        "field3": "421,891.93",
        "field4": "533,661.49",
        "field5": "其他应收款",
        "field6": "210,959.03",
        "field7": "204,203.07",
        "field8": "210,959.03",
    },
    {
        "field1": "存货",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "流动负债",
        "field6": "3,182,033.86",
        "field7": "2,260,053.36",
        "field8": "3,182,033.86",
    },
    {
        "field1": "预付账款",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "预收账款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "流动资产",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "0.00",
        "field5": "长期借款",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "长期股权投资",
        "field2": "8,329,294.34",
        "field3": "7,796,431.81",
        "field4": "7,796,431.81",
        "field5": "非流动负债",
        "field6": "2,079,242.20",
        "field7": "1,531,903.40",
        "field8": "2,079,242.20",
    },
    {
        "field1": "固定资产",
        "field2": "10,119.62",
        "field3": "10,119.62",
        "field4": "10,119.62",
        "field5": "负债合计",
        "field6": "0.00",
        "field7": "0.00",
        "field8": "0.00",
    },
    {
        "field1": "无形资产",
        "field2": "65,736.90",
        "field3": "65,736.90",
        "field4": "65,736.90",
        "field5": "盈余公积",
        "field6": "112,452.49",
        "field7": "50,173.62",
        "field8": "112,452.49",
    },
    {
        "field1": "非流动资产",
        "field2": "11,153,812.60",
        "field3": "10,032,363.56",
        "field4": "11,153,812.60",
        "field5": "未分配利润",
        "field6": "903,081.11",
        "field7": "390,809.38",
        "field8": "903,081.11",
    },
    {
        "field1": "总资产",
        "field2": "13,122,892.24",
        "field3": "10,985,815.25",
        "field4": "13,122,892.24",
        "field5": "所有者权益",
        "field6": "7,861,616.19",
        "field7": "7,193,858.49",
        "field8": "7,861,616.19",
    },
]
let gridData5 = [
    {
        "field1": "经营性现金流入",
        "field2": "121,725.13",
        "field3": "133,800.00",
        "field4": "121,725.13",
    },
    {
        "field1": "经营性现金流出",
        "field2": "197,928.27",
        "field3": "151,210.92",
        "field4": "197,928.27",
    },
    {
        "field1": "经营性净现金流",
        "field2": "-76,203.14",
        "field3": "-17,410.92",
        "field4": "-76,203.14",
    },
    {
        "field1": "投资性现金流入",
        "field2": "705,546.55",
        "field3": "599,393.69",
        "field4": "705,546.55",
    },
    {
        "field1": "投资性现金流出",
        "field2": "453,048.05",
        "field3": "576,359.05",
        "field4": "453,048.05",
    },
    {
        "field1": "投资性净现金流",
        "field2": "252,498.49",
        "field3": "23,034.64",
        "field4": "252,498.49",
    },
    {
        "field1": "筹资性现金流入",
        "field2": "121,725.13",
        "field3": "133,800.00",
        "field4": "121,725.13",
    },
    {
        "field1": "筹资性现金流出",
        "field2": "762,205.21",
        "field3": "562,999.98",
        "field4": "762,205.21",
    },
    {
        "field1": "筹资性净现金流",
        "field2": "727,435.16",
        "field3": "292,000.02",
        "field4": "727,435.16",
    },
]
let gridData6 = [
    {
        "field1": "净资产收益率(%)",
        "field2": "8.27",
        "field3": "5.50",
        "field4": "11.40", 
        "field5": "3.10", 
    },
    {
        "field1": "总资产报酬率(%)",
        "field2": "6.78",
        "field3": "3.60",
        "field4": "6.10", 
        "field5": "1.30", 
    },
    {
        "field1": "营业利润率(%)",
        "field2": "0.00",
        "field3": "40,612.89 ",
        "field4": "10.60", 
        "field5": "1.10", 
    },
    {
        "field1": "盈余现金保障倍数(倍)",
        "field2": "-0.12",
        "field3": "-0.09",
        "field4": "13.10", 
        "field5": "1.30", 
    },
    {
        "field1": "成本费用占营业收入比重(%)",
        "field2": "0.00",
        "field3": "23,298.26",
        "field4": "88.80", 
        "field5": "97.40", 
    },

]
let gridData7 = [
    {
        "field1": "总资产周转率(次)",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "1.2", 
        "field5": "0.50", 
    },
    {
        "field1": "应收账款周转率(次)",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "10.90", 
        "field5": "1.30", 
    },
    {
        "field1": "流动资产周转率(次)",
        "field2": "0.00",
        "field3": "40,612.89 ",
        "field4": "10.60", 
        "field5": "1.10", 
    },
    {
        "field1": "资产现金回收率(%)",
        "field2": "-0.12",
        "field3": "-0.09",
        "field4": "13.10", 
        "field5": "1.30", 
    },
    {
        "field1": "存货周转率(次)",
        "field2": "0.00",
        "field3": "23,298.26",
        "field4": "88.80", 
        "field5": "97.40", 
    },

]
let gridData8 = [
    {
        "field1": "资产负债率(%)",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "1.2", 
        "field5": "0.50", 
    },
    {
        "field1": "已获利息倍数(倍)",
        "field2": "0.00",
        "field3": "0.00",
        "field4": "10.90", 
        "field5": "1.30", 
    },
    {
        "field1": "速动比率(%)",
        "field2": "0.00",
        "field3": "40,612.89 ",
        "field4": "10.60", 
        "field5": "1.10", 
    },
    {
        "field1": "现金流动负债比率(%)",
        "field2": "-0.12",
        "field3": "-0.09",
        "field4": "13.10", 
        "field5": "1.30", 
    },
    {
        "field1": "带息负债比率(%)",
        "field2": "0.00",
        "field3": "23,298.26",
        "field4": "88.80", 
        "field5": "97.40", 
    },

]
let gridData9 = [
    {
        "field1": "营业收入增长率(%)",
        "field2": "-100.00",
        "field3": "0.00",
        "field4": "1.2", 
        "field5": "0.50", 
    },
    {
        "field1": "营业收入增长率(%)",
        "field2": "224.87",
        "field3": "0.00",
        "field4": "10.90", 
        "field5": "1.30", 
    },
    {
        "field1": "总资产增长率(%)",
        "field2": "19.45",
        "field3": "0.00",
        "field4": "15.30", 
        "field5": "1.10", 
    },
    {
        "field1": "资本积累率(%)",
        "field2": "9.28",
        "field3": "0.00",
        "field4": "22.00", 
        "field5": "1.30", 
    },

]
let gridData10 = [
    {
        "field1": "授信总额",
        "field2": "0.00",
    
    },
    {
        "field1": "其中：贷款类业务",
        "field2": "0.00",
    
    },
    {
        "field1": "非贷款类业务",
        "field2": "0.00",
     
    },
]
export {
    gridData,
    gridData1,
    gridData2,
    gridData3,
    gridData4,
    gridData5,
    gridData6,
    gridData7,
    gridData8,
    gridData9,
    gridData10,
}